Repository: zahraadelbani/club-management-backup
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar, fa, ru, tr

source: These options specify the paths to select. Note that much like git itself, renames are NOT followed so you may need to specify multiple paths, e.g. `--path olddir/ --path newdir/`
ar: تحدد هذه الخيارات المسارات المراد تحديدها. لاحظ أنه مثل Git نفسها ، لا يتم اتباع إعادة تسمية لذلك قد تحتاج إلى تحديد المضاعف المسارات ، على سبيل المثال `-path Olddir/--Path Newdir/`
fa: این گزینه ها مسیرهای انتخاب را مشخص می کند. توجه داشته باشید که بسیار شبیه Git خود ، تغییر نام ها دنبال نمی شود ، بنابراین ممکن است شما نیاز به چندین بار مشخص کنید مسیرها ، به عنوان مثال `-مسیر اولدیر/--پات Newdir/`
ru: Эти параметры указывают пути для выбора. Обратите внимание, что очень похоже на git Само по себе переирмы не соблюдаются, поэтому вам может потребоваться указать несколько Пути, например, `-ПАТА OLDDIR/-PATH NEWDIR/`
tr: Bu seçenekler seçilecek yolları belirtir. Git gibi kendisi, yeniden adlandırmalar takip edilmez, böylece birden çok belirtmeniz gerekebilir Yollar, ör. `--Path Olddir/--Path newdir/`

source: Exact paths (files or directories) to include in filtered history. Multiple --path options can be specified to get a union of paths.
ar: المسارات الدقيقة (الملفات أو الدلائل) لتضمينها في التاريخ الذي تمت تصفيته. يمكن تحديد خيارات المسار المتعددة للحصول على اتحاد للمسارات.
fa: مسیرهای دقیق (پرونده ها یا دایرکتوری ها) در تاریخ فیلتر شده قرار می گیرند. گزینه های چند مسیر را می توان برای به دست آوردن اتحادیه مسیرها مشخص کرد.
ru: Точные пути (файлы или каталоги) для включения в фильтрованную историю. Можно указать множественные варианты пути, чтобы получить объединение путей.
tr: Filtrelenmiş geçmişe dahil edilecek kesin yollar (dosyalar veya dizinler). Bir yol birliği almak için birden fazla yol seçeneği belirtilebilir.

source: Glob of paths to include in filtered history. Multiple --path-glob options can be specified to get a union of paths.
ar: كرة من المسارات لتضمينها في التاريخ المصفى. يمكن تحديد خيارات متعددة-مسار قاحلة للحصول على اتحاد للمسارات.
fa: Glob of Maths To That در تاریخ فیلتر شده. برای به دست آوردن اتحادیه مسیرها ، می توان گزینه های چند گلی را مشخص کرد.
ru: Глобус путей, чтобы включить в фильтрованную историю. Можно указать множественные варианты-пат-глоба, чтобы получить союз путей.
tr: Filtrelenmiş tarihe dahil edilecek yollar küresi. Yollar birliği almak için çoklu--glob seçeneği belirtilebilir.

source: Regex of paths to include in filtered history. Multiple --path-regex options can be specified to get a union of paths
ar: Regex من المسارات لتضمين في التاريخ المصفى. يمكن تحديد خيارات متعددة-مربع-مرمى-للحصول على اتحاد للمسارات
fa: Regex مسیرهایی که در تاریخ فیلتر شده قرار می گیرند. گزینه های چند منظوره-Path-rege را می توان برای به دست آوردن اتحادیه مسیرها مشخص کرد
ru: Направление путей, чтобы включить в фильтрованную историю. Можно указать множественные опции Path-Regex, чтобы получить объединение путей
tr: Filtrelenmiş tarihe dahil edilecek yolların Regex'i. Bir Yol Birliği almak için çoklu-yol-regex seçenekleri belirtilebilir

source: Match on file base name instead of full path from the top of the repo. Incompatible with --path-rename, and incompatible with matching against directory names.
ar: تطابق الاسم الأساسي للملف بدلاً من المسار الكامل من الجزء العلوي من الريبو. غير متوافق مع-مسار القسم ، وغير متوافق مع المطابقة مع أسماء الدليل.
fa: به جای مسیر کامل از بالای repo ، نام پایگاه را مطابقت دهید. ناسازگار با نام-نام خانوادگی و ناسازگار با تطبیق در برابر نام های دایرکتوری.
ru: Сопоставьте на базовом имени файла вместо полного пути от вершины репо. Несовместимо с-пап-Ренэм и несовместимый с сопоставлением против имен каталогов.
tr: Repo'nun üst kısmından tam yol yerine dosya taban adında eşleştirin. ---Path-Rename ile bağdaşmaz ve dizin adlarıyla eşleşmeyle uyumsuzdur.

source: Renaming based on paths (see also --filename-callback)
ar: إعادة تسمية على أساس المسارات (انظر أيضًا-Filename-Callback)
fa: تغییر نام مبتنی بر مسیرها (همچنین به-فیلم-تماس-تماس بگیرید)
ru: Переименование на основе пути (см. Также-Filename-Sallback)
tr: Yollara dayalı olarak yeniden adlandırma (ayrıca bkz.--filename-callback)

source: Path to rename; if filename or directory matches OLD_NAME rename to NEW_NAME. Multiple --path-rename options can be specified. NOTE: If you combine filtering options with renaming ones, do not rely on a rename argument to select paths; you also need a filter to select them.
ar: طريق لإعادة تسمية إذا كان اسم الملف أو الدليل يتطابق مع إعادة تسمية Old_Name إلى New_Name. يمكن تحديد خيارات متعددة-مسار القطع. ملاحظة: إذا قمت بدمج خيارات التصفية مع إعادة تسمية الخيارات ، فلا تعتمد على وسيطة إعادة تسمية لتحديد المسارات ؛ تحتاج أيضًا إلى مرشح لتحديدها.
fa: مسیر تغییر نام ؛ اگر نام پرونده یا دایرکتوری با تغییر نام Old_Name به new_name مطابقت داشته باشد. گزینه های چند نام خانوادگی را می توان مشخص کرد. توجه: اگر گزینه های فیلتر را با تغییر نام استفاده می کنید ، برای انتخاب مسیرها به یک آرگومان تغییر نام اعتماد نکنید. همچنین برای انتخاب آنها به یک فیلتر نیاز دارید.
ru: Путь к переименованию; Если имя файла или каталог соответствует old_name rename в new_name. Можно указать несколько параметров-паточек. Примечание. Если вы объединяете параметры фильтрации с переименованием, не полагайтесь на аргумент переименования, чтобы выбрать пути; Вам также нужен фильтр, чтобы выбрать их.
tr: Yeniden adlandırma yolu; Dosya adı veya dizin, Old_Name yeniden adını new_name ile eşleştirirse. Birden fazla-yol-renam seçeneği belirtilebilir. Not: Filtreleme seçeneklerini yeniden adlandırma seçenekleriyle birleştirirseniz, yolları seçmek için yeniden adlandırma argümanına güvenmeyin; Ayrıca onları seçmek için bir filtreye ihtiyacınız var.

source: Path shortcuts
ar: اختصارات المسار
fa: میانبرهای مسیر
ru: Переход ярлыков
tr: Yol kısayolları

source: Specify several path filtering and renaming directives, one per line. Lines with '==>' in them specify path renames, and lines can begin with 'literal:' (the default), 'glob:', or 'regex:' to specify different matching styles. Blank lines and lines starting with a '#' are ignored.
ar: حدد العديد من توجيهات تصفية المسار وإعادة تسميتها ، واحدة لكل سطر. الخطوط التي تحتوي على '==>' فيها حدد إعادة تسمية المسار ، ويمكن أن تبدأ الخطوط بـ "حرفي:" (الافتراضي) أو "Glob:" أو "regex:" لتحديد أنماط مطابقة مختلفة. يتم تجاهل الخطوط والخطوط الفارغة التي تبدأ بـ "#".
fa: چندین دستورالعمل فیلتر و تغییر نام مسیر ، یک در هر خط را مشخص کنید. خطوط با '==>' در آنها تغییر نام های مسیر را مشخص می کنند ، و خطوط می توانند با "لفظی" شروع شوند: (پیش فرض) ، "گل:" یا "Regex:" برای مشخص کردن سبک های تطبیق مختلف. خطوط و خطوط خالی با شروع "#" نادیده گرفته می شوند.
ru: Укажите несколько директив фильтрации и переименования путей, по одному на строку. Линии с '==>' в них указывают переиме на пути, а строки могут начинаться с «Literal:» (по умолчанию), «глобус:» или «regex:», чтобы указать различные стили сопоставления. Пустые линии и линии, начиная с «#», игнорируются.
tr: Satır başına bir tane olmak üzere birkaç yol filtreleme ve yeniden adlandırma yönergesini belirtin. İçinde '==>' olan satırlar, yol yeniden adlarını belirtir ve satırlar farklı eşleşen stilleri belirtmek için 'Liteal:', 'Glob:' veya 'Regex:' ile başlayabilir. '#' İle başlayan boş çizgiler ve çizgiler göz ardı edilir.

source: Only look at history that touches the given subdirectory and treat that directory as the project root. Equivalent to using '--path DIRECTORY/ --path-rename DIRECTORY/:'
ar: انظر فقط إلى التاريخ الذي يمس الدليل الفرعي المعطى وعلاج هذا الدليل كجذر المشروع. أي ما يعادل استخدام "-دليث مسار/-دليل القلص/ القلص/:"
fa: فقط به تاریخ نگاه کنید که زیر مجموعه های داده شده را لمس می کند و آن فهرست را به عنوان ریشه پروژه رفتار می کند. معادل استفاده از دایرکتوری "-مسیر/--مسیر-نام-نام/:"
ru: Посмотрите только на историю, которая затрагивает данную подкаталог и рассматривает этот каталог как корень проекта. Эквивалентно использованию каталога '--path/--path-rename Directory/:'
tr: Yalnızca verilen alt dizine dokunan geçmişe bakın ve bu dizini proje kökü olarak ele alın. '---Path-rename dizinini kullanmaya eşdeğer

source: Treat the project root as if it were under DIRECTORY. Equivalent to using '--path-rename :DIRECTORY/'
ar: تعامل مع جذر المشروع كما لو كان تحت الدليل. أي ما يعادل استخدام "-مسار القلص: دليل/'
fa: ریشه پروژه را طوری درمان کنید که گویی تحت فهرست قرار دارد. معادل استفاده از "--path-rename: دایرکتوری/"
ru: Относитесь к корнеу проекта, как если бы он был в каталоге. Эквивалент использования '--path-rename: каталог/'
tr: Proje kökündeki dizin altındaymış gibi davranın. '---Path-rename: dizin/' kullanmaya eşdeğer

source: Content editing filters (see also --blob-callback)
ar: مرشحات تحرير المحتوى (انظر أيضًا-Plob-Callback)
fa: فیلترهای ویرایش محتوا (همچنین نگاه کنید به-blob-callback)
ru: Фильтры редактирования контента (см. Также-Blob-Callback)
tr: İçerik Düzenleme Filtreleri (ayrıca bkz. --Blob-callback)

source: A file with expressions that, if found, will be replaced. By default, each expression is treated as literal text, but 'regex:' and 'glob:' prefixes are supported. You can end the line with '==>' and some replacement text to choose a replacement choice other than the default of '{}'.
ar: يتم استبدال ملف مع تعبيرات ، إذا وجدت ،. بشكل افتراضي ، يتم التعامل مع كل تعبير كنص حرفي ، ولكن "regex:" و "Glob:" يتم دعم البادئات. يمكنك إنهاء السطر باستخدام "==>" وبعض النص البديل لاختيار اختيار بديل بخلاف الافتراضي لـ "{}".
fa: پرونده ای با عباراتی که در صورت یافتن ، جایگزین می شود. به طور پیش فرض ، هر عبارت به عنوان متن تحت اللفظی رفتار می شود ، اما "Regex:" و "Glob:" پیشوندها پشتیبانی می شوند. می توانید خط را با '==>' و برخی از متن های جایگزینی به پایان برسانید تا یک انتخاب جایگزین غیر از پیش فرض "{}" انتخاب کنید.
ru: Файл с выражениями, который, если он найден, будет заменен. По умолчанию каждое выражение рассматривается как буквальный текст, но «regex:» и «glob:» поддерживаются префиксы. Вы можете закончить строку с помощью '==>' и некоторым текстом замены, чтобы выбрать замену выбора, кроме по умолчанию '{}'.
tr: Bulunursa, değiştirilecek ifadelere sahip bir dosya. Varsayılan olarak, her ifade gerçek metin olarak ele alınır, ancak 'Regex:' ve 'Glob:' önekleri desteklenir. '{}' Varsayılanı dışında bir yedek seçim seçmek için satırı '==>' ve bazı yedek metinlerle bitirebilirsiniz.

source: Strip blobs (files) bigger than specified size (e.g. '5M', '2G', etc)
ar: STRIP BLOBS (ملفات) أكبر من الحجم المحدد (على سبيل المثال "5M" ، "2G" ، إلخ)
fa: حباب های نوار (پرونده ها) بزرگتر از اندازه مشخص شده (به عنوان مثال "5m" ، "2G" و غیره)
ru: Снительные капли (файлы) больше указанного размера (например, «5m», «2G» и т. Д.)
tr: Strip Blobs (dosyalar) Belirtilen boyuttan daha büyük (örn. '5m', '2g', vb.)

source: Read git object ids from each line of the given file, and strip all of them from history
ar: اقرأ معرفات كائن GIT من كل سطر من الملف المحدد ، وتجريدها جميعًا من التاريخ
fa: شناسه های Object Git را از هر خط از پرونده داده شده بخوانید و همه آنها را از تاریخ جدا کنید
ru: Прочитайте идентификаторы объекта GIT из каждой строки данного файла и лишить их всех из истории
tr: Git nesne kimliklerini verilen dosyanın her satırından okuyun ve hepsini geçmişten çıkarın

source: Renaming of refs (see also --refname-callback)
ar: إعادة تسمية الحكام (انظر أيضًا-REFName-Callback)
fa: تغییر نام Refs (همچنین به-refname-callback مراجعه کنید)
ru: Переименование рефери (см. Также-refname-callback)
tr: Refs Yeniden Adlandırma (ayrıca bkz.-Refname-Callback)

source: Rename tags starting with OLD to start with NEW. For example, --tag-rename foo:bar will rename tag foo-1.2.3 to bar-1.2.3; either OLD or NEW can be empty.
ar: إعادة تسمية العلامات التي تبدأ مع القديمة لتبدأ مع الجديد. على سبيل المثال ،-Tag-Tag-Rename Foo: Bar سيعيد تسمية Tag Foo-1.2.3 إلى Bar-1.2.3 ؛ يمكن أن يكون قديمًا أو جديدًا فارغًا.
fa: برای شروع با جدید ، برچسب های شروع شده از قدیمی را تغییر دهید. به عنوان مثال ،--برچسب-رن نام FOO: BAR تغییر نام TAG FOO-1.2.3 به BAR-1.2.3 ؛ قدیمی یا جدید می تواند خالی باشد.
ru: Переименовать теги, начиная со старого, чтобы начать с нового. Например,-tag-rename foo: bar будет переименовать Tag foo-1.2.3 до bar-1.2.3; Старый или новый может быть пустым.
tr: Yeni ile başlamak için eski ile başlayan etiketleri yeniden adlandırın. Örneğin,--tag-rename foo: Bar, foo-1.2.3 etiketini bar-1.2.3 olarak yeniden adlandırır; Eski ya da yeni boş olabilir.

source: Filtering of commit messages (see also --message-callback)
ar: تصفية رسائل الالتزام (انظر أيضًا-Message-Callback)
fa: فیلتر کردن پیام های تعهد (همچنین به پیام رسانی مراجعه کنید)
ru: Фильтрация сообщений о коммите (см. Также-Message-Callback)
tr: Taahhüt mesajlarının filtrelenmesi (ayrıca bkz.-Message-Callback)

source: A file with expressions that, if found in commit or tag messages, will be replaced. This file uses the same syntax as --replace-text.
ar: سيتم استبدال ملف له تعبيرات ، إذا وجدت في رسائل الالتزام أو العلامات. يستخدم هذا الملف نفس بناء الجملة كما-REPLACE-TEXT.
fa: پرونده ای با عباراتی که در صورت یافتن پیام های تعهد یا برچسب ، جایگزین می شود. این فایل از همان نحو به عنوان--place-text استفاده می کند.
ru: Файл с выражениями, который, если он будет найден в сообщении Commit или Tag, будет заменен. В этом файле используется тот же синтаксис, что и-Replace-Text.
tr: Taahhüt veya etiket mesajlarında bulunursa ifadeli bir dosya değiştirilecektir. Bu dosya-Replace-Text ile aynı sözdizimini kullanır.

source: By default, since commits are rewritten and thus gain new hashes, references to old commit hashes in commit messages are replaced with new commit hashes (abbreviated to the same length as the old reference). Use this flag to turn off updating commit hashes in commit messages.
ar: بشكل افتراضي ، نظرًا لإعادة كتابة الالتزامات وبالتالي اكتساب تجزئة جديدة ، يتم استبدال الإشارات إلى تجزئة الالتزام القديمة في رسائل الالتزام بتجزئة جديدة (اختصار بنفس طول المرجع القديم). استخدم هذا العلامة لإيقاف تحديث تجزئة الالتزام في رسائل الالتزام.
fa: به طور پیش فرض ، از آنجا که تعهدات بازنویسی می شوند و به این ترتیب هش جدید به دست می آورند ، اشاراتی به هش های مرتکب قدیمی در پیام های متعهد با هش های تعهد جدید جایگزین می شود (مختصر به همان طول مرجع قدیمی). از این پرچم برای خاموش کردن به روزرسانی هش در پیام های متعهد استفاده کنید.
ru: По умолчанию, поскольку коммиты переписаны и, таким образом, получают новые хэши, ссылки на старые хэши коммита в сообщениях заменены новыми хэшами коммита (сокращенно до той же длины, что и старая ссылка). Используйте этот флаг, чтобы отключить обновление хэшей коммита в сообщениях.
tr: Varsayılan olarak, taahhütler yeniden yazıldığından ve böylece yeni karmalar kazandığından, taahhüt mesajlarında eski taahhüt karmalarına referanslar yeni taahhüt karmalarıyla değiştirilir (eski referansla aynı uzunluğa kısaltılır). Taahhüt mesajlarında taahhüt karma güncelleme kapatmak için bu bayrağı kullanın.

source: Do not reencode commit messages into UTF-8. By default, if the commit object specifies an encoding for the commit message, the message is re-encoded into UTF-8.
ar: لا تقم بإعادة تخصيص الرسائل في UTF-8. بشكل افتراضي ، إذا كان كائن الالتزام يحدد ترميزًا لرسالة الالتزام ، فسيتم إعادة ترميز الرسالة إلى UTF-8.
fa: پیام های متعهد را به UTF-8 ارسال نکنید. به طور پیش فرض ، اگر شیء متعهد رمزگذاری پیام تعهد را مشخص کند ، پیام دوباره در UTF-8 رمزگذاری می شود.
ru: Не переоцените сообщения о коммите в UTF-8. По умолчанию, если объект Commit определяет кодирование для сообщения Commit, сообщение перекодируется в UTF-8.
tr: UTF-8'e işlemleri yeniden incelemeyin. Varsayılan olarak, taahhüt nesnesi taahhüt mesajı için bir kodlama belirlerse, mesaj UTF-8 olarak yeniden kodlanır.

source: Filtering of names & emails (see also --name-callback and --email-callback)
ar: تصفية الأسماء ورسائل البريد الإلكتروني (انظر أيضًا-اسم العلم والمعاد)
fa: فیلتر کردن نام ها و ایمیل ها (همچنین به نام-نام-تماس و--تماس-تماس بگیرید)
ru: Фильтрация имен и электронных писем (см. Также-NAME-Callback и-email-callback)
tr: Adların ve e-postaların filtrelenmesi (ayrıca bkz.-Name-Callback ve-Email-Callback)

source: Use specified mailmap file (see git-shortlog(1) for details on the format) when rewriting author, committer, and tagger names and emails. If the specified file is part of git history, historical versions of the file will be ignored; only the current contents are consulted.
ar: استخدم ملف MailMap المحدد (انظر Git-Shortlog (1) للحصول على تفاصيل حول التنسيق) عند إعادة كتابة أسماء المؤلف والالتزام والعلم ورسائل البريد الإلكتروني. إذا كان الملف المحدد جزءًا من تاريخ GIT ، فسيتم تجاهل الإصدارات التاريخية من الملف ؛ يتم استشارة المحتويات الحالية فقط.
fa: هنگام بازنویسی نویسنده ، Committer و Tagger نام ها و ایمیل ها ، از پرونده MailMap مشخص شده استفاده کنید (برای جزئیات بیشتر در مورد قالب) به Git-Shortlog (1) مراجعه کنید). اگر پرونده مشخص شده بخشی از تاریخ GIT باشد ، نسخه های تاریخی پرونده نادیده گرفته می شود. فقط مطالب فعلی مشاوره می شود.
ru: Используйте указанный файл Mailmap (см. Git-Shortlog (1) для получения подробной информации о формате), когда переписывает имена автора, комитета и теггеров. Если указанный файл является частью истории GIT, исторические версии файла будут проигнорированы; Консультируется только текущее содержимое.
tr: Yazar, komisyoncu ve etiketçi adlarını ve e-postaları yeniden yazarken belirtilen MailMap dosyasını (formatta ayrıntılar için GIT-Shortlog (1) bkz. Belirtilen dosya GIT geçmişinin bir parçasıysa, dosyanın geçmiş sürümleri yok sayılır; Yalnızca mevcut içeriğe danışılır.

source: Same as: '--mailmap .mailmap'
ar: مثل: '-mailmap .mailmap "
fa: همان: '-mailmap .mailmap'
ru: То же, что и: '-mailmap .mailmap'
tr: Aynı: '--mailmap .Mailmap'

source: Parent rewriting
ar: إعادة كتابة الوالدين
fa: بازنویسی والدین
ru: Переписывание родителей
tr: Ebeveyn Yeniden Yazma

source: How to handle replace refs (see git-replace(1)). Replace refs can be added during the history rewrite as a way to allow users to pass old commit IDs (from before git-filter-repo was run) to git commands and have git know how to translate those old commit IDs to the new (post-rewrite) commit IDs. Also, replace refs that existed before the rewrite can either be deleted or updated. The choices to pass to --replace-refs thus need to specify both what to do with existing refs and what to do with commit rewrites. Thus 'update-and-add' means to update existing replace refs, and for any commit rewrite (even if already pointed at by a replace ref) add a new refs/replace/ reference to map from the old commit ID to the new commit ID. The default is update-no-add, meaning update existing replace refs but do not add any new ones. There is also a special 'old-default' option for picking the default used in versions prior to git-filter-repo-2.45, namely 'update-and-add' upon the first run of git-filter-repo in a repository and 'update-or-add' if running git-filter-repo again on a repository.
ar: كيفية التعامل مع استبدال الحكام (انظر Git-Replace (1)). يمكن إضافة Replive Refs أثناء إعادة كتابة History كوسيلة للسماح للمستخدمين بتمرير معرفات الالتزام القديمة (من قبل تم تشغيل GIT-Filter-Repo) إلى أوامر GIT وتجاهل كيفية ترجمة معرفات الالتزام القديمة إلى معرفات الالتزام الجديدة (بعد الظهر). أيضا ، استبدل الحكام التي كانت موجودة قبل إعادة كتابة أو تحديثها. وبالتالي ، فإن اختيارات الانتقال إلى-Resplace-Refs تحتاج إلى تحديد ما يجب فعله مع الحكام الحالية وما يجب فعله مع إعادة كتابة الالتزام. وبالتالي فإن "التحديث والإضافة" يعني تحديث Replar Resps الحالي ، وبالنسبة لأي إعادة كتابة للالتزام (حتى لو تم الإشارة بالفعل إلى REF REF) ، أضف Refs/ Replace/ Reference جديدًا إلى معرف الالتزام القديم إلى معرف الالتزام الجديد. الافتراضي هو التحديث لا ، مما يعني تحديث Replar REFS ولكن لا تضيف أي منها جديد. يوجد أيضًا خيار "Default" الخاص لاختيار الافتراضي المستخدم في الإصدارات قبل GIT-Filter-Repo-2.45 ، وهو "التحديث والأضيف" عند الجولة الأولى من المرشح الجيوي في مستودع و "تحديث أو مضاف" إذا كان تشغيله في المرشح مرة أخرى على عقب.
fa: نحوه رسیدگی به Refs (به Git-Replace (1) مراجعه کنید). جایگزین Refs می تواند در طول بازنویسی تاریخ اضافه شود به عنوان راهی برای اجازه دادن به کاربران برای تصویب شناسه های قدیمی (از قبل از اجرای Git-Filter-Repo) به دستورات GIT و GIT می داند که چگونه می توان آن شناسه های قدیمی را به شناسه های جدید (پس از خرید) ترجمه کرد. همچنین ، می توانید Refs را که قبل از بازنویسی وجود دارد ، جایگزین کنید یا به روز شود. بنابراین انتخاب هایی که باید به-Ref-Refs منتقل شود ، باید مشخص کند که چه کاری باید با Refs موجود انجام شود و چه کاری باید با بازنویسی های متعهد انجام شود. بنابراین "به روزرسانی و ADD" به معنای به روزرسانی Refs Reples موجود است ، و برای هر بازنویسی تعهد (حتی اگر قبلاً توسط یک Ref Ref به آن اشاره شده باشد) یک Refs/ Replace/ Replace/ مرجع جدید را از شناسه تعهد قدیمی به شناسه تعهد جدید اضافه کنید. پیش فرض بروزرسانی-NO-ADD است ، به معنای بروزرسانی Reps Reples موجود است اما موارد جدیدی را اضافه نمی کند. همچنین یک گزینه خاص "پیش فرض قدیمی" برای انتخاب پیش فرض مورد استفاده در نسخه های قبل از Git-Filter-Repo-2.45 ، یعنی "به روزرسانی و اضافه کردن" در اولین اجرای Git-Filter-Repo در یک مخزن و "به روزرسانی-یا ADD" در صورت اجرای مجدداً Git-Filter-Repo در یک مخزن وجود دارد.
ru: Как справиться с заменой ссылок (см. Git-Replace (1)). Замена ссылок может быть добавлена ​​во время переписывания истории как способ позволить пользователям передавать старые идентификаторы коммита (от Git-Filter-Repo), чтобы запустить команды GIT, и дайте GIT знать, как перевести эти старые идентификаторы коммиты на новые (пост-заворные) идентификаторы коммита. Кроме того, замените ссылки, которые существовали до переписывания, можно либо удалить или обновить. Таким образом, выбор для перехода-заменить реф, необходимо указать как, что делать с существующими ссылками, так и что делать с переписыванием коммита. Таким образом, «обновление и добавление» означает обновление существующих переводов замены, и для любого перезаписывания коммита (даже если уже указано в замене ссылки), добавьте новые ссылки/ заменить/ ссылаться на карту со старого идентификатора коммита на новый идентификатор коммита. По умолчанию обновленная обновление, что означает обновление существующих ссылок, но не добавляйте никаких новых. Существует также специальный вариант «старого декорации» для выбора по умолчанию, используемому в версиях перед GIT-Filter-Repo-2,45, а именно «обновление и добавление» при первом заезде GIT-репо-репо в репозитории и «обновление или добавление», если снова запустит Git-Filter-Repo в репозитории.
tr: Refs'in değiştirilmesi nasıl işlenir (bkz. Git-replace (1)). Değiştirme Refs, kullanıcıların GIT komutlarına (git-filtre-repo çalıştırılmadan önce) geçmesine izin vermenin bir yolu olarak geçmiş yeniden yazma sırasında eklenebilir ve bu eski taahhüt kimliklerini yeni (post-regrite) taahhüt kimliklerine nasıl çevireceklerini bilmelidir. Ayrıca, yeniden yazmadan önce var olan referansları değiştirin veya güncellenebilir. Bu nedenle --Replace-Refs'e geçilecek seçeneklerin hem mevcut referanslarla ne yapacağını hem de taahhüt yeniden yazma ile ne yapacağını belirtmeleri gerekir. Bu nedenle 'Güncelleme ve Add', mevcut değiştirme referanslarını güncellemek ve herhangi bir taahhüt yeniden yazma için (bir Refe Ref tarafından işaretlenmiş olsa bile) eski taahhüt kimliğinden yeni taahhüt kimliğine harita için yeni bir refs/ değiştirme/ referans ekleyin. Varsayılan, güncelleme-no-add, yani güncelleme mevcut değiştirme referansları, ancak yenilerini eklemeyin. Git-Filter-Repo-2.45'ten önceki sürümlerde kullanılan varsayılanı seçmek için özel bir 'eski alma' seçeneği, yani bir depoda Git-Filter-Repo'nun ilk çalışmasında 'Güncelleme-ve Add', bir römorkör üzerinde Git-Filter-Repo'yu tekrar çalıştırıyorsa.
