Repository: zahraadelbani/club-management-backup
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar, fa, ru, tr

source: Floating point number
ar: رقم نقطة العائمة
fa: شماره نقطه شناور
ru: Номер плавающего заглавного значения
tr: Kayan nokta numarası

source: Integer
ar: عدد صحيح
fa: عدد صحیح
ru: Целое число
tr: Tamsayı

source: Big (8 byte) integer
ar: عدد صحيح (8 بايت)
fa: عدد صحیح (8 بایت)
ru: Большое (8 байтов) целое число
tr: Büyük (8 bayt) tamsayı

source: Small integer
ar: عدد صحيح صغير
fa: عدد صحیح
ru: Небольшое целое число
tr: Küçük tamsayı

source: IPv4 address
ar: عنوان IPv4
fa: آدرس IPv4
ru: Адрес IPv4
tr: IPv4 adresi

source: IP address
ar: عنوان IP
fa: آدرس IP
ru: IP -адрес
tr: IP adresi

source: Boolean (Either True, False or None)
ar: منطقية (إما صحيحة أو خاطئة أو لا شيء)
fa: بولی (یا درست ، نادرست یا هیچکدام)
ru: Логический (либо правда, ложь или нет)
tr: Boolean (doğru, yanlış veya yok)

source: Positive big integer
ar: عدد صحيح إيجابي
fa: عدد صحیح بزرگ مثبت
ru: Положительное большое целое число
tr: Pozitif büyük tamsayı

source: Positive integer
ar: عدد صحيح إيجابي
fa: عدد صحیح مثبت
ru: Положительное целое число
tr: Pozitif tamsayı

source: Positive small integer
ar: عدد صحيح إيجابي
fa: عدد صحیح کوچک مثبت
ru: Положительное небольшое целое число
tr: Pozitif küçük tamsayı

source: Text
ar: نص
fa: متن
ru: Текст
tr: Metin

source: Time
ar: وقت
fa: زمان
ru: Время
tr: Zaman

source: Raw binary data
ar: البيانات الثنائية الخام
fa: داده های دودویی خام
ru: Необработанные бинарные данные
tr: Ham ikili veriler

source: Universally unique identifier
ar: معرف فريد عالمي
fa: شناسه جهانی منحصر به فرد
ru: Универсально уникальный идентификатор
tr: Evrensel olarak benzersiz tanımlayıcı

source: A JSON object
ar: كائن JSON
fa: یک شی json
ru: Объект JSON
tr: Bir JSON Nesnesi

source: Value must be valid JSON.
ar: يجب أن تكون القيمة صالحة JSON.
fa: مقدار باید JSON معتبر باشد.
ru: Значение должно быть действительным JSON.
tr: Değer geçerli olmalı JSON.

source: Foreign Key (type determined by related field)
ar: المفتاح الخارجي (النوع الذي يحدده الحقل ذي الصلة)
fa: کلید خارجی (نوع تعیین شده توسط قسمت مرتبط)
ru: Иностранный ключ (тип определяется с помощью связанного поля)
tr: Yabancı Anahtar (ilgili alana göre belirlenen tip)

source: One-to-one relationship
ar: علاقة فردية
fa: رابطه یک به یک
ru: Отношения один на один
tr: Bire bir ilişki

source: Many-to-many relationship
ar: العديد من العلاقة إلى الرجل
fa: رابطه ای با بسیاری از افراد
ru: Многие отношения отношений
tr: Çok çok ilişki

source: This field is required.
ar: هذه الخانة مطلوبه.
fa: این قسمت مورد نیاز است.
ru: Это поле обязательно к заполнению.
tr: Bu alan gereklidir.

source: Enter a whole number.
ar: أدخل رقمًا كاملاً.
fa: یک عدد کامل وارد کنید.
ru: Введите целое число.
tr: Bir tam sayı girin.

source: Enter a valid date.
ar: أدخل تاريخ صالح.
fa: یک تاریخ معتبر وارد کنید.
ru: Введите действительную дату.
tr: Geçerli bir tarih girin.

source: Enter a valid time.
ar: أدخل وقتًا صالحًا.
fa: یک زمان معتبر وارد کنید.
ru: Введите действительное время.
tr: Geçerli bir zaman girin.

source: Enter a valid date/time.
ar: أدخل تاريخ/وقت صالح.
fa: یک تاریخ/زمان معتبر وارد کنید.
ru: Введите действительную дату/время.
tr: Geçerli bir tarih/saat girin.

source: Enter a valid duration.
ar: أدخل مدة صالحة.
fa: مدت زمان معتبری را وارد کنید.
ru: Введите действительную продолжительность.
tr: Geçerli bir süre girin.

source: The number of days must be between {min_days} and {max_days}.
ar: يجب أن يكون عدد الأيام بين {min_days} و {max_days}.
fa: تعداد روزها باید بین {min_days} و {max_days} باشد.
ru: Количество дней должно быть между {min_days} и {max_days}.
tr: Gün sayısı {min_days} ve {max_days} arasında olmalıdır.

source: No file was submitted. Check the encoding type on the form.
ar: لم يتم تقديم أي ملف. تحقق من نوع الترميز على النموذج.
fa: هیچ پرونده ای ارسال نشده است. نوع رمزگذاری را روی فرم بررسی کنید.
ru: Файл не был отправлен. Проверьте тип кодирования в форме.
tr: Hiçbir dosya gönderilmedi. Kodlama türünü formdaki kontrol edin.

source: No file was submitted.
ar: لم يتم تقديم أي ملف.
fa: هیچ پرونده ای ارسال نشده است.
ru: Файл не был отправлен.
tr: Hiçbir dosya gönderilmedi.

source: The submitted file is empty.
ar: الملف المقدم فارغ.
fa: پرونده ارسال شده خالی است.
ru: Отправленный файл пуст.
tr: Gönderilen dosya boş.

source: Please either submit a file or check the clear checkbox, not both.
ar: يرجى إما إرسال ملف أو التحقق من مربع الاختيار الواضح ، وليس كلاهما.
fa: لطفاً یک پرونده را ارسال کنید یا کادر انتخاب شفاف را بررسی کنید ، نه هر دو.
ru: Пожалуйста, отправьте файл, либо проверьте флажок Clear, а не оба.
tr: Lütfen bir dosya gönderin veya her ikisini de değil onay kutusunu kontrol edin.

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
ar: تحميل صورة صالحة. الملف الذي قمت بتحميله إما ليس صورة أو صورة تالفة.
fa: یک تصویر معتبر بارگذاری کنید. پرونده ای که بارگذاری کردید یا یک تصویر یا یک تصویر خراب نبود.
ru: Загрузите допустимое изображение. Загруженный вами файл не был либо изображением, либо поврежденным изображением.
tr: Geçerli bir resim yükleyin. Yüklediğiniz dosya ya bir görüntü ya da bozuk bir görüntü değildi.

source: Enter a list of values.
ar: أدخل قائمة بالقيم.
fa: لیستی از مقادیر را وارد کنید.
ru: Введите список значений.
tr: Değerlerin bir listesini girin.

source: Enter a complete value.
ar: أدخل قيمة كاملة.
fa: یک مقدار کامل وارد کنید.
ru: Введите полное значение.
tr: Tam bir değer girin.

source: Enter a valid UUID.
ar: أدخل uuid صالح.
fa: یک UUID معتبر وارد کنید.
ru: Введите действительный UUID.
tr: Geçerli bir UUID girin.

source: Enter a valid JSON.
ar: أدخل JSON صالح.
fa: یک JSON معتبر وارد کنید.
ru: Введите действительный JSON.
tr: Geçerli bir JSON girin.

source: Order
ar: طلب
fa: ترتیب
ru: Заказ
tr: Emir

source: Please correct the duplicate values below.
ar: يرجى تصحيح القيم المكررة أدناه.
fa: لطفاً مقادیر تکراری زیر را اصلاح کنید.
ru: Пожалуйста, исправьте дубликаты значений ниже.
tr: Lütfen aşağıdaki yinelenen değerleri düzeltin.

source: The inline value did not match the parent instance.
ar: لا تتطابق القيمة المضمنة مع مثيل الأصل.
fa: مقدار درون خطی با نمونه والدین مطابقت نداشت.
ru: Встроенное значение не соответствовало родительскому экземпляру.
tr: Satır içi değer, üst örnekle eşleşmedi.

source: Select a valid choice. That choice is not one of the available choices.
ar: حدد خيارًا صالحًا. هذا الاختيار ليس أحد الخيارات المتاحة.
fa: یک انتخاب معتبر را انتخاب کنید. این انتخاب یکی از گزینه های موجود نیست.
ru: Выберите действительный выбор. Этот выбор не является одним из доступных вариантов.
tr: Geçerli bir seçim seçin. Bu seçim mevcut seçeneklerden biri değil.

source: Clear
ar: واضح
fa: پاک کردن
ru: Прозрачный
tr: Temizlemek

source: Currently
ar: حالياً
fa: در حال حاضر
ru: В настоящее время
tr: Şu anda

source: Change
ar: يتغير
fa: تغییر
ru: Изменять
tr: Değiştirmek

source: Unknown
ar: مجهول
fa: ناشناخته
ru: Неизвестный
tr: Bilinmeyen

source: Yes
ar: نعم
fa: بله
ru: Да
tr: Evet

source: No
ar: لا
fa: هیچ
ru: Нет
tr: HAYIR

source: yes,no,maybe
ar: نعم ، لا ، ربما
fa: بله ، نه ، شاید
ru: Да, нет, может быть
tr: Evet hayır, belki

source: p.m.
ar: مساءً.
fa: بعد از ظهر
ru: П.М.
tr: öğleden sonra.

source: a.m.
ar: أكون.
ru: являюсь.

source: PM
ar: مساءً
fa: نخست وزیر
ru: Премьер -министр
tr: ÖĞLEDEN SONRA

source: AM
ar: أكون
fa: من
ru: ЯВЛЯЮСЬ
tr: Ben

source: midnight
ar: منتصف الليل
fa: نیمه شب
ru: полночь
tr: gece yarısı

source: noon
ar: ظهر
fa: ظهر
ru: полдень
tr: öğlen

source: Monday
ar: الاثنين
fa: دوشنبه
ru: Понедельник
tr: Pazartesi

source: Tuesday
ar: يوم الثلاثاء
fa: سه شنبه
ru: Вторник
tr: Salı

source: Wednesday
ar: الأربعاء
fa: چهارشنبه
ru: Среда
tr: Çarşamba

source: Thursday
ar: يوم الخميس
fa: پنجشنبه
ru: Четверг
tr: Perşembe

source: Friday
ar: جمعة
fa: جمعه
ru: Пятница
tr: Cuma

source: Saturday
ar: السبت
fa: شنبه
ru: Суббота
tr: Cumartesi

source: Sunday
ar: الأحد
fa: یکشنبه
ru: Воскресенье
tr: Pazar

source: Mon
ar: الاثنين
fa: روز
ru: Пн

source: Tue
ar: الثلاثاء
fa: سه
ru: Вторник
tr: Salı

source: Wed
ar: تزوج
fa: عروسی کردن
ru: Обвенчались
tr: Evlenmek

source: Thu
ar: الخميس
fa: پنجه
ru: Ту

source: Fri
ar: الجمعة
fa: جمعه
ru: Пт
tr: Cum

source: Sat
ar: قعد
fa: نشست
ru: Сидящий
tr: Doygunluk

source: Sun
ar: شمس
fa: خورشید
ru: Солнце
tr: Güneş

source: January
ar: يناير
fa: ژانویه
ru: Январь
tr: Ocak

source: February
ar: فبراير
fa: فوریه
ru: Февраль
tr: Şubat

source: March
ar: يمشي
fa: راهپیمایی
ru: Маршировать
tr: Mart

source: April
ar: أبريل
fa: ماه آوریل
ru: Апрель
tr: Nisan

source: May
ar: يمكن
fa: ماه مه
ru: Может
tr: Mayıs

source: June
ar: يونيو
fa: ژوئن
ru: Июнь
tr: Haziran

source: July
ar: يوليو
fa: ژوئیه
ru: Июль
tr: Temmuz

source: August
ar: أغسطس
fa: اوت
ru: Август
tr: Ağustos

source: September
ar: سبتمبر
fa: سپتامبر
ru: Сентябрь
tr: Eylül

source: October
ar: أكتوبر
fa: اکتبر
ru: Октябрь
tr: Ekim

source: November
ar: نوفمبر
fa: ماه نوامبر
ru: Ноябрь
tr: Kasım

source: December
ar: ديسمبر
fa: دسامبر
ru: Декабрь
tr: Aralık

source: jan
ar: يناير
fa: ژان
ru: январь
tr: Ocak

source: feb
ar: فبراير
fa: فوریه
ru: февраль
tr: Şubat

source: mar
ar: مارس
fa: در میان
ru: марта
tr: martı

source: apr
ar: أبريل
fa: قدر
ru: апрель
tr: Nisan

source: may
ar: يمكن
fa: ماه مه
ru: может
tr: mayıs

source: jun
ar: يونيو
fa: جون جون
ru: июнь
tr: Haziran

source: jul
ar: يوليو
fa: جول
ru: июль
tr: Temmuz ayında

source: aug
ar: أغسطس
fa: اوت
ru: август
tr: Ağustos

source: sep
ar: سبتمبر
fa: سپ
ru: сентябрь

source: oct
ar: أكتوبر
fa: اکتبر
ru: октябрь
tr: Ekim

source: nov
ar: نوفمبر
fa: نوامبر
ru: ноябрь
tr: Kasım

source: dec
ar: ديسمبر
fa: دسامبر
ru: декабрь
tr: aralık

# abbrev. month
source: Jan.
ar: يناير.
fa: ژانویه
ru: Январь
tr: Ocak

# abbrev. month
source: Feb.
ar: فبراير
fa: فوریه
ru: Февраль
tr: Şubat.

# abbrev. month
source: March
ar: يمشي
fa: راهپیمایی
ru: Маршировать
tr: Mart

# abbrev. month
source: April
ar: أبريل
fa: ماه آوریل
ru: Апрель
tr: Nisan

# abbrev. month
source: May
ar: يمكن
fa: ماه مه
ru: Может
tr: Mayıs

# abbrev. month
source: June
ar: يونيو
fa: ژوئن
ru: Июнь
tr: Haziran

# abbrev. month
source: July
ar: يوليو
fa: ژوئیه
ru: Июль
tr: Temmuz

# abbrev. month
source: Aug.
ar: أغسطس
fa: اوت
ru: Август
tr: Ağustos

# abbrev. month
source: Sept.
ar: سبتمبر.
fa: سپتامبر
ru: Сентябрь
tr: Eylül.

# abbrev. month
source: Oct.
ar: أكتوبر.
fa: اکتبر
ru: Октябрь
tr: Ekim

# abbrev. month
source: Nov.
ar: نوفمبر.
fa: نوامبر
ru: Ноябрь
tr: Kasım

# abbrev. month
source: Dec.
ar: ديسمبر
fa: دسامبر
ru: Декабрь
tr: Aralık

# alt. month
source: January
ar: يناير
fa: ژانویه
ru: Январь
tr: Ocak

# alt. month
source: February
ar: فبراير
fa: فوریه
ru: Февраль
tr: Şubat

# alt. month
source: March
ar: يمشي
fa: راهپیمایی
ru: Маршировать
tr: Mart

# alt. month
source: April
ar: أبريل
fa: ماه آوریل
ru: Апрель
tr: Nisan

# alt. month
source: May
ar: يمكن
fa: ماه مه
ru: Может
tr: Mayıs

# alt. month
source: June
ar: يونيو
fa: ژوئن
ru: Июнь
tr: Haziran

# alt. month
source: July
ar: يوليو
fa: ژوئیه
ru: Июль
tr: Temmuz

# alt. month
source: August
ar: أغسطس
fa: اوت
ru: Август
tr: Ağustos

# alt. month
source: September
ar: سبتمبر
fa: سپتامبر
ru: Сентябрь
tr: Eylül

# alt. month
source: October
ar: أكتوبر
fa: اکتبر
ru: Октябрь
tr: Ekim

# alt. month
source: November
ar: نوفمبر
fa: ماه نوامبر
ru: Ноябрь
tr: Kasım

# alt. month
source: December
ar: ديسمبر
fa: دسامبر
ru: Декабрь
tr: Aralık

source: This is not a valid IPv6 address.
ar: هذا ليس عنوان IPv6 صالح.
fa: این یک آدرس IPv6 معتبر نیست.
ru: Это не действительный адрес IPv6.
tr: Bu geçerli bir IPv6 adresi değildir.

source: or
ar: أو
fa: یا
ru: или
tr: veya

source: Forbidden
ar: مُحرَّم
fa: ممنوع
ru: Запрещенный
tr: Yasaklı

source: CSRF verification failed. Request aborted.
ar: فشل التحقق من CSRF. طلب الإجهاض.
fa: تأیید CSRF انجام نشد. درخواست سقط جنین
ru: Проверка CSRF не удалась. Запрос прерван.
tr: CSRF doğrulaması başarısız oldu. İstek iptal edilmiştir.

source: You are seeing this message because this HTTPS site requires a “Referer header” to be sent by your web browser, but none was sent. This header is required for security reasons, to ensure that your browser is not being hijacked by third parties.
ar: أنت ترى هذه الرسالة لأن موقع HTTPS يتطلب إرسال "رأس المرجع" من قبل متصفح الويب الخاص بك ، ولكن لم يتم إرسال أي منها. هذا الرأس مطلوب لأسباب أمنية ، لضمان عدم اختطاف المستعرض الخاص بك من قبل أطراف ثالثة.
fa: شما این پیام را مشاهده می کنید زیرا این سایت HTTPS نیاز به "عنوان مراجعه کننده" دارد که توسط مرورگر وب شما ارسال شود ، اما هیچ یک ارسال نشده است. این هدر به دلایل امنیتی لازم است تا اطمینان حاصل شود که مرورگر شما توسط اشخاص ثالث ربوده نشده است.
ru: Вы видите это сообщение, потому что этот сайт HTTPS требует, чтобы ваш веб -браузер был отправлен «заголовком реферала», но ни один из них не был отправлен. Этот заголовок требуется по соображениям безопасности, чтобы гарантировать, что ваш браузер не был захвачен третьими лицами.
tr: Bu mesajı görüyorsunuz çünkü bu HTTPS sitesi web tarayıcınız tarafından gönderilmesini gerektiriyor, ancak hiçbiri gönderilmedi. Bu başlık, tarayıcınızın üçüncü taraflarca kaçırılmamasını sağlamak için güvenlik nedeniyle gereklidir.

source: If you have configured your browser to disable “Referer” headers, please re-enable them, at least for this site, or for HTTPS connections, or for “same-origin” requests.
ar: إذا قمت بتكوين المتصفح الخاص بك لتعطيل رؤوس "المرجع" ، فيرجى إعادة تمكينها ، على الأقل لهذا الموقع ، أو لاتصالات HTTPS ، أو لطلبات "الأصل من نفس".
fa: اگر مرورگر خود را برای غیرفعال کردن هدرهای "مراجعه کننده" پیکربندی کرده اید ، لطفاً آنها را حداقل برای این سایت یا برای اتصالات HTTPS یا درخواست های "همان منبعی" مجدداً فعال کنید.
ru: Если вы настроили свой браузер, чтобы отключить заголовки «рефералов», пожалуйста, повторно их включите, по крайней мере для этого сайта, или для подключений HTTPS, или для запросов «одно и той жежигин».
tr: Tarayıcınızı “Referans” başlıklarını devre dışı bırakacak şekilde yapılandırdıysanız, lütfen bunları en azından bu site veya HTTPS bağlantıları veya “aynı orijin” istekleri için yeniden etkinleştirin.

source: If you are using the <meta name="referrer" content="no-referrer"> tag or including the “Referrer-Policy: no-referrer” header, please remove them. The CSRF protection requires the “Referer” header to do strict referer checking. If you’re concerned about privacy, use alternatives like <a rel="noreferrer" …> for links to third-party sites.
ar: إذا كنت تستخدم علامة <meta name = "alnovener" content = "no-referrer"> أو بما في ذلك رأس "المرجعية السياسية: no-referrer" ، يرجى إزالتها. تتطلب حماية CSRF رأس "المرجع" للقيام بفحص صارم للمشترك. إذا كنت قلقًا بشأن الخصوصية ، فاستخدم بدائل مثل <a rel = "noreferrer" ...> للحصول على روابط لمواقع الطرف الثالث.
fa: اگر از برچسب <meta name = "referrer" content = "no-Reerrer"> استفاده می کنید یا از جمله هدر "ارجاع دهنده: بدون مراجعه کننده" ، لطفاً آنها را حذف کنید. حفاظت CSRF به عنوان "مراجعه کننده" نیاز دارد تا بررسی دقیق مراجعه کننده را انجام دهد. اگر نگران حریم خصوصی هستید ، از گزینه های دیگری مانند <rel = "noreferrer" ...> برای پیوندها به سایت های شخص ثالث استفاده کنید.
ru: Если вы используете тег <meta name = "Referrer" Content = "no-referrer"> или включающий заголовок «Рефера-политика: no-referrer», пожалуйста, удалите их. Защита CSRF требует, чтобы заголовок «Рефера» выполнял строгую проверку рефералов. Если вы обеспокоены конфиденциальностью, используйте альтернативы, такие как <a rel = "noreferrer"…> для ссылок на сторонние сайты.
tr: <Meta name = "yönlendirici" content = "no-referrer"> etiketi kullanıyorsanız veya "yönlendirici politika: no-referrer" başlığı kullanıyorsanız, lütfen bunları kaldırın. CSRF koruması, “başvuru” üstbilgisinin katı referans kontrolü yapmasını gerektirir. Gizlilikten endişe ediyorsanız, üçüncü taraf sitelere bağlantılar için <a rel = "noreferrer"…> gibi alternatifleri kullanın.

source: You are seeing this message because this site requires a CSRF cookie when submitting forms. This cookie is required for security reasons, to ensure that your browser is not being hijacked by third parties.
ar: أنت ترى هذه الرسالة لأن هذا الموقع يتطلب ملف تعريف ارتباط CSRF عند إرسال النماذج. مطلوب ملف تعريف الارتباط هذا لأسباب أمنية ، لضمان عدم اختطاف المستعرض الخاص بك من قبل أطراف ثالثة.
fa: شما این پیام را مشاهده می کنید زیرا این سایت هنگام ارسال فرم به یک کوکی CSRF نیاز دارد. این کوکی به دلایل امنیتی لازم است تا اطمینان حاصل شود که مرورگر شما توسط اشخاص ثالث ربوده نشده است.
ru: Вы видите это сообщение, потому что этот сайт требует CSRF Cookie при отправке форм. Этот файл cookie требуется по соображениям безопасности, чтобы гарантировать, что ваш браузер не был захвачен третьими лицами.
tr: Bu mesajı görüyorsunuz çünkü bu site formları gönderirken bir CSRF çerezi gerektirir. Bu çerez, tarayıcınızın üçüncü taraflarca kaçırılmamasını sağlamak için güvenlik nedeniyle gereklidir.

source: If you have configured your browser to disable cookies, please re-enable them, at least for this site, or for “same-origin” requests.
ar: إذا قمت بتكوين متصفحك لتعطيل ملفات تعريف الارتباط ، فيرجى إعادة تمكينها ، على الأقل لهذا الموقع ، أو لطلبات "الأصل من نفس".
fa: اگر مرورگر خود را برای غیرفعال کردن کوکی ها پیکربندی کرده اید ، لطفاً آنها را حداقل برای این سایت یا درخواست های "همان منبعی" مجدداً فعال کنید.
ru: Если вы настроили свой браузер, чтобы отключить файлы cookie, пожалуйста, повторно их включите, по крайней мере для этого сайта или для запросов «одно и тойкигин».
tr: Tarayıcınızı çerezleri devre dışı bırakacak şekilde yapılandırdıysanız, lütfen bunları en azından bu site veya “aynı orijin” istekleri için yeniden etkinleştirin.

source: More information is available with DEBUG=True.
ar: مزيد من المعلومات متاح مع Debug = True.
fa: اطلاعات بیشتر با debug = true در دسترس است.
ru: Более подробная информация доступна с DEBUG = TRUE.
tr: Debug = true ile daha fazla bilgi mevcuttur.

source: No year specified
ar: لم يحدد سنة
fa: بدون سالی مشخص نشده است
ru: Ни один год не указан
tr: Yıl belirtilmedi

source: Date out of range
ar: تاريخ خارج النطاق
fa: تاریخ خارج از محدوده
ru: Дата вне диапазона
tr: Menzil dışında tarih

source: No month specified
ar: لم يحدد شهر
fa: هیچ ماه مشخص نشده است
ru: Ни один месяц не указан
tr: Ay belirtilmedi

source: No day specified
ar: لم يحدد يوم
fa: هیچ روزی مشخص نشده است
ru: Не указан день
tr: Gün belirtilmedi

source: No week specified
ar: لم يحدد أسبوع
fa: هیچ هفته مشخص نشده است
ru: Неделя не указана
tr: Hafta belirtilmedi

source: Page is not “last”, nor can it be converted to an int.
ar: الصفحة ليست "الأخيرة" ، ولا يمكن تحويلها إلى int.
fa: صفحه "آخرین" نیست ، و همچنین نمی توان آن را به INT تبدیل کرد.
ru: Страница не является «последней», и не может быть преобразована в Int.
tr: Sayfa “son” değildir, ne de bir int.

source: Directory indexes are not allowed here.
ar: فهارس الدليل غير مسموح هنا.
fa: شاخص های دایرکتوری در اینجا مجاز نیست.
ru: Индексы каталогов здесь не допускаются.
tr: Burada dizin dizinlerine izin verilmez.

source: The install worked successfully! Congratulations!
ar: يعمل التثبيت بنجاح! مبروك!
fa: نصب با موفقیت کار کرد! تبریک می گویم!
ru: Установка работала успешно! Поздравляю!
tr: Kurulum başarıyla çalıştı! Tebrikler!

source: View <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">release notes</a> for Django %(version)s
ru: Просмотр <a href = "https://docs.djangoproject.com/en/%(version)s/releases/" target = "_ blank" rel = "noopener"> Примечания к выпуску </a> для django %(версия) s

source: You are seeing this page because <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> is in your settings file and you have not configured any URLs.
ru: Вы видите эту страницу, потому что <a href = "https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target = "_ blank" rel = "noopener"> Debug = true </a> находится в вашем файле настроек, и вы не конфигурировали urls.

source: Django Documentation
ar: وثائق Django
fa: مستندات جنگ
ru: Джанго документация
tr: Django belgeleri

source: Topics, references, &amp; how-to’s
ar: الموضوعات ، المراجع ، & amp ؛ كيف
fa: مباحث ، منابع ، & amp ؛ چگونه
ru: Темы, ссылки и amp; как это делать
tr: Konular, referanslar & amp; nasıl yapılır

source: Tutorial: A Polling App
ar: البرنامج التعليمي: تطبيق اقتراع
fa: آموزش: یک برنامه رای گیری
ru: Учебное пособие: приложение для опроса
tr: Öğretici: Bir Anket Uygulaması

source: Get started with Django
ar: ابدأ مع Django
fa: با Django شروع کنید
ru: Начните с Джанго
tr: Django ile başlayın

source: Django Community
ar: مجتمع Django
fa: جامعه جنگو
ru: Джанго сообщество
tr: Django Topluluğu

source: Connect, get help, or contribute
ar: قم بتوصيل أو الحصول على المساعدة أو المساهمة
fa: اتصال ، کمک یا مشارکت
ru: Подключиться, получить помощь или внести свой вклад
tr: Bağlayın, yardım alın veya katkıda bulun

source: Error: Cannot handle glob %s
ru: Ошибка: не может обрабатывать Glob %s
tr: Hata: Glob %s'yi işleyemiyor

source: Cannot read %s
ru: Не может читать %s

source: Unimplemented function: %s
ru: Неограниченная функция: %s
tr: Uygulanmamış işlev: %s

source: new name needed for rename of %s
ru: Новое имя, необходимое для переименования %s
tr: %s yeniden adlandırması için yeni isim gerekli

source: Unhandled filechange type: %s
ru: Неупостол тип FileChange: %s

source: Couldn't parse rename source
ar: لا يمكن تحليل مصدر إعادة تسمية
fa: نمی تواند منبع تغییر نام دهد
ru: Не мог проанализировать переименовать источник
tr: Kaynağı yeniden adlandıramadım

source: Unsupported command: '%s'
ru: Неподдерживаемая команда: '%s'
tr: Desteklenmemiş komut: '%s'

source: Could not parse line: '%s'
ru: Не мог проанализировать линию: '%s'
tr: Satırı ayrıştıramadı: '%s'

source: NEXT STEPS FOR YOUR SENSITIVE DATA REMOVAL: * If you are doing your rewrite in multiple steps, ignore these next steps until you have completed all your invocations of git-filter-repo. * See the "Sensitive Data Removal" subsection of the "DISCUSSION" section of the manual for more details about any of the steps below. * Inspect this repository and verify that the sensitive data is indeed completely removed from all commits. * Force push the rewritten history to the server: %s * Contact the server admins for additional steps they need to take; the First Changed Commit(s)%s may come in handy here. * Have other colleagues with a clone either discard their clone and reclone OR follow the detailed steps in the manual to repeatedly rebase and purge the sensitive data from their copy. Again, the First Changed Commit(s)%s may come in handy. * See the "Prevent repeats and avoid future sensitive data spills" section of the manual.
ru: Следующие шаги для вашего конфиденциального удаления данных: * Если вы делаете переписывание в нескольких шагах, игнорируйте эти следующие шаги Пока вы не закончите все свои вызова Git-Filter-Repo. * См. Подраздел «Удаление конфиденциальных данных» в разделе «Обсуждение» Руководства для более подробной информации о любом из приведенных ниже шагов. * Проверьте этот репозиторий и убедитесь, что конфиденциальные данные действительно Полностью удален из всех коммитов. * PIRCE PUST Переписанную историю на сервер: %с * Свяжитесь с серверными администраторами для дополнительных шагов, которые они должны предпринять; а Впервые изменили коммит (ы)%s могут пригодиться здесь. * Иметь другие коллеги с клоном либо отбрасывают клон и отклика Или выполните подробные шаги в руководстве, чтобы неоднократно переоткрыться и очистить конфиденциальные данные из их копии. Опять же, первый изменился Коммит (ы)%S может пригодиться. * См. Раздел «Предотвратить повторения и избежать будущих разливаний конфиденциальных данных» из руководства.

source: %s does not appear to be a valid git repository
ru: %s, по -видимому, не является действительным репозиторием GIT
tr: %s geçerli bir git deposu gibi görünmüyor
