Repository: zahraadelbani/club-management-backup
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar, fa, ru, tr

source: Date and Time
ar: التاريخ والوقت
fa: تاریخ و زمان
ru: Дата и время
tr: Tarih ve saat

source: Meeting with {self.club.name} on {self.date_time}
ar: اجتماع مع {self.club.name} على {self.date_time}
fa: ملاقات با {self.club.name} در {self.date_time}
ru: Встреча с {self.club.name} на {self.date_time}

source: File
ar: ملف
fa: پرونده
ru: Файл
tr: Dosya

source: Uploaded At
ar: تم الرفع في
fa: بارگذاری شده در
ru: Загружено в
tr: Yüklendi

source: Created At:
ar: تم إنشاؤها في:
fa: ایجاد شده در:
ru: Создано по адресу:
tr: Oluşturuldu:

source: Complaint
ar: شكوى
fa: شکایت
ru: Жалоба
tr: Şikayet

source: Suggestion
ar: اقتراح
fa: پیشنهاد
ru: Предположение
tr: Telkin

source: Reviewed
ar: استعرض
fa: مرور شده
ru: Рецензируется
tr: İncelenmiş

source: Category
ar: فئة
fa: دسته
ru: Категория
tr: Kategori

source: Anonymous
ar: مجهول
fa: ناشناس
ru: Анонимный
tr: Anonim

source: Category:
ar: فئة:
fa: دسته:
ru: Категория:
tr: Kategori:

source: Content:
ar: محتوى:
fa: محتوا:
ru: Содержание:
tr: İçerik:

source: Submitted by:
ar: قدمها:
fa: ارسال شده توسط:
ru: Отправлено:
tr: Gönderildi:

source: Status:
ar: حالة:
fa: وضعیت:
ru: Статус:
tr: Durum:

source: Select Club
ar: حدد النادي
fa: باشگاه را انتخاب کنید
ru: Выберите клуб
tr: Kulüp seçin

source: Choose
ar: يختار
fa: انتخاب کردن
ru: Выбирать
tr: Seçmek

source: Complaint (Anonymous)
ar: شكوى (مجهول)
fa: شکایت (ناشناس)
ru: Жалоба (анонимная)
tr: Şikayet (Anonim)

source: Suggestion (Name will be shown)
ar: اقتراح (سيتم عرض الاسم)
fa: پیشنهاد (نام نشان داده خواهد شد)
ru: Предложение (имя будет показано)
tr: Öneri (isim gösterilecek)

source: Your Message
ar: رسالتك
fa: پیام شما
ru: Ваше сообщение
tr: Mesajınız

source: You are not currently a member of any club to submit feedback.
ar: أنت لست حاليًا عضوًا في أي نادي لتقديم ملاحظات.
fa: شما در حال حاضر عضو هیچ باشگاهی برای ارائه بازخورد نیستید.
ru: В настоящее время вы не являетесь членом Colub, чтобы представить отзывы.
tr: Şu anda geri bildirim göndermek için herhangi bir kulübün üyesi değilsiniz.

source: Room Name
ar: اسم الغرفة
fa: نام اتاق
ru: Название комнаты
tr: Oda adı

source: Slug
ar: سبيكة
fa: لگد زدن
ru: Пульт
tr: Sülük

source: Room
ar: غرفة
fa: اتاق
ru: Комната
tr: Oda

source: Sender
ar: مرسل
fa: فرستنده
ru: Отправитель
tr: Gönderen kimse

source: Message Content
ar: محتوى الرسالة
fa: محتوای پیام
ru: Содержание сообщения
tr: Mesaj İçeriği

source: Timestamp
ar: الطابع الزمني
fa: زمان سنج
ru: Временная метка
tr: Zaman damgası

source: User 1
ar: المستخدم 1
fa: کاربر 1
ru: Пользователь 1
tr: Kullanıcı 1

source: User 2
ar: المستخدم 2
fa: کاربر 2
ru: Пользователь 2
tr: Kullanıcı 2

source: Direct Chat Room
ar: غرفة الدردشة المباشرة
fa: اتاق گفتگوی مستقیم
ru: Прямой чат
tr: Doğrudan sohbet odası

source: Direct Chat Rooms
ar: غرف الدردشة المباشرة
fa: اتاق های گفتگوی مستقیم
ru: Прямые чаты
tr: Doğrudan sohbet odaları

source: Receiver
ar: المتلقي
fa: گیرنده
ru: Приемник
tr: Alıcı

source: Direct Message
ar: رسالة مباشرة
fa: پیام مستقیم
ru: Прямое сообщение
tr: Doğrudan mesaj

source: Direct Messages
ar: الرسائل المباشرة
fa: پیام های مستقیم
ru: Прямые сообщения
tr: Doğrudan Mesajlar

source: Chat with
ar: الدردشة مع
fa: گپ زدن با
ru: Пообщаться с
tr: İle sohbet etmek

source: No messages yet. Start the conversation!
ar: لا توجد رسائل بعد. ابدأ المحادثة!
fa: هنوز پیام ندارد مکالمه را شروع کنید!
ru: Пока нет сообщений. Начните разговор!
tr: Henüz mesaj yok. Konuşmaya başlayın!

source: Type a message...
ar: اكتب رسالة ...
fa: یک پیام را تایپ کنید ...
ru: Введите сообщение ...
tr: Bir mesaj yazın ...

source: Send
ar: يرسل
fa: ارسال کردن
ru: Отправлять
tr: Göndermek

source: Group Chat -
ar: دردشة جماعية -
fa: گپ گروهی -
ru: Групповой чат -
tr: Grup Sohbeti -

source: Active Polls
ar: استطلاعات نشطة
fa: نظرسنجی های فعال
ru: Активные опросы
tr: Aktif Anketler

source: Total Votes:
ar: إجمالي الأصوات:
fa: کل آرا:
ru: Общее количество голосов:
tr: Toplam oylar:

source: You have already voted.
ar: لقد صوتت بالفعل.
fa: شما قبلاً رأی داده اید.
ru: Вы уже проголосовали.
tr: Zaten oy verdin.

source: Click a choice to vote
ar: انقر على اختيار للتصويت
fa: برای رای دادن روی یک انتخاب کلیک کنید
ru: Нажмите на выбор, чтобы проголосовать
tr: Oy vermek için bir seçimi tıklayın

source: No active polls for this club.
ar: لا استطلاعات نشطة لهذا النادي.
fa: هیچ نظرسنجی فعال برای این باشگاه وجود ندارد.
ru: Нет активных опросов для этого клуба.
tr: Bu kulüp için aktif anket yok.

source: Create a New Poll
ar: إنشاء استطلاع جديد
fa: نظرسنجی جدید ایجاد کنید
ru: Создать новый опрос
tr: Yeni Bir Anket Oluşturun

source: Poll question
ar: سؤال الاستطلاع
fa: سوال نظرسنجی
ru: Вопрос опроса
tr: Anket sorusu

source: Choice 1
ar: الاختيار 1
fa: انتخاب 1
ru: Выбор 1
tr: Seçim 1

source: Choice 2
ar: الاختيار 2
fa: انتخاب 2
ru: Выбор 2
tr: Seçim 2

source: Create Poll
ar: إنشاء استطلاع
fa: ایجاد نظرسنجی
ru: Создать опрос
tr: Anket yaratmak

source: Club Chat Rooms
ar: غرف الدردشة النادي
fa: اتاق های گفتگوی باشگاه
ru: Клубные чаты
tr: Kulüp sohbet odaları

source: No club chat rooms available.
ar: لا توجد غرف دردشة النادي متوفرة.
fa: هیچ اتاق گفتگوی باشگاه در دسترس نیست.
ru: Нет клубных чатов.
tr: Kulüp sohbet odası yok.

source: No members available for direct messages.
ar: لا يوجد أعضاء متاحون للرسائل المباشرة.
fa: هیچ عضو برای پیام های مستقیم در دسترس نیست.
ru: Нет участников для прямых сообщений.
tr: Doğrudan mesajlar için hiçbir üye mevcut değildir.

source: Choice Text
ar: نص الاختيار
fa: متن انتخاب
ru: Выбор текст
tr: Seçim metni

source: Poll Question
ar: سؤال الاستطلاع
fa: سوال نظرسنجی
ru: Вопрос опроса
tr: Anket sorusu

source: Poll
ar: استطلاع
fa: رأی گیری
ru: Голосование
tr: Anket

source: Polls
ar: استطلاعات الرأي
fa: رأی گیری
ru: Опросы
tr: Anketler

source: Vote Count
ar: عدد التصويت
fa: شمارش آراء
ru: Голосование
tr: Oy sayımı

source: Choice
ar: خيار
fa: انتخاب
ru: Выбор
tr: Seçenek

source: Choices
ar: الخيارات
fa: انتخاب
ru: Выбор
tr: Seçimler

source: Voted At
ar: صوت في
fa: رأی داد
ru: Проголосовал в
tr: Oy kullandı

source: Poll Vote
ar: استطلاع التصويت
fa: رای گیری
ru: Голосование в опросе
tr: Anket oyu

source: Poll Votes
ar: تصويت الاقتراع
fa: آراء نظرسنجی
ru: Голоса опроса
tr: Anket oyları

source: Create a Poll
ar: إنشاء استطلاع
fa: نظرسنجی ایجاد کنید
ru: Создать опрос
tr: Anket oluştur

source: You must be a club leader to create polls.
ar: يجب أن تكون قائدًا للنادي لإنشاء استطلاعات الرأي.
fa: برای ایجاد نظرسنجی باید یک رهبر باشگاه باشید.
ru: Вы должны быть лидером клуба для создания опросов.
tr: Anket oluşturmak için bir kulüp lideri olmalısınız.

source: Back to Polls
ar: العودة إلى صناديق الاقتراع
fa: بازگشت به نظرسنجی ها
ru: Вернуться к опросам
tr: Anketlere geri dön

source: No polls available.
ar: لا استطلاعات الرأي المتاحة.
fa: هیچ نظرسنجی در دسترس نیست.
ru: Нет опросов.
tr: Anket yok.

source: Results for:
ar: نتائج:
fa: نتایج برای:
ru: Результаты для:
tr: Sonuçlar:

source: vote
ar: تصويت
fa: رأی دادن
ru: голосование
tr: oy

source: No choices found for this poll.
ar: لم يتم العثور على خيارات لهذا الاستطلاع.
fa: هیچ انتخابی برای این نظرسنجی پیدا نشده است.
ru: Для этого опроса не было выбора.
tr: Bu anket için seçim bulunamadı.

source: Select Number of Choices
ar: حدد عدد الخيارات
fa: تعداد گزینه ها را انتخاب کنید
ru: Выберите количество вариантов
tr: Seçim sayısını seçin

source: Created by
ar: تم إنشاؤها بواسطة
fa: ایجاد شده توسط
ru: Создан
tr: Tarafından yaratılan

source: No active polls.
ar: لا استطلاعات نشطة.
fa: هیچ نظرسنجی فعال وجود ندارد.
ru: Нет активных опросов.
tr: Aktif anket yok.

source: Update Poll:
ar: استطلاع تحديث:
fa: نظرسنجی به روزرسانی:
ru: Обновление опроса:
tr: Güncelleme Anketi:

source: Edit Existing Choices
ar: تحرير الخيارات الحالية
fa: گزینه های موجود را ویرایش کنید
ru: Редактировать существующие варианты
tr: Mevcut Seçimleri Düzenle

source: Add a New Choice (Optional)
ar: أضف خيارًا جديدًا (اختياري)
fa: اضافه کردن یک انتخاب جدید (اختیاری)
ru: Добавьте новый выбор (необязательно)
tr: Yeni bir seçim ekleyin (isteğe bağlı)

source: Leave blank if you don't want to add a new choice.
ar: اترك فارغًا إذا كنت لا ترغب في إضافة خيار جديد.
fa: اگر نمی خواهید انتخاب جدیدی اضافه کنید ، خالی بگذارید.
ru: Оставьте пустым, если вы не хотите добавлять новый выбор.
tr: Yeni bir seçim eklemek istemiyorsanız boş bırakın.

source: Created on:
ar: تم إنشاؤها في:
fa: ایجاد شده در:
ru: Создано на:
tr: Oluşturulan:

source: Choices:
ar: الخيارات:
fa: گزینه ها:
ru: Выбор:
tr: Seçimler:

source: votes
ar: أصوات
fa: رأی
ru: голоса
tr: oy

source: Vote on this Poll
ar: التصويت على هذا الاستطلاع
fa: به این نظرسنجی رای دهید
ru: Проголосовать за этот опрос
tr: Bu ankete oy verin

source: Go back to Dashboard
ar: عد إلى لوحة القيادة
fa: به داشبورد برگردید
ru: Вернуться к панели панели
tr: Gösterge paneline geri dön

source: Vote
ar: تصويت
fa: رأی دادن
ru: Голосование
tr: Oy

source: Scheduled For
ar: من المقرر
fa: برنامه ریزی شده برای
ru: Запланировано на
tr: İçin planlanmış

source: Event Reminder
ar: تذكير الحدث
fa: یادآوری رویداد
ru: Напоминание о событии
tr: Etkinlik Hatırlatma

source: Event Reminders
ar: تذكيرات الحدث
fa: یادآوری رویداد
ru: Напоминания о событии
tr: Etkinlik Hatırlatıcıları

source: Sign In
ar: تسجيل الدخول
fa: ورود به سیستم
ru: Войти
tr: Oturum açmak

source: Sign in with Google
ar: تسجيل الدخول مع Google
fa: با Google وارد شوید
ru: Войдите с Google
tr: Google ile oturum açın

source: Sign Out
ar: تسجيل الخروج
fa: از سیستم خارج شدن
ru: Выход
tr: Oturumu Kapat

source: Are you sure you want to sign out?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟
fa: آیا مطمئن هستید که می خواهید از سیستم خارج شوید؟
ru: Вы уверены, что хотите выйти из строя?
tr: Oturum açmak istediğinden emin misin?

source: Password Reset
ar: إعادة تعيين كلمة المرور
fa: تنظیم مجدد رمز عبور
ru: Сброс пароля
tr: Parola Sıfırlama

source: Forgotten your password? Enter your email address below, and we'll send you an email allowing you to reset it.
ar: نسيت كلمة المرور الخاصة بك؟ أدخل عنوان بريدك الإلكتروني أدناه ، وسنرسل لك بريدًا إلكترونيًا يسمح لك بإعادة ضبطه.
fa: رمز ورود خود را فراموش کرده اید؟ آدرس ایمیل خود را در زیر وارد کنید ، و ما برای شما ایمیل ارسال می کنیم که به شما امکان می دهد دوباره تنظیم کنید.
ru: Забыли свой пароль? Введите свой адрес электронной почты ниже, и мы отправим вам электронное письмо, позволяющее сбросить его.
tr: Şifrenizi mi unuttunuz? E -posta adresinizi aşağıya girin, size sıfırlamanıza izin veren bir e -posta göndereceğiz.

source: Reset My Password
ar: أعد تعيين كلمة المرور الخاصة بي
fa: رمزعبور خود را دوباره تنظیم کنید
ru: Сбросить мой пароль
tr: Şifremi sıfırla

source: Please contact us if you have any trouble resetting your password.
ar: يرجى الاتصال بنا إذا كان لديك أي مشكلة في إعادة تعيين كلمة المرور الخاصة بك.
fa: اگر در تنظیم مجدد رمز عبور خود مشکلی دارید ، لطفاً با ما تماس بگیرید.
ru: Пожалуйста, свяжитесь с нами, если у вас есть проблемы с сбросом пароля.
tr: Parolanızı sıfırlamakta sorun yaşıyorsanız lütfen bizimle iletişime geçin.

source: We have sent you an email. If you have not received it please check your spam folder. Otherwise contact us if you do not receive it in a few minutes.
ar: لقد أرسلنا لك بريدًا إلكترونيًا. إذا لم تكن قد استلمتها ، فيرجى التحقق من مجلد البريد العشوائي. وإلا اتصل بنا إذا لم تستلمه في غضون دقائق قليلة.
fa: ما برای شما ایمیل ارسال کرده ایم. اگر آن را دریافت نکرده اید ، پوشه هرزنامه خود را بررسی کنید. در غیر این صورت اگر چند دقیقه آن را دریافت نکردید با ما تماس بگیرید.
ru: Мы отправили вам электронное письмо. Если вы не получили его, проверьте папку спама. В противном случае свяжитесь с нами, если вы не получите его через несколько минут.
tr: Size bir e -posta gönderdik. Almadıysanız lütfen spam klasörünüzü kontrol edin. Aksi takdirde birkaç dakika içinde almazsanız bizimle iletişime geçin.

source: Change Password
ar: تغيير كلمة المرور
fa: رمز عبور را تغییر دهید
ru: Изменить пароль
tr: Şifre değiştir

source: Your password is now changed.
ar: تم تغيير كلمة المرور الخاصة بك الآن.
fa: رمز ورود شما اکنون تغییر کرده است.
ru: Ваш пароль теперь изменен.
tr: Şifreniz artık değiştirildi.

source: Signup
ar: اشتراك
fa: ثبت نام
ru: Зарегистрироваться
tr: Üye olmak

source: Sign Up
ar: اشتراك
fa: ثبت نام کردن
ru: Зарегистрироваться
tr: Üye olmak

source: Already have an account? Then please
ar: هل لديك بالفعل حساب؟ ثم من فضلك
fa: در حال حاضر یک حساب کاربری دارید؟ پس لطفا
ru: Уже есть аккаунт? Тогда пожалуйста
tr: Zaten bir hesabınız var mı? O zaman lütfen

source: sign in
ar: تسجيل الدخول
fa: ورود به سیستم
ru: войти
tr: oturum açmak

source: now.
ar: الآن.
fa: اکنون
ru: сейчас.
tr: Şimdi.

source: Full Name
ar: الاسم الكامل
fa: نام کامل
ru: Полное имя
tr: Ad Soyad

source: Enter your full name
ar: أدخل اسمك الكامل
fa: نام کامل خود را وارد کنید
ru: Введите свое полное имя
tr: Tam Adınızı Girin

source: Enter your email
ar: أدخل بريدك الإلكتروني
fa: ایمیل خود را وارد کنید
ru: Введите свою электронную почту
tr: E -postanızı girin

source: Password
ar: كلمة المرور
fa: رمز
ru: Пароль
tr: Şifre

source: Create a password
ar: قم بإنشاء كلمة مرور
fa: یک رمز عبور ایجاد کنید
ru: Создать пароль
tr: Bir şifre oluşturun

source: Confirm Password
ar: تأكيد كلمة المرور
fa: تأیید رمز عبور
ru: Подтвердите пароль
tr: Şifreyi onaylayın

source: Confirm your password
ar: قم بتأكيد كلمة المرور الخاصة بك
fa: رمز ورود خود را تأیید کنید
ru: Подтвердите свой пароль
tr: Şifrenizi onaylayın

source: Sign up with Google
ar: اشترك مع Google
fa: با Google ثبت نام کنید
ru: Зарегистрируйтесь в Google
tr: Google'a kaydolun

source: Continue
ar: يكمل
fa: ادامه دادن
ru: Продолжать
tr: Devam etmek

source: Student ID
ar: معرف الطالب
fa: شناسه دانشجویی
ru: Студент идентификатор
tr: Öğrenci kimliği

source: Profile Picture
ar: صورة الملف الشخصي
fa: عکس مشخصه
ru: Профиль изображение
tr: Profil resmi

source: The Email field must be set
ar: يجب تعيين حقل البريد الإلكتروني
fa: قسمت ایمیل باید تنظیم شود
ru: Поле электронной почты должно быть установлено
tr: E -posta alanı ayarlanmalıdır

source: Club Member
ar: عضو النادي
fa: عضو باشگاه
ru: Член клуба
tr: Kulüp üyesi

source: Activity Center Admin
ar: مدير مركز النشاط
fa: مدیر مرکز فعالیت
ru: Центр деятельности администратор
tr: Etkinlik Merkezi Yöneticisi

source: Has Voted
ar: لقد صوت
fa: رای داده است
ru: Проголосовал
tr: Oy verdi

source: Role
ar: دور
fa: نقش
ru: Роль
tr: Rol

source: Is Admin
ar: هو المسؤول
fa: مدیر است
ru: Админ
tr: Yönetici

source: Is Staff
ar: هو الموظفين
fa: کارمندان هستند
ru: Это персонал
tr: Personel mi

source: Is Superuser
ar: هو superuser
fa: فوق العاده است
ru: Суперпользователь
tr: Süper kullanıcı

source: Membership Type
ar: نوع العضوية
fa: نوع عضویت
ru: Тип членства
tr: Üyelik türü

source: Memberships
ar: عضوية
fa: عضویت
ru: Членство
tr: Üyelikler

source: A user cannot have more than 3 total memberships (including pending ones).
ar: لا يمكن للمستخدم الحصول على أكثر من 3 عضوية إجمالية (بما في ذلك تلك المعلقة).
fa: کاربر نمی تواند بیش از 3 عضو کل (از جمله موارد در حال تعلیق) داشته باشد.
ru: У пользователя не может быть более 3 общих членов (в том числе ожидающих).
tr: Bir kullanıcının toplam 3'ten fazla üyelik (beklemede olanlar dahil) olamaz.

source: A user cannot be a leader of more than one club.
ar: لا يمكن للمستخدم أن يكون قائدًا لأكثر من نادٍ واحد.
fa: کاربر نمی تواند رهبر بیش از یک باشگاه باشد.
ru: Пользователь не может быть лидером более чем одного клуба.
tr: Bir kullanıcı birden fazla kulübün lideri olamaz.

source: Create User
ar: إنشاء المستخدم
fa: کاربر ایجاد کنید
ru: Создать пользователя
tr: Kullanıcı Oluştur

source: Name:
ar: اسم:
fa: نام:
ru: Имя:
tr: İsim:

source: Student ID:
ar: معرف الطالب:
fa: شناسه دانشجویی:
ru: Студент идентификатор:
tr: Öğrenci Kimliği:

source: Email:
ar: بريد إلكتروني:
fa: ایمیل:
ru: Электронная почта:
tr: E -posta:

source: Password:
ar: كلمة المرور:
fa: رمز عبور:
ru: Пароль:
tr: Şifre:

source: Role:
ar: دور:
fa: نقش:
ru: Роль:
tr: Rol:

source: Assign to Club (optional):
ar: تعيين للنادي (اختياري):
fa: اختصاص به باشگاه (اختیاری):
ru: Назначить клубу (необязательно):
tr: Kulübe atayın (isteğe bağlı):

source: -- Select a Club --
ar: -حدد نادي-
fa: -یک باشگاه را انتخاب کنید-
ru: -Выберите клуб-
tr: -Bir kulüp seçin-

source: Membership Type:
ar: نوع العضوية:
fa: نوع عضویت:
ru: Тип членства:
tr: Üyelik Türü:

source: Create
ar: يخلق
fa: ایجاد کردن
ru: Создавать
tr: Yaratmak

source: User List
ar: قائمة المستخدم
fa: لیست کاربری
ru: Список пользователей
tr: Kullanıcı listesi

source: Create New User
ar: إنشاء مستخدم جديد
fa: کاربر جدید ایجاد کنید
ru: Создайте нового пользователя
tr: Yeni Kullanıcı Oluştur

source: Logout
ar: تسجيل الخروج
fa: ورود به سیستم
ru: Выход
tr: Oturum açma

source: All
ar: الجميع
fa: همه
ru: Все
tr: Tüm

source: Reset Filters
ar: إعادة تعيين مرشحات
fa: تنظیم مجدد فیلترها
ru: Сбросить фильтры
tr: Filtreleri sıfırla

source: ID
ar: بطاقة تعريف
fa: شناسه
ru: ИДЕНТИФИКАТОР

source: Update Profile Picture
ar: تحديث صورة الملف الشخصي
fa: عکس پروفایل را به روز کنید
ru: Обновить изображение профиля
tr: Profil resmini güncelle

source: Profile Information
ar: معلومات الملف الشخصي
fa: اطلاعات پروفایل
ru: Информация о профиле
tr: Profil Bilgileri

source: Not Assigned
ar: لم يتم تعيينه
fa: اختصاص داده نشده است
ru: Не назначен
tr: Atanmadı

source: Leader of
ar: زعيم
fa: رهبر
ru: Лидер
tr: Lideri

source: Member of
ar: عضو
fa: عضو
ru: Член
tr: Üye

source: You are not a member of any club yet.
ar: أنت لست عضوًا في أي نادي حتى الآن.
fa: شما هنوز عضو هیچ باشگاهی نیستید.
ru: Вы еще не являетесь членом в каком -либо клубе.
tr: Henüz herhangi bir kulübün üyesi değilsiniz.

source: Update Profile
ar: تحديث الملف الشخصي
fa: نمایه به روزرسانی
ru: Обновить профиль
tr: Profili Güncelle

source: Waiting for club approval...
ar: في انتظار موافقة النادي ...
fa: منتظر تأیید باشگاه ...
ru: В ожидании одобрения клуба ...
tr: Kulüp onayını bekliyorum ...

source: Explore & Join Clubs
ar: استكشاف وينضم إلى الأندية
fa: کلوپ ها را کاوش و بپیوندید
ru: Исследуйте и присоединяйтесь к клубам
tr: Kulüpleri keşfedin ve katılın

source: Pending Application
ar: تطبيق معلق
fa: برنامه در انتظار
ru: Ожидающее применение
tr: Bekleyen Uygulama

source: Apply
ar: يتقدم
fa: درخواست کردن
ru: Применять
tr: Uygula

source: No available clubs to apply for at this time.
ar: لا نوادي متوفرة للتقدم إليها في هذا الوقت.
fa: در این زمان هیچ باشگاه در دسترس نیست.
ru: В настоящее время нет доступных клубов.
tr: Şu anda başvuracak kullanılabilir kulüp yok.

source: Applications Awaiting Approval
ar: الطلبات في انتظار الموافقة
fa: برنامه های منتظر تصویب
ru: Заявки в ожидании утверждения
tr: Onay bekleyen uygulamalar

source: You're In!
ar: أنت في!
fa: شما وارد می شوید!
ru: Ты в!
tr: Sen varsın!

source: You’ve been accepted into a club. Your dashboard has been updated.
ar: لقد تم قبولك في النادي. تم تحديث لوحة القيادة الخاصة بك.
fa: شما در یک باشگاه پذیرفته شده اید. داشبورد شما به روز شده است.
ru: Вы были приняты в клуб. Ваша панель мониторинга была обновлена.
tr: Bir kulübe kabul edildiniz. Gösterge tablonuz güncellendi.

source: Update User
ar: تحديث المستخدم
fa: کاربر را به روز کنید
ru: Обновить пользователя
tr: Kullanıcıyı güncelle

source: Messages
ar: رسائل
fa: پیام
ru: Сообщения
tr: Mesaj

source: Site Maps
ar: خرائط الموقع
fa: نقشه های سایت
ru: Карты сайта
tr: Site haritaları

source: Static Files
ar: ملفات ثابتة
fa: پرونده های استاتیک
ru: Статические файлы
tr: Statik dosyalar

source: Syndication
ar: المشاركة
fa: اندیشه
ru: Синдикация
tr: Sendikasyon

source: That page number is not an integer
ar: رقم الصفحة هذا ليس عددًا صحيحًا
fa: شماره صفحه عدد صحیح نیست
ru: Этот номер страницы не целое число
tr: Bu sayfa numarası bir tamsayı değil

source: That page number is less than 1
ar: رقم الصفحة أقل من 1
fa: شماره صفحه کمتر از 1 است
ru: Этот номер страницы меньше 1
tr: Bu sayfa numarası 1'den az

source: That page contains no results
ar: لا تحتوي تلك الصفحة على أي نتائج
fa: آن صفحه هیچ نتیجه ای ندارد
ru: Эта страница не содержит результатов
tr: Bu sayfa sonuç içermiyor

source: Enter a valid value.
ar: أدخل قيمة صالحة.
fa: یک مقدار معتبر وارد کنید.
ru: Введите допустимое значение.
tr: Geçerli bir değer girin.

source: Enter a valid domain name.
ar: أدخل اسم مجال صالح.
fa: یک نام دامنه معتبر وارد کنید.
ru: Введите действительное доменное имя.
tr: Geçerli bir alan adı girin.

source: Enter a valid URL.
ar: أدخل عنوان URL صالحًا.
fa: یک URL معتبر وارد کنید.
ru: Введите действительный URL.
tr: Geçerli bir URL girin.

source: Enter a valid integer.
ar: أدخل عدد صحيح صالح.
fa: یک عدد صحیح معتبر وارد کنید.
ru: Введите действительное целое число.
tr: Geçerli bir tamsayı girin.

source: Enter a valid email address.
ar: أدخل عنوان بريد إلكتروني صالح.
fa: یک آدرس ایمیل معتبر وارد کنید.
ru: Введите действительный адрес электронной почты.
tr: Geçerli bir e -posta adresi girin.

source: Enter a valid “slug” consisting of letters, numbers, underscores or hyphens.
ar: أدخل "سبيكة" صالحة تتكون من الحروف أو الأرقام أو السطح أو الواصلات.
fa: یک "slug" معتبر متشکل از حروف ، اعداد ، تأکید بر روی آنها را وارد کنید.
ru: Введите действительный «слизняк», состоящий из букв, чисел, подчеркивания или дефисов.
tr: Harfler, sayılar, alt çizgiler veya tire'den oluşan geçerli bir “sümüklü” girin.

source: Enter a valid “slug” consisting of Unicode letters, numbers, underscores, or hyphens.
ar: أدخل "سبيكة" صالحة تتكون من حروف أو أرقام أو ترسيخ أو واصلات Unicode.
fa: یک "slug" معتبر متشکل از حروف یونیکد ، اعداد ، زیرکانها یا هیفن ها را وارد کنید.
ru: Введите действительный «слизняк», состоящий из букв Unicode, чисел, подчеркивания или дефисов.
tr: Unicode harfleri, sayılar, alt çizgiler veya tire'den oluşan geçerli bir “sümüklü” girin.

source: IPv4 or IPv6
ar: IPv4 أو IPv6
fa: IPv4 یا IPv6
ru: IPv4 или IPv6
tr: IPv4 veya IPv6

source: Enter only digits separated by commas.
ar: أدخل الأرقام فقط مفصولة بفواصل.
fa: فقط رقم های جدا شده توسط کاما را وارد کنید.
ru: Введите только цифры, разделенные запятыми.
tr: Yalnızca virgülle ayrılmış basamaklar girin.

source: Enter a number.
ar: أدخل رقمًا.
fa: یک عدد وارد کنید.
ru: Введите число.
tr: Bir numara girin.

source: Null characters are not allowed.
ar: الشخصيات الفارغة غير مسموح بها.
fa: شخصیت های تهی مجاز نیستند.
ru: Нулевые символы не допускаются.
tr: Null karakterlere izin verilmez.

source: and
ar: و
fa: وت
ru: и
tr: Ve

source: Value %(value)r is not a valid choice.
ar: القيمة ٪ (القيمة) R ليست خيارًا صالحًا.
fa: مقدار ٪ (مقدار) R یک انتخاب معتبر نیست.
ru: Значение %(значение) r не является действительным выбором.
tr: Değer %(değer) R geçerli bir seçim değildir.

source: This field cannot be null.
ar: لا يمكن أن يكون هذا الحقل لاغية.
fa: این قسمت نمی تواند تهی باشد.
ru: Это поле не может быть нулевым.
tr: Bu alan boş olamaz.

source: This field cannot be blank.
ar: لا يمكن أن يكون هذا الحقل فارغًا.
fa: این قسمت نمی تواند خالی باشد.
ru: Это поле не может быть пустым.
tr: Bu alan boş olamaz.

source: Boolean (Either True or False)
ar: منطقية (إما صحيحة أو خاطئة)
fa: بولی (درست یا نادرست)
ru: Логический (правда или ложь)
tr: Boolean (doğru veya yanlış)

source: String (unlimited)
ar: سلسلة (غير محدودة)
fa: رشته (نامحدود)
ru: Строка (неограниченное)
tr: String (sınırsız)

source: Comma-separated integers
ar: الأعداد الصحيحة مفصولة فاصلة
fa: اعداد صحیح جدا از کاما
ru: Запятые целые числа
tr: Virgülle ayrılmış tamsayılar

source: Date (without time)
ar: التاريخ (بدون وقت)
fa: تاریخ (بدون زمان)
ru: Дата (без времени)
tr: Tarih (zamansız)

source: Date (with time)
ar: التاريخ (مع مرور الوقت)
fa: تاریخ (با زمان)
ru: Дата (со временем)
tr: Tarih (saatle)

source: Decimal number
ar: عدد عشري
fa: عدد دهدهی
ru: Десятичное число
tr: Ondalık sayı

source: Duration
ar: مدة
fa: مدت
ru: Продолжительность
tr: Süre

source: Email address
ar: عنوان البريد الإلكتروني
fa: آدرس ایمیل
ru: Адрес электронной почты
tr: E -posta adresi

source: File path
ar: مسار الملف
fa: مسیر پرونده
ru: Файл Путь
tr: Dosya Yolu
