Repository: zahraadelbani/club-management-backup
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar, fa, ru, tr

source: Instead of running `git fast-export` and filtering its output, filter the fast-export stream from stdin. The stdin must be in the expected input format (e.g. it needs to include original-oid directives).
ar: بدلاً من تشغيل "التصدير السريع" وتصفية إخراجها ، قم بتصفية دفق التصدير السريع من stdin. يجب أن يكون stdin في تنسيق الإدخال المتوقع (على سبيل المثال ، يحتاج إلى تضمين التوجيهات الأصلية المرجمة).
fa: به جای اجرای "Git Fast-Export" و فیلتر کردن خروجی آن ، جریان سریع صادرات را از Stdin فیلتر کنید. stdin باید در قالب ورودی مورد انتظار باشد (به عنوان مثال باید دستورالعمل های اصلی را شامل شود).
ru: Вместо того, чтобы запустить `git fast-export 'и фильтровать его вывод, отфильтруйте поток быстро экспорта из Stdin. Stdin должен находиться в ожидаемом входном формате (например, он должен включать оригинальные директивы).
tr: Hızlı ihracat `` git hızlı ihracat '' çalıştırmak ve çıkışını filtrelemek yerine, Stdin'den hızlı ihracat akışını filtreleyin. STDIN, beklenen giriş biçiminde olmalıdır (örneğin, orijinal-oit direktifleri içermesi gerekir).

source: Pass --quiet to other git commands called
ar: تمرير -كائن إلى أوامر GIT الأخرى التي تسمى
fa: عبور -به سایر دستورات git بنام
ru: Переход -quiet по другим командам GIT, называемых
tr: Pass -Squiet adlı diğer git komutlarına

source: Error: --analyze is incompatible with --path* flags; it's a read-only operation.
ar: خطأ: -تحليل غير متوافق مع -الممر* أعلام ؛ إنها عملية للقراءة فقط.
fa: خطا: -آنالیز با پرچم های -مسیر* ناسازگار است. این یک عمل فقط خواندنی است.
ru: Ошибка: -анализация несовместима с флагами -path*; Это операция только для чтения.
tr: Hata: -Analyze ---path* bayrakları ile uyumsuzdur; Bu salt okunur bir işlem.

source: Error: --analyze is incompatible with --stdin.
ar: خطأ: -تحليل لا يتوافق مع -Stresin.
fa: خطا: -آنالیز با -استدین ناسازگار است.
ru: Ошибка: -анализ несовместима с - -stdin.
tr: Hata: -Analyze --stdin ile uyumsuzdur.

source: Error: --use-base-name and --path-rename are incompatible.
ar: خطأ:-استخدام الاسم القاعدي و-التجديد غير متوافق.
fa: خطا:-نام و نام خانوادگی و--مسیر-نام ناسازگار هستند.
ru: Ошибка:-Использование-имени и-пап-Ренэм несовместимы.
tr: Hata:-Uuse-Base-Name ve--Path-Rename uyumsuz.

source: Error: need git >= 2.24.0
ar: خطأ: بحاجة إلى git> = 2.24.0
fa: خطا: نیاز به git> = 2.24.0
ru: Ошибка: нужно GIT> = 2.24.0
tr: Hata: Git> = 2.24.0'a ihtiyacım var

source: Error: need git >= 2.23.0
ar: خطأ: بحاجة إلى git> = 2.23.0
fa: خطا: نیاز به git> = 2.23.0
ru: Ошибка: нужно GIT> = 2,23.0
tr: Hata: Git> = 2.23.0'a ihtiyacım var

source: Error: need git >= 2.22.0
ar: خطأ: بحاجة إلى git> = 2.22.0
fa: خطا: نیاز به git> = 2.22.0
ru: Ошибка: нужно GIT> = 2.22.0
tr: Hata: Git> = 2.22.0'a ihtiyacım var

source: Error: could not parse --strip-blobs-bigger-than argument %s
ru: Ошибка: не удалось проанализировать--стрип-блюбов-бигерг, чем аргумент %s
tr: Hata: Ayrıştırılamadı-Strip-Bloblar Bigger- %s.

source: Error: --file-info-callback is incompatible with --stdin, --blob-callback, and --filename-callback.
ar: خطأ:--File-Info-Callback لا يتوافق مع-Stren ،--lob-callback ، و-Filename-Callback.
fa: خطا:--فایل-اینوفو-تماس با-stdin ،-blob-callback ، ناسازگار است. و-نام خانوادگی.
ru: Ошибка:-file-info-sallback несовместима с--stdin, -blob-callback, и-Филин-имен-сбоя.
tr: Hata: --file-info-callback-stdin, --blob-callback ile uyumsuzdur, ve --filename-callback.

source: Error: In %s, 'glob:' and '==>' are incompatible (renaming globs makes no sense)
ru: Ошибка: в %s, 'glob:' и '==>' несовместимы (переименование Globs не имеет смысла)
tr: Hata: %s, 'glob:' ve '==>' uyumsuzdur (Glob'ları yeniden adlandırma mantıklı değildir)

source: Error: When rename directories, if OLDNAME and NEW_NAME are both non-empty and either ends with a slash then both must.
ar: خطأ: عند إعادة تسمية الدلائل ، إذا كان OldName و New_Name غير فارغين ، وينتهيان بإيقاف المائل ، فيجب عليهما.
fa: خطا: هنگام تغییر نام دایرکتوری ها ، اگر OldName و New_name هم غیر خالی هستند و یا با یک برش به پایان می رسند ، هر دو باید.
ru: Ошибка: при переименовании каталогов, если OldName и New_Name не являются пустыми, и либо заканчиваются с помощью чернила, то оба должны.
tr: Hata: Dizinleri yeniden adlandırdığında, OldName ve New_Name hem boş değilse hem de bir eğik çizgi ile bitiyorsa, her ikisi de gerekir.

source: No arguments specified.
ar: لا حجج محددة.
fa: هیچ استدلالی مشخص نشده است.
ru: Не указано аргументов.
tr: Argüman belirtilmedi.

source: Nothing to analyze; repository is empty.
ar: لا شيء لتحليله المستودع فارغ.
fa: هیچ چیز برای تجزیه و تحلیل ؛ مخزن خالی است.
ru: Нечего анализировать; Репозиторий пуст.
tr: Analiz edecek bir şey yok; Depo boş.

source: Error: rev-list|diff-tree pipeline failed; see above.
ar: خطأ: فشل خط أنابيب Diff-Tree ؛ انظر أعلاه.
fa: خطا: Rev-List | خط لوله Diff-Tree ناموفق بود. به بالا مراجعه کنید.
ru: Ошибка: Rev-List | Diff-Tree Pipeline не удалось; См. Выше.
tr: Hata: REV-LIST | Fark-ağacı boru hattı başarısız oldu; yukarıya bakın.

source: <present>
ar: <press>
fa: <حاضر>
ru: <настоящий>
tr: <suman>

source: Overall Statistics
ar: الإحصاءات الشاملة
fa: آمار کلی
ru: Общая статистика
tr: Genel İstatistikler

source: Number of commits
ar: عدد الالتزامات
fa: تعداد تعهدات
ru: Количество коммитов
tr: Taahhüt Sayısı

source: Number of directories
ar: عدد الدلائل
fa: تعداد دایرکتوری ها
ru: Количество каталогов
tr: Dizin sayısı

source: Number of file extensions
ar: عدد ملحقات الملفات
fa: تعداد پسوندهای پرونده
ru: Количество расширений файлов
tr: Dosya uzantısı sayısı

source: Total unpacked size (bytes)
ar: حجم إجمالي غير مرغوب فيه (بايت)
fa: کل اندازه بسته نشده (بایت)
ru: Общий распаковка (байты)
tr: Toplam paketlenmemiş boyut (bayt)

source: Total packed size (bytes)
ar: إجمالي الحجم المعبأ (بايت)
fa: کل اندازه بسته بندی شده (بایت)
ru: Общий упакованный размер (байты)
tr: Toplam paketlenmiş boyut (bayt)

source: Caveats
ar: تحذيرات
fa: احتیاط
ru: Предостережения
tr: Uyarı

source: Sizes
ar: الأحجام
fa: اندازه
ru: Размеры
tr: Bedenler

source: Packed size represents what size your repository would be if no trees, commits, tags, or other metadata were included (though it may fail to represent de-duplication; see below). It also represents the current packing, which may be suboptimal if you haven't gc'ed for a while. Unpacked size represents what size your repository would be if no trees, commits, tags, or other metadata were included AND if no files were packed; i.e., without delta-ing or compression. Both unpacked and packed sizes can be slightly misleading. Deleting a blob from history not save as much space as the unpacked size, because it is obviously normally stored in packed form. Also, deleting a blob from history may not save as much space as its packed size either, because another blob could be stored as a delta against that blob, so when you remove one blob another blob's packed size may grow. Also, the sum of the packed sizes can add up to more than the repository size; if the same contents appeared in the repository in multiple places, git will automatically de-dupe and store only one copy, while the way sizes are added in this analysis adds the size for each file path that has those contents. Further, if a file is ever reverted to a previous version's contents, the previous version's size will be counted multiple times in this analysis, even though git will only store it once.
ar: يمثل الحجم المعبأ ما هو حجم مستودعك إذا لم يكن تم تضمين الأشجار أو الالتزامات أو العلامات أو البيانات الوصفية الأخرى (على الرغم من أنها قد تكون فشل في تمثيل deplication ؛ انظر أدناه). كما أنه يمثل التعبئة الحالية ، والتي قد تكون دون المستوى الأمثل إذا لم تكن قد تم gc'ed for a بينما. يمثل الحجم غير المعبأ ما هو حجم مستودعك إذا لا تم تضمين الأشجار أو الالتزامات أو العلامات أو التعريف الأخرى كانت الملفات معبأة ؛ أي بدون دلتا أو ضغط. يمكن أن تكون كل من الأحجام غير المعبأة والمعبئة مضللة بعض الشيء. حذف لا توفر النقطة من التاريخ مساحة كبيرة مثل الحجم غير المعبأ ، لأنه من الواضح أنه يتم تخزينه عادة في شكل معبأ. أيضًا، قد لا يوفر حذف النقطة من التاريخ مساحة كبيرة مثل معبأة الحجم أيضًا ، لأنه يمكن تخزين نقطة أخرى كدلتا ضد تلك النقطة ، لذلك عندما تقوم بإزالة حجم واحد ، قد يكون حجم آخر معبأة ينمو. أيضا ، يمكن أن يضيف مجموع الأحجام المعبأة أكثر من حجم المستودع ؛ إذا ظهرت نفس المحتويات في المستودع في أماكن متعددة ، ستنزل GIT تلقائيًا وتخزين واحد فقط نسخ ، بينما تتم إضافة أحجام في هذا التحليل تضيف الحجم لكل مسار ملف يحتوي على تلك المحتويات. علاوة على ذلك ، إذا كان الملف من أي وقت مضى عاد إلى محتويات الإصدار السابق ، السابق سيتم حساب حجم الإصدار عدة مرات في هذا التحليل ، حتى على الرغم من أن GIT سوف يخزنها مرة واحدة فقط.
fa: اندازه بسته بندی شده نشان دهنده اندازه مخزن شما در صورت وجود نیست درختان ، تعهدات ، برچسب ها یا ابرداده های دیگر گنجانده شده است (اگرچه ممکن است نتوانسته است به نمایش درآید. به زیر مراجعه کنید). همچنین نمایانگر بسته بندی فعلی ، که اگر شما برای a gc'ed نکرده باشید ممکن است زیر حد متوسط ​​باشد در حالی که اندازه بسته بندی نشده نشان دهنده اندازه مخزن شما در صورت وجود است درختان ، تعهدات ، برچسب ها یا ابرداده های دیگر گنجانده شده و در صورت وجود پرونده ها بسته بندی شدند. یعنی بدون دلتنگ یا فشرده سازی. هر دو اندازه بسته بندی نشده و بسته بندی شده می توانند کمی گمراه کننده باشند. حذف حباب از تاریخ به اندازه اندازه بسته نشده فضای صرفه جویی نمی کند ، زیرا بدیهی است که به طور معمول به صورت بسته بندی شده ذخیره می شود. همچنین ، حذف یک حباب از تاریخ ممکن است به اندازه بسته بندی شده فضای آن صرفه جویی نکند اندازه هم ، زیرا حباب دیگر می تواند به عنوان دلتا در برابر ذخیره شود آن حباب ، بنابراین هنگامی که یک حباب را حذف می کنید اندازه بسته بندی شده دیگر ممکن است رشد همچنین ، مجموع اندازه های بسته بندی شده می تواند به بیش از آن اضافه شود اندازه مخزن ؛ اگر همان محتویات در مخزن ظاهر شود چندین مکان ، Git به طور خودکار از بین می رود و فقط یک مورد را ذخیره می کند کپی کنید ، در حالی که اندازه اندازه در این تجزیه و تحلیل اندازه را اضافه می کند برای هر مسیر پرونده ای که دارای آن محتویات است. علاوه بر این ، اگر یک پرونده باشد تا به حال به مطالب نسخه قبلی ، نسخه قبلی برگردانده شده است اندازه نسخه چندین بار در این تجزیه و تحلیل شمارش خواهد شد. اگرچه GIT فقط یک بار آن را ذخیره می کند.
ru: Упакованный размер представляет, каким размером будет ваш репозиторий, если нет были включены деревья, коммиты, теги или другие метаданные (хотя это может не представлять двойку; см. ниже). Он также представляет текущая упаковка, которая может быть неоптимальной, если вы не получили GC'ed для пока. Распакованный размер представляет, каким размером будет ваш репозиторий, если нет были включены деревья, коммиты, теги или другие метаданные, а если нет Файлы были упакованы; т.е. без дельты или сжатия. Оба распаковка и упакованные размеры могут быть немного вводящими в заблуждение. Удаление капля из истории не сохраняет столько места, сколько распакованный размер, Потому что он, очевидно, обычно хранится в упакованной форме. Также, Удаление капли из истории может не сэкономить столько места, сколько упаковано размер, потому что еще один капля может храниться как дельта против эта капля, поэтому, когда вы удаляете один каплей, упакованный размер другого блоба может расти. Кроме того, сумма упакованных размеров может составлять больше, чем размер репозитория; Если такое же содержимое появилось в репозитории в Несколько мест, GIT автоматически ослабнет и хранит только один Скопировать, в то время как способы добавляются размеры, которые добавляют размер Для каждого пути файла, который имеет такое содержимое. Далее, если файл когда -либо возвращался к содержимому предыдущей версии, предыдущий Размер версии будет учитываться несколько раз в этом анализе, даже Хотя git будет хранить его только один раз.
tr: Paketlenmiş boyut, deponuzun hangi boyutta olacağını gösterir. Ağaçlar, taahhütler, etiketler veya diğer meta veriler dahil edildi (ancak çoğaltma işlemini temsil edemez; aşağıya bakın). Ayrıca temsil eder Mevcut ambalaj, eğer bir için gc'ed yapmadıysanız sırasında. Paketlenmemiş boyut, deponuzun hangi boyutta olacağını gösterir. ağaçlar, taahhütler, etiketler veya diğer meta veriler dahil edildi ve Dosyalar doluydu; yani, delta veya sıkıştırma olmadan. Hem paketlenmemiş hem de paketlenmiş boyutlar biraz yanıltıcı olabilir. Silme Tarihten bir leke, paketlenmemiş boyut kadar yerden tasarruf etmez, Çünkü normalde paketlenmiş biçimde saklanır. Ayrıca, Tarihten bir leke silmek, paketlenmiş kadar yerden tasarruf etmeyebilir Boyut da, çünkü başka bir blob delta olarak saklanabilir O blob, bir blob'u çıkardığınızda başka bir blobun paketlenmiş boyutu olabilir büyümek. Ayrıca, paketlenmiş boyutların toplamı, depo boyutu; Aynı içerik depoda görüntüyse Birden fazla yer, git otomatik olarak dükkar ve sadece bir tane depolar Kopyala, bu analizde boyutların eklenme şekli boyutu ekler Bu içeriğe sahip her dosya yolu için. Ayrıca, bir dosya ise önceki bir sürümün içeriğine, önceki Sürümün boyutu bu analizde bile birçok kez sayılacak Git sadece bir kez saklayacak.

source: Deletions
ar: الحذف
fa: حذف
ru: Удаления
tr: Silme

source: Whether a file is deleted is not a binary quality, since it can be deleted on some branches but still exist in others. Also, it might exist in an old tag, but have been deleted in versions newer than that. More thorough tracking could be done, including looking at merge commits where one side of history deleted and the other modified, in order to give a more holistic picture of deletions. However, that algorithm would not only be more complex to implement, it'd also be quite difficult to present and interpret by users. Since --analyze is just about getting a high-level rough picture of history, it instead implements the simplistic rule that is good enough for 98% of cases: A file is marked as deleted if the last commit in the fast-export stream that mentions the file lists it as deleted. This makes it dependent on topological ordering, but generally gives the "right" answer.
ar: ما إذا كان تم حذف ملف ليس جودة ثنائية ، لأنه يمكن أن يكون تم حذفه على بعض الفروع ولكن لا يزال موجودًا في الآخرين. أيضا ، قد موجودة في علامة قديمة ، ولكن تم حذفها في الإصدارات الأحدث من الذي - التي. يمكن القيام بمزيد من التتبع ، بما في ذلك النظر في يندمج الالتزام حيث تم حذف جانب من التاريخ والآخر تعديل ، من أجل إعطاء صورة أكثر شمولية للحذف. ومع ذلك ، ذلك لن تكون الخوارزمية أكثر تعقيدًا فحسب ، بل ستكون أيضًا من الصعب للغاية تقديم وتفسير من قبل المستخدمين. منذ -تحليل هو فقط عن الحصول على صورة خشنة عالية المستوى ، بدلاً من ذلك ينفذ القاعدة التبسيطية التي هي جيدة بما يكفي ل 98 ٪ من الحالات: يتم تمييز ملف على أنه تم حذفه إذا كان الالتزام الأخير في التصدير السريع دفق يذكر الملف يسرده على أنه تم حذفه. هذا يجعله يعتمد على الترتيب الطوبولوجي ، ولكن يعطي عمومًا الجواب "اليمين".
fa: این که آیا یک پرونده حذف شده است ، کیفیت باینری نیست ، زیرا می تواند باشد در برخی از شاخه ها حذف شده اما هنوز در برخی دیگر وجود دارد. همچنین ، ممکن است در یک برچسب قدیمی وجود دارد ، اما در نسخه های جدیدتر از آن حذف شده است که ردیابی دقیق تر می تواند انجام شود ، از جمله نگاه کردن ادغام را در جایی که یک طرف تاریخ حذف شده و دیگری اصلاح شده ، ادغام می کند ، به منظور ارائه تصویری جامع تر از حذف. با این حال ، آن الگوریتم نه تنها برای اجرای پیچیده تر خواهد بود بلکه می تواند باشد ارائه و تفسیر کاربران بسیار دشوار است. از آنجا که -آنالیز کنید در عوض فقط در مورد گرفتن یک تصویر خشن سطح بالا از تاریخ است. قانون ساده گرایانه ای را که به اندازه کافی مناسب برای 98 ٪ موارد است ، پیاده سازی می کند: اگر آخرین تعهد در سریع صادرات یک پرونده حذف شود جریان که از پرونده ذکر می کند ، آن را به صورت حذف شده لیست می کند. این باعث می شود که به ترتیب توپولوژیکی وابسته باشد ، اما به طور کلی می دهد پاسخ "درست".
ru: Whether a file is deleted is not a binary quality, since it can be deleted on some branches but still exist in others. Also, it might exist in an old tag, but have been deleted in versions newer than что. More thorough tracking could be done, including looking at merge commits where one side of history deleted and the other modified, in order to give a more holistic picture of deletions. However, that algorithm would not only be more complex to implement, it'd also be quite difficult to present and interpret by users. Since --analyze is just about getting a high-level rough picture of history, it instead implements the simplistic rule that is good enough for 98% of cases: A file is marked as deleted if the last commit in the fast-export stream that mentions the file lists it as deleted. This makes it dependent on topological ordering, but generally gives the "right" answer.
tr: Bir dosyanın silinmediği ikili kalite değildir, çünkü Bazı dallarda silindi, ancak yine de diğerlerinde var. Ayrıca, eski bir etikette var, ancak daha yeni sürümlerde silindi O. Bakmak da dahil olmak üzere daha kapsamlı bir izleme yapılabilir. Birleştirme, tarihin bir tarafının silindiği ve diğerinin değiştirildiği yerleri taahhüt eder, silme işlemlerinin daha bütünsel bir resmini vermek için. Ancak, Algoritma sadece uygulanması daha karmaşık olmakla kalmaz, aynı zamanda Kullanıcılar tarafından sunulması ve yorumlanması oldukça zor. O zamandan beri -Analyze sadece üst düzey bir kaba bir tarihin çizilmesi, bunun yerine Vakaların% 98'i için yeterince iyi olan basit kuralı uygular: Bir dosya, hızlı ihracattaki son taahhütte silinmiş olarak işaretlenir Dosyadan silinmiş olarak listeden bahseden akış. Bu onu topolojik sıralamaya bağlı hale getirir, ancak genellikle "doğru" cevap.

source: Renames
ar: إعادة تسمية
fa: تغییر نام
ru: Переименование
tr: Yeniden adlandırma

source: Renames share the same non-binary nature that deletions do, plus additional challenges: * If the renamed file is renamed again, instead of just two names for a path you can have three or more. * Rename pairs of the form (oldname, newname) that we consider to be different names of the "same file" might only be valid over certain commit ranges. For example, if a new commit reintroduces a file named oldname, then new versions of oldname aren't the "same file" anymore. We could try to portray this to the user, but it's easier for the user to just break the pairing and only report unbroken rename pairings to the user. * The ability for users to rename files differently in different branches means that our chains of renames will not necessarily be linear but may branch out.
ar: إعادة تسمية مشاركة نفس الطبيعة غير الثنائية التي تفعلها ، بالإضافة إلى ذلك تحديات إضافية: * إذا تم إعادة تسمية الملف المعاد تسميته مرة أخرى ، بدلاً من اسمين فقط مسار يمكن أن يكون لديك ثلاثة أو أكثر. * إعادة تسمية أزواج النموذج (Oldname ، NewName) التي نعتبرها قد تكون أسماء مختلفة من "نفس الملف" صالحة فقط على بعض نطاقات الالتزام. على سبيل المثال ، إذا كان التزام جديد يعيد تقديم ملف اسمه Oldname ، ثم إصدارات جديدة من Oldname ليست "الملف نفسه" بعد الآن. يمكن أن نحاول تصوير هذا للمستخدم ، لكن الأمر أسهل لكي يكسر المستخدم الاقتران فقط والتقرير فقط إعادة تسمية الاقتران للمستخدم. * قدرة المستخدمين على إعادة تسمية الملفات بشكل مختلف بشكل مختلف الفروع تعني أن سلاسل إعادة تسميةنا لن تكون بالضرورة خطي ولكن قد تتفرع.
fa: RENAMES همان ماهیت غیر دوتایی را که حذف ها انجام می دهند ، به اشتراک می گذارند. چالش های اضافی: * اگر پرونده تغییر نام دوباره تغییر نام داده شود ، به جای فقط دو نام برای مسیری که می توانید سه یا بیشتر داشته باشید. * تغییر نام جفت های فرم (Oldname ، NewName) که ما آن را می دانیم نام های مختلف "همان پرونده" فقط می تواند بیش از حد خاص باشد دامنه به عنوان مثال ، اگر یک تعهد جدید یک پرونده را دوباره معرفی کند نام OldName ، سپس نسخه های جدید OldName "همان پرونده" نیستند دیگر ما می توانیم سعی کنیم این را برای کاربر به تصویر بکشیم ، اما آسان تر است برای اینکه کاربر فقط جفت شدن را بشکند و فقط گزارش ناگس کند جفت شدن را به کاربر تغییر نام دهید. * توانایی کاربران برای تغییر نام های مختلف به صورت متفاوت شاخه ها به این معنی است که زنجیرهای تغییر نام های ما لزوماً نخواهد بود خطی اما ممکن است شاخه شود.
ru: Переименование делится тем же невоичным характером, что и удаляет, плюс Дополнительные проблемы: * Если переименованный файл снова переименован, вместо двух имен для Путь, который вы можете иметь три или более. * Переименовать пары формы (OldName, NewName), которые мы считаем Различные имена «того же файла» могут быть действительными только по определенным Комплексные диапазоны. Например, если новый коммит вновь введен в файл Назван OldName, тогда новые версии OldName не являются «такими же файлами» больше. Мы могли бы попытаться изобразить это пользователю, но это проще Чтобы пользователь просто сломал спаривание и только сообщил о непрерывном Переименовать пары пользователю. * Возможность для пользователей переименовать файлы по -разному по -разному филиалы означает, что наши цепочки переимеров не обязательно будут Линейный, но может разветвляться.
tr: Yeniden adlandırmalar, silme işlemlerinin yaptığı aynı ikili olmayan doğayı paylaşıyor, artı Ek Zorluklar: * Yeniden adlandırılan dosya yeniden adlandırılmışsa, sadece iki isim yerine yeniden adlandırılmışsa Üç veya daha fazla sahip olabileceğiniz bir yol. * Olduğunu düşündüğümüz formun çiftlerini (OldName, NewName) yeniden adlandırın "Aynı dosya" nın farklı adları yalnızca kesin olarak geçerli olabilir aralıkları işleyin. Örneğin, yeni bir taahhüt bir dosyayı yeniden tanıtarsa OldName adında, o zaman OldName'in yeni sürümleri "aynı dosya" değil artık değil. Bunu kullanıcıya tasvir etmeye çalışabiliriz, ancak daha kolay kullanıcının eşleştirmeyi kırması ve sadece kırılmadan rapor etmesi Eşleştirmeleri kullanıcıya yeniden adlandırın. * Kullanıcıların dosyaları farklı olarak farklı şekilde yeniden adlandırma yeteneği Şubeler, yeniden adlandırma zincirlerimizin mutlaka olmayacağı anlamına gelir. doğrusal ama dallanabilir.

source: Deleted directories by reverse size
ar: الدلائل المحذوفة حسب الحجم العكسي
fa: دایرکتوری های حذف شده با اندازه معکوس
ru: Удаленные каталоги по обратному размеру
tr: Silinmiş dizinler ters boyuta göre

source: Format: unpacked size, packed size, date deleted, directory name
ar: التنسيق: حجم غير معبأ ، حجم معبأة ، حذف التاريخ ، اسم الدليل
fa: قالب: اندازه بسته بندی نشده ، اندازه بسته بندی شده ، تاریخ حذف شده ، نام دایرکتوری
ru: Формат: распакованный размер, упакованный размер, удаленная дата, имя каталога
tr: Biçim: Paketlenmemiş boyut, paketlenmiş boyut, tarih silinmiş, dizin adı

source: All directories by reverse size
ar: جميع الدلائل حسب الحجم العكسي
fa: همه دایرکتوری ها با اندازه معکوس
ru: Все каталоги по обратному размеру
tr: Tüm dizinler ters boyuta göre

source: Deleted extensions by reverse size
ar: تم حذف الامتدادات حسب الحجم العكسي
fa: پسوندهای حذف شده با اندازه معکوس
ru: Удаленные расширения по обратному размеру
tr: Silinmiş uzantıları ters boyuta göre

source: Format: unpacked size, packed size, date deleted, extension name
ar: التنسيق: حجم غير معبأ ، حجم معبأة ، حذف التاريخ ، اسم التمديد
fa: قالب: اندازه بسته بندی نشده ، اندازه بسته بندی شده ، تاریخ حذف ، نام فرمت
ru: Формат: распакованный размер, упакованный размер, удаленная дата, имя расширения
tr: Biçim: Paketlenmemiş boyut, paketlenmiş boyut, tarih silinmiş, uzantı adı

source: <no extension>
ar: <لا تمديد>
fa: <بدون پسوند>
ru: <Нет расширения>
tr: <uzatma yok>

source: All extensions by reverse size
ar: جميع الامتدادات حسب الحجم العكسي
fa: تمام پسوندها با اندازه معکوس
ru: Все расширения по обратному размеру
tr: Ters boyuta göre tüm uzantılar

source: Deleted paths by reverse accumulated size
ar: المسارات المحذوفة حسب الحجم المتراكم العكسي
fa: مسیرهای حذف شده با اندازه انباشته معکوس
ru: Удаленные пути путем обратного накопленного размера
tr: Ters birikmiş boyuta göre silinen yollar

source: Format: unpacked size, packed size, date deleted, path name(s)
ar: التنسيق: الحجم غير المعبأ ، الحجم المعبأ ، حذف التاريخ ، اسم المسار (S)
fa: قالب: اندازه بسته بندی نشده ، اندازه بسته بندی شده ، تاریخ حذف شده ، نام مسیر (ها)
ru: Формат: распакованный размер, упакованный размер, удаленная дата, название (-ы) пути
tr: Biçim: Paketlenmemiş boyut, paketlenmiş boyut, tarih silinmiş, yol ad (lar)
