Repository: zahraadelbani/club-management-backup
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar, fa, ru, tr

source: All paths by reverse accumulated size
ar: جميع المسارات حسب الحجم المتراكم العكسي
fa: تمام مسیرها با اندازه انباشته معکوس
ru: Все пути с помощью обратного накопленного размера
tr: Ters birikmiş boyuta göre tüm yollar

source: Format: unpacked size, packed size, date deleted, path name
ar: التنسيق: حجم غير معبأ ، حجم معبأة ، حذف التاريخ ، اسم المسار
fa: قالب: اندازه بسته بندی نشده ، اندازه بسته بندی شده ، تاریخ حذف شده ، نام مسیر
ru: Формат: распакованный размер, упакованный размер, удаленная дата, название пути
tr: Biçim: paketlenmemiş boyut, paketlenmiş boyut, tarih silinmiş, yol adı

source: Files by sha and associated pathnames in reverse size
ar: ملفات من قبل SHA وأسماء المسارات المرتبطة في الحجم العكسي
fa: پرونده های SHA و نام های مرتبط در اندازه معکوس
ru: Файлы SHA и связанные с ними именами в обратном размере
tr: Sha tarafından yapılan dosyalar ve ters boyutta ilişkili yol adları

source: Format: sha, unpacked size, packed size, filename(s) object stored as
ar: التنسيق: SHA ، الحجم غير المعبأ ، الحجم المعبأ ، اسم ملف (أسماء) مخزنة ككائن
fa: قالب: Sha ، اندازه بسته نشده ، اندازه بسته بندی شده ، نام پرونده (S) ذخیره شده به عنوان
ru: Формат: SHA, распакованный размер, упакованный размер, объект имени файла, хранящийся как
tr: Biçim: SHA, paketlenmemiş boyut, paketlenmiş boyut, dosya adı (lar) nesnesi

source: Warning: Removing recursively: "%s"
ru: ПРЕДУПРЕЖДЕНИЕ: Удаление рекурсивно: «%s»
tr: UYARI: Tekrarlı olarak kaldırılması: "%s"

source: Error: dir already exists (use --force to delete): "%s"
ru: Ошибка: DIR уже существует (используйте -отдают для удаления): "%s"
tr: Hata: DIR zaten var (kullanın -Silinti): "%s"

source: Writing reports to %s...
ru: Написание отчетов к %s ...

source: done.
ar: منتهي.
fa: انجام شده
ru: сделанный.
tr: Tamamlandı.

source: Error: Cannot pass a %s_callback to RepoFilter AND pass --%s-callback
ru: Ошибка: не может передать %s_callback to Repofilter и Pass- %s-callback
tr: Hata: %s_callback'i repofilter ve geçmeye geçemiyor- %s-callback

source: Error: --%s-callback should have a return statement
ru: Ошибка:-%s-образной защиты должен иметь оператор возврата
tr: Hata:-%s-callback'in bir iade ifadesi olmalı

source: Error: Cannot specify --sensitive-data-removal on a follow-up invocation of git-filter-repo unless it was specified in previously runs.
ar: خطأ: لا يمكن تحديد-إعادة إلغاء الحساسية في الاحتجاج على المتابعة من Git-Filter-Repo ما لم يتم تحديده في عمليات التشغيل السابقة.
fa: خطا: نمی تواند تنظیم مجدد داده های حساس را در یک دعوت پیگیری مشخص کند از Git-Filter-Repo مگر اینکه در اجراهای قبلی مشخص شده باشد.
ru: Ошибка: нельзя указать-чувствительно-дат-удаление в результате последующего вызова Git-Filter-Repo, если только он не был указан в ранее запусках.
tr: Hata: Bir takip çağrısında-duyarlı veri kaldırma belirtilemiyor Git-Filter-Repo'nun daha önce koşularda belirtilmediği sürece.

source: Error: sensitive data removal is incompatible with --stdin
ar: خطأ: إزالة البيانات الحساسة لا تتوافق مع -stdin
fa: خطا: حذف داده های حساس با -stdin ناسازگار است
ru: Ошибка: конфиденциальное удаление данных несовместимо с - -stdin
tr: Hata: Hassas veri kaldırma -stdin ile uyumsuz

source: Error: sensitive data removal is incompatible with --source and --target
ar: خطأ: إزالة البيانات الحساسة لا تتوافق مع -المصدر والاستهداف
fa: خطا: حذف حساس داده ها با منبع و هدفمند ناسازگار است
ru: Ошибка: конфиденциальное удаление данных несовместимо с -Source и -target
tr: Hata: Hassas veri kaldırma ---source ve --ggget ile uyumsuz

source: Note: when cloning local repositories, you need to pass --no-local to git clone to avoid this issue.
ar: ملاحظة: عند استنساخ المستودعات المحلية ، تحتاج إلى المرور -لا محلي لاستنساخ GIT لتجنب هذه المشكلة.
fa: توجه: هنگام کلون کردن مخازن محلی ، باید عبور کنید -هیچ محلی به کلون git برای جلوگیری از این مسئله.
ru: Примечание. При клонировании местных репозитории вам нужно пройти -не локальный к клону, чтобы избежать этой проблемы.
tr: Not: Yerel depoları klonlarken geçmeniz gerekir. -bu sorunu önlemek için git klonuna-lokal.

source: Aborting: Refusing to destructively overwrite repo history since this does not look like a fresh clone. (%s) %sPlease operate on a fresh clone instead. If you want to proceed anyway, use --force.
ru: Прерывание: отказ от разрушительно перезаписать историю репо, так как Это не похоже на свежий клон. (%s) Вместо этого разоблачение работает на свежем клоне. Если вы хотите продолжить В любом случае, используйте - -силу.

source: GIT_DIR must be .
ar: يجب أن يكون git_dir.
fa: git_dir باید باشد.
ru: Git_dir должен быть.
tr: Git_dir olmalı.

source: GIT_DIR must be .git
ar: يجب أن يكون git_dir .git
fa: git_dir باید باشد .git
ru: Git_dir должен быть .git
tr: Git_dir .git olmalı

source: expected freshly packed repo
ar: من المتوقع أن يكون الريبو المعبأ حديثًا
fa: repo تازه بسته بندی شده انتظار می رود
ru: Ожидается свежевыполненное репо
tr: Beklenen taze paketlenmiş repo

source: expected one remote, origin
ar: متوقع واحد عن بعد ، الأصل
fa: یک از راه دور ، منشأ
ru: Ожидаемый один отдаленный, происхождение
tr: beklenen bir uzaktan, orijin

source: expected at most one entry in the reflog for %s
ru: Ожидается не более одной записи в Reflorog для %s
tr: %s için yerinden bir giriş bekleniyor

source: has stashed changes
ar: لديه تغييرات مخبأة
fa: تغییراتی را ایجاد کرده است
ru: спрятал изменения
tr: Değişiklikleri sakladı

source: you have uncommitted changes
ar: لديك تغييرات غير ملتزم بها
fa: شما تغییرات غیرقابل قبول دارید
ru: у вас были незаконные изменения
tr: Taahhütsüz değişiklikler var

source: you have unstaged changes
ar: لديك تغييرات غير معروضة
fa: شما تغییراتی بی نظیر دارید
ru: у вас есть неостановленные изменения
tr: Stangsız değişiklikleriniz var

source: you have untracked changes
ar: لديك تغييرات غير متوفرة
fa: شما تغییراتی در دست نداشته اید
ru: у вас не отказались изменения
tr: Taşınmamış değişiklikleriniz var

source: %s exists, but %s not found
ru: %s существует, но %s не найдено
tr: %s var, ancak %s bulunamadı

source: %s does not match %s
ru: %s не соответствует %s
tr: %s %s ile eşleşmez

source: you have multiple worktrees
ar: لديك متعددة من أجهزة العمل
fa: شما چندین کارگر دارید
ru: у вас есть несколько рабочих
tr: Birden fazla işin var

source: Repacking your repo and cleaning out old unneeded objects
ar: إعادة تعبئة ريبو وتنظيف الأشياء القديمة غير الضرورية
fa: بازپرداخت repo خود و تمیز کردن اشیاء غیر ضروری قدیمی
ru: Переупаковка вашего репо и очистка старых ненужных предметов
tr: Repo'nuzu yeniden paketleme ve eski gereksiz nesneleri temizleme

source: File renaming caused colliding pathnames!
ar: تسبب إعادة تسمية الملف أسماء المسارات!
fa: تغییر نام فایل باعث برخورد Pathnames شد!
ru: Переименование файлов вызвало столкновения путей!
tr: Dosya yeniden adlandırma çarpışan yol adlarına neden oldu!

source: Commit: {}
ar: يقترف: {}
fa: متعهد: {}
ru: Совершить: {}
tr: İşlemek: {}

source: Filename: {}
ar: اسم الملف: {}
fa: نام پرونده: {}
ru: Имя файла: {}
tr: Dosya adı: {}

source: Failed loading %s from %s
ru: Неудачная загрузка %s от %s
tr: %S'den başarısız %s

source: Failed to find %s to save to %s
ru: Не удалось найти %s, чтобы сэкономить до %s
tr: %S'ye tasarruf etmek için %s bulamadı

source: Rewrote the stash.
ar: أعد كتابة الخبأ.
fa: بازنویسی را بازنویسی کنید.
ru: Переписать тайник.
tr: Ziketi yeniden yazın.

source: git update-ref failed; see above
ar: فشل تحديث GIT-REF ؛ انظر أعلاه
fa: Git Update-Ref شکست خورد ؛ به بالا مراجعه کنید
ru: git update-ref не удалось; См. Выше
tr: Git Update-Ref başarısız oldu; Yukarıda bakın

source: NOTICE: Fetching all refs from origin to make sure we rewrite all history that may reference the sensitive data, via
ar: إشعار: جلب جميع الحكام من الأصل للتأكد من إعادة كتابة كل التاريخ الذي قد يشير إلى البيانات الحساسة ، عبر
fa: توجه: برای اطمینان از بازنویسی ما ، همه Refs را از مبدأ واگذار می کنیم تمام تاریخ که ممکن است داده های حساس را از طریق ارجاع دهد
ru: Примечание: извлечение всех ссылок из Origin, чтобы убедиться, что мы переписываем Вся история, которая может ссылаться на конфиденциальные данные через
tr: Dikkat: Yeniden yazdığımızdan emin olmak için tüm referansları orijinden getirme Hassas verilere başvurabilecek tüm geçmişler

source: WARNING: Fetching all refs from origin failed
ar: تحذير: فشل جلب جميع الحكام من الأصل
fa: هشدار: واکشی همه Refs از Origin شکست خورد
ru: Предупреждение: извлечение всех ссылок из Origin не удалось
tr: UYARI: Tüm referansları orijinalden getirme başarısız oldu

source: NOTICE: Removing 'origin' remote; see 'Why is my origin removed?' in the manual if you want to push back there. (was %s)
ru: Примечание: удаление «Происхождение» удаленного; Смотри «Почему мое происхождение удаляется?» В руководстве, если вы хотите отодвинуть туда. (было %s)
tr: Dikkat: 'Kökeni' uzaklaştırma; Bkz. 'Kökenim neden kaldırıldı?' Eğer oraya geri itmek istiyorsanız kılavuzda. ( %s)

source: old
ar: قديم
fa: قدیمی
ru: старый
tr: eskimiş

source: new
ar: جديد
fa: جدید
ru: новый
tr: yeni

source: ref
ar: المرجع
fa: پیروز
ru: рефери
tr: referans

source: The following commits used to be merge commits but due to filtering are now regular commits; they likely have suboptimal commit messages (e.g. "Merge branch next into master"). Original commit hash on the left, commit hash after filtering/rewriting on the right:
ar: الالتزامات التالية اعتادت أن تكون الالتزامات ولكن بسبب التصفية أصبحت الآن عملاً منتظمًا ؛ من المحتمل أن يكون لديهم رسائل الالتزام دون المستوى الأمثل (على سبيل المثال "دمج فرع المقبل في الماجستير"). الالتزام الأصلي على اليسار ، ارتكب التجزئة بعد التصفية/إعادة الكتابة على اليمين:
fa: تعهدات زیر برای ادغام انجام می شود اما به دلیل فیلتر کردن اکنون تعهدات منظم هستند. آنها به احتمال زیاد پیام های متعهد زیر حد متوسط ​​دارند (به عنوان مثال "شعبه ادغام کنار استاد"). تعهد اصلی در سمت چپ ، هش را پس از فیلتر کردن/بازنویسی در سمت راست مرتکب شوید:
ru: Следующие коммиты раньше были слияниями, но из -за фильтрации теперь регулярные коммиты; У них, вероятно, есть неоптимальные сообщения о коммите (например, «Merge Franch Neight in Master»). Оригинальный хэш коммита на Слева, фиксация после фильтрации/переписывания справа:
tr: Aşağıdaki taahhütler birleştirme taahhütleridir, ancak filtreleme nedeniyle şimdi düzenli taahhütler; Muhtemelen yetersiz taahhüt mesajları var (örn. Orijinal taahhüt karma Sol, sağda filtreleme/yeniden yazma işleminden sonra hash işleyin:

source: The following commits were filtered out, but referenced in another commit message. The reference to the now-nonexistent commit hash (or a substring thereof) was left as-is in any commit messages:
ar: تم ترشيح الالتزامات التالية ، ولكن تمت الإشارة إليها في أخرى رسالة ارتكاب. الإشارة إلى تجزئة الالتزام غير المتسقة الآن تم ترك (أو فرعية منه) كما هو الحال في أي رسائل ملزمة:
fa: تعهدات زیر فیلتر شده است ، اما به دیگری اشاره شده است پیام مرتکب اشاره به هش تعهد در حال حاضر نه (یا یک بستر آن) در هر پیام متعهد به عنوان باقی مانده است:
ru: Следующие коммиты были отфильтрованы, но ссылались в другом Комплект сообщения. Ссылка на ныне неопределительный хэш коммита (или подстрока) была оставлена ​​как есть в любых сообщениях коммита:
tr: Aşağıdaki taahhütler filtrelendi, ancak başka bir mesajı işleyin. Şimdi olmayan taahhütlü karma referans (veya alt çizgileri) herhangi bir taahhüt mesajında ​​olduğu gibi bırakıldı:

source: No filtering problems encountered.
ar: لا توجد مشاكل تصفية مواجهتها.
fa: هیچ مشکلی در زمینه فیلتر وجود ندارد.
ru: Проблемы с фильтрацией не столкнулись.
tr: Filtreleme problemi karşılaşılmadı.

source: This file exists to allow you to filter again without --force, and to specify that metadata files should be updated instead of rewritten
ar: يوجد هذا الملف للسماح لك بالتصفية مرة أخرى بدون -قوة ، ولتحديد أنه ينبغي تحديث ملفات البيانات الوصفية بدلاً من ذلك من إعادة كتابة
fa: این پرونده وجود دارد تا به شما امکان می دهد دوباره فیلتر کنید - و برای مشخص کردن اینکه پرونده های ابرداده باید در عوض به روز شوند بازنویسی شده
ru: Этот файл существует, чтобы позволить вам фильтровать снова без и указать, что вместо этого следует обновлять файлы метаданных переписано
tr: Bu dosya, -Force olmadan tekrar filtrelemenize izin vermek için var, ve bunun yerine meta veri dosyalarının güncellenmesi gerektiğini belirtmek için yeniden yazılmış

source: Error: fast-export failed; see above.
ar: خطأ: فشل التصدير السريع ؛ انظر أعلاه.
fa: خطا: سریع صادرات انجام نشد. به بالا مراجعه کنید.
ru: Ошибка: быстрый экспорт не удался; См. Выше.
tr: Hata: Hızlı ihraç başarısız oldu; yukarıya bakın.

source: Error: fast-import failed; see above.
ar: خطأ: فشل الاستيراد السريع ؛ انظر أعلاه.
fa: خطا: گزارش سریع انجام نشد. به بالا مراجعه کنید.
ru: Ошибка: быстрый импорт не удался; См. Выше.
tr: Hata: hızlı ithalat başarısız oldu; yukarıya bakın.

source: NOTE: Not running fast-import or cleaning up; --dry-run passed.
ar: ملاحظة: عدم تشغيل الاستيراد السريع أو التنظيف ؛ -مرر الجفرة.
fa: توجه: عدم اجرای سریع یا تمیز کردن ؛ -خشک شده گذشت.
ru: ПРИМЕЧАНИЕ: не работает быстро-импорт или уборка; -сухой бег прошел.
tr: Not: hızlı bir şekilde çalıştırılmamak veya temizlenmemek; -Dry-Run geçti.

source: Requested filtering can be seen by comparing:
ar: يمكن رؤية التصفية المطلوبة من خلال المقارنة:
fa: فیلتر درخواست شده را می توان با مقایسه مشاهده کرد:
ru: Запрашиваемое фильтрация можно увидеть путем сравнения:
tr: Talep edilen filtreleme şu karşılaştırılarak görülebilir:

source: Requested filtering can be seen at:
ar: يمكن رؤية التصفية المطلوبة على:
fa: فیلتر درخواست شده را می توان در:
ru: Запрашиваемое фильтрация можно увидеть по адресу:
tr: Talep edilen filtreleme şu şekilde görülebilir:

source: and LFS Objects Orphaned
ar: و LFS كائنات يتيمة
fa: و LFS اشیاء یتیم شده
ru: и LFS Objects Objected
tr: ve LFS nesneleri yetim kaldı

source: Aborted!
ar: مجهول!
fa: سقط کرد
ru: Убийся!
tr: Durduruldu!

source: Show this message and exit.
ar: أظهر هذه الرسالة والخروج.
fa: این پیام و خروج را نشان دهید.
ru: Покажите это сообщение и выйти.
tr: Bu mesajı göster ve çıkış.

source: Options
ar: خيارات
fa: گزینه
ru: Параметры
tr: Seçenekler

source: Commands
ar: الأوامر
fa: دستورات
ru: Команды
tr: Komutlar

source: Missing command.
ar: الأمر المفقود.
fa: فرمان گمشده
ru: Пропавшая команда.
tr: Eksik komut.

source: Value must be an iterable.
ar: يجب أن تكون القيمة موثوقة.
fa: ارزش باید یک تکرار باشد.
ru: Значение должно быть итерабильным.
tr: Değer yinelenebilir olmalıdır.

source: (dynamic)
ar: (متحرك)
fa: (پویا)
ru: (динамическая)
tr: (dinamik)

source: required
ar: مطلوب
fa: الزام
ru: необходимый
tr: gerekli

source: Show the version and exit.
ar: إظهار الإصدار والخروج.
fa: نسخه و خروج را نشان دهید.
ru: Показать версию и выйти.
tr: Sürümü gösterin ve çıkış.

source: Try '{command} {option}' for help.
ru: Попробуйте '{command} {option}' для помощи.
tr: Yardım için '{command} {option}' deneyin.

source: Missing argument
ar: حجة مفقودة
fa: استدلال گمشده
ru: Отсутствующий аргумент
tr: Eksik Argüman

source: Missing option
ar: خيار مفقود
fa: گزینه گمشده
ru: Отсутствующий вариант
tr: Eksik Seçenek

source: Missing parameter
ar: المعلمة المفقودة
fa: پارامتر از دست رفته
ru: Отсутствующий параметр
tr: Eksik parametre

source: Missing {param_type}
ar: مفقود {param_type}
fa: گمشده {param_type}
ru: Отсутствует {param_type}
tr: Eksik {param_type}

source: Missing parameter: {param_name}
ar: المعلمة المفقودة: {param_name}
fa: پارامتر گمشده: {param_name}
ru: Отсутствующий параметр: {param_name}
tr: Eksik parametre: {param_name}

source: No such option: {name}
ar: لا يوجد خيار من هذا القبيل: {name}
ru: Нет такого варианта: {name}
tr: Böyle bir seçenek yok: {name}

source: unknown error
ar: خطأ غير معروف
fa: خطای ناشناخته
ru: неизвестная ошибка
tr: Bilinmeyen hata

source: Shell completion is not supported for Bash versions older than 4.4.
ar: لا يتم دعم إكمال Shell لإصدارات Bash التي تزيد عن 4.4.
fa: تکمیل پوسته برای نسخه های Bash قدیمی تر از 4.4 پشتیبانی نمی شود.
ru: Завершение раковины не поддерживается для версий Bash старше 4,4.
tr: 4.4 yaşından büyük BASH sürümleri için kabuk tamamlama desteklenmez.

source: Couldn't detect Bash version, shell completion is not supported.
ar: لا يمكن اكتشاف نسخة باش ، لا يتم دعم إكمال شل.
fa: نمی توان نسخه Bash را تشخیص داد ، تکمیل پوسته پشتیبانی نمی شود.
ru: Не удалось обнаружить версию Bash, завершение Shell не поддерживается.
tr: BASH versiyonunu tespit edemedi, kabuk tamamlama desteklenmiyor.

source: Repeat for confirmation
ar: كرر للتأكيد
fa: برای تأیید تکرار کنید
ru: Повторите для подтверждения
tr: Onay için tekrarlayın

source: Error: The value you entered was invalid.
ar: خطأ: كانت القيمة التي أدخلتها غير صالحة.
fa: خطا: مقداری که وارد کردید نامعتبر بود.
ru: Ошибка: введенное вами значение было недействительным.
tr: Hata: Girdiğiniz değer geçersizdi.

source: Error: {e.message}
ar: خطأ: {e.message}
fa: خطا: {e.message}
ru: Ошибка: {e.message}

source: Error: The two entered values do not match.
ar: خطأ: لا تتطابق القيمتان المدخلتان.
fa: خطا: این دو مقدار وارد شده مطابقت ندارند.
ru: Ошибка: два введенных значения не совпадают.
tr: Hata: Girilen iki değer eşleşmez.

source: Error: invalid input
ar: خطأ: إدخال غير صالح
fa: خطا: ورودی نامعتبر
ru: Ошибка: неверный ввод
tr: Hata: Geçersiz giriş

source: Press any key to continue...
ar: اضغط على أي مفتاح للمتابعة ...
fa: برای ادامه ... هر کلید را فشار دهید ...
ru: Нажмите любую клавишу, чтобы продолжить ...
tr: Devam etmek için herhangi bir tuşa basın ...

source: file
ar: ملف
fa: پرونده
ru: файл
tr: dosya

source: directory
ar: دليل
fa: فهرست راهنما
ru: каталог
tr: dizin

source: path
ar: طريق
fa: مسیر
ru: путь
tr: yol

source: {name} '{filename}' is a directory.
ar: {name} '{filename}' هو دليل.
ru: {name} '{filename}' - это каталог.

source: Manifesto
ar: بيان
fa: مانیفست
ru: Манифест

source: Votes
ar: أصوات
fa: رأی
ru: Голоса
tr: Oy

source: Candidates for
ar: المرشحين ل
fa: داوطلبان برای
ru: Кандидаты для
tr: Adaylar

source: No candidates available.
ar: لا المرشحين متاحين.
fa: نامزدهای موجود در دسترس نیست.
ru: Нет кандидатов.
tr: Mevcut aday yok.

source: Thank you for voting!
ar: شكرا لك على التصويت!
fa: با تشکر از شما برای رای گیری!
ru: Спасибо за голосование!
tr: Oy verdiğiniz için teşekkürler!

source: Your vote has been successfully recorded.
ar: تم تسجيل تصويتك بنجاح.
fa: رأی شما با موفقیت ثبت شده است.
ru: Ваш голос был успешно записан.
tr: Oyunuz başarıyla kaydedildi.

source: No upcoming events.
ar: لا الأحداث القادمة.
fa: بدون رویداد آینده
tr: Yaklaşan etkinlik yok.

source: Number of filenames
ar: عدد أسماء الملفات
fa: تعداد نام پرونده ها
tr: Dosya adı sayısı

source: <toplevel>
tr: <Topelevel>

source: (Deprecated) {text}
ar: (تم إهماله) {text}
tr: (Kullanımdan kaldırılmış) {text}

source: URL
ar: عنوان URL

source: default: {default}
ar: الافتراضي: {default}

source: Error: {message}
ar: خطأ: {message}

source: Invalid value: {message}
ar: قيمة غير صالحة: {message}

source: Invalid value for {param_hint}: {message}
ar: قيمة غير صالحة لـ {param_hint}: {message}
