Repository: zahraadelbani/club-management-backup
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar, fa, ru, tr

source: Whether to prune empty commits. 'auto' (the default) means only prune commits which become empty (not commits which were empty in the original repo, unless their parent was pruned). When the parent of a commit is pruned, the first non-pruned ancestor becomes the new parent.
ar: سواء لتكوين الفراغ. "Auto" (الافتراضي) يعني فقط أن تقليم الالتزامات التي تصبح فارغة (وليس الالتزام والتي كانت فارغة في الريبو الأصلي ، ما لم يتم تقليم والديهم). عندما يتم تقليم والد الالتزام ، يصبح أول سلف غير مشترك الوالد الجديد.
fa: آیا برای هرس تعهدات خالی. "خودکار" (پیش فرض) فقط به معنای تعهدات هرس است که خالی می شود (تعهداتی که در repo اصلی خالی بود ، مگر اینکه پدر و مادرشان هرس شوند). هنگامی که پدر و مادر یک تعهد هرس می شوند ، اولین اجداد غیر مجاز به والدین جدید می شود.
ru: Будет ли обрезать пустые коммиты. «Авто» (по умолчанию) означает только коммерческие коммиты, которые становятся пустыми (не коммиты, которые были пусты в исходном репо, если только их родитель не обрезал). Когда родитель коммита обрезан, первый не сбитый предок становится новым родителем.
tr: Boş taahhütleri budamak. 'Auto' (varsayılan), yalnızca boş hale gelen budama taahhütleri anlamına gelir (ebeveynleri budama olmadıkça orijinal repoda boş olan taahhütler değil). Bir taahhüdün ebeveyni budama olduğunda, ilk budamasız ata yeni ebeveyn olur.

source: Since merge commits are needed for history topology, they are typically exempt from pruning. However, they can become degenerate with the pruning of other commits (having fewer than two parents, having one commit serve as both parents, or having one parent as the ancestor of the other.) If such merge commits have no file changes, they can be pruned. The default ('auto') is to only prune empty merge commits which become degenerate (not which started as such).
ar: نظرًا لأن هناك حاجة إلى Commits Commits لطوبولوجيا التاريخ ، فإنها عادة ما تكون معفاة من التقليم. ومع ذلك ، يمكن أن تتدهور مع تقليم الالتزامات الأخرى (وجود أقل من والدين ، أو الالتزام واحد بالآباء ، أو امتلاك أحد الوالدين كأسلاف للآخر.) إذا لم يكن لدى هذه الاندماج أي تغييرات في الملف ، فيمكن تقليمها. إن الافتراضي ("Auto") هو تقليم الدمج الفارغ فقط الذي يصبح متدهراً (وليس الذي بدأ على هذا النحو).
fa: از آنجا که تعهدات ادغام برای توپولوژی تاریخ لازم است ، آنها به طور معمول از هرس معاف هستند. با این حال ، آنها می توانند با هرس سایر تعهدات (داشتن کمتر از دو والدین ، ​​داشتن یک تعهد به عنوان والدین یا داشتن یک والدین به عنوان اجداد دیگر ، دچار انحطاط شوند.) اگر چنین تعهداتی هیچ تغییری در پرونده نداشته باشد ، می توانند هرس شوند. پیش فرض ("خودکار") فقط هرس تعهدات ادغام خالی است که منحرف می شوند (نه که به همین ترتیب آغاز شد).
ru: Поскольку для топологии истории необходимы коммиты Merge, они обычно освобождаются от обрезки. Тем не менее, они могут выродиться с обрезкой других коммитов (имея менее двух родителей, имея один коммит, служащий обоим родителями или иметь одного родителя в качестве предка другого.) Если такие слияния не имеют изменений в файле, их можно обрезать. По умолчанию ('Auto') состоит только на том, чтобы обрезать только пустые коммиты, которые становятся вырожденными (не началось как таковое).
tr: Tarih topolojisi için birleştirme taahhütlerine ihtiyaç duyulduğundan, genellikle budamadan muaftırlar. Bununla birlikte, diğer taahhütlerin budaması ile dejenere olabilirler (iki ebeveynden daha azına sahip olmak, her iki ebeveyn olarak hizmet etmek veya diğerinin atası olarak bir ebeveyni olmak). Varsayılan ('otomatik') yalnızca dejenere olan (bu şekilde başlamayan) boş birleştirme taahhütlerini budamaktır.

source: Even if the first parent is or becomes an ancestor of another parent, do not prune it. This modifies how --prune-degenerate behaves, and may be useful in projects who always use merge --no-ff.
ar: حتى لو كان الوالد الأول أو يصبح سلفًا لوالد آخر ، فلا تقطعه. هذا يعدل كيف-تتصرف degenerate ، وقد يكون مفيدًا في المشاريع التي تستخدم دائمًا دمج-لا.
fa: حتی اگر پدر و مادر اول اجداد پدر و مادر دیگری باشند ، آن را هرس نکنید. این اصلاح می کند که چگونه--Degenerate رفتار می کند ، و ممکن است در پروژه هایی که همیشه از ادغام استفاده می کنند-NO-FF مفید باشد.
ru: Даже если первым родителем является или становится предком другого родителя, не обжаривайте его. Это изменяет, как ведет себя-Prune Degenerate, и может быть полезно в проектах, которые всегда используют Merge-нет.
tr: İlk ebeveyn başka bir ebeveynin atası olsa veya olsa bile, onu budamayın. Bu, --pune-degenerate'in nasıl davrandığını değiştirir ve her zaman birleştirme-no-ff kullanan projelerde yararlı olabilir.

source: Generic callback code snippets
ar: قصاصات رمز رد الاتصال العام
fa: قطعه کد پاسخگویی عمومی
ru: Общие фрагменты кода обратного вызова
tr: Genel Geri Arama Kodu Snippets

source: Python code body for processing filenames; see CALLBACKS sections below.
ar: بيثون كود هيكل لمعالجة أسماء الملفات ؛ انظر أقسام عمليات الاسترجاع أدناه.
fa: بدنه کد پایتون برای پردازش نام های پرونده ؛ بخش های تماس تلفنی را در زیر مشاهده کنید.
ru: Корпус кода Python для обработки имен файлов; См. Разделы обратных вызовов ниже.
tr: Dosya adlarını işlemek için Python kod gövdesi; Aşağıdaki geri arama bölümlerine bakın.

source: Python code body for processing file and metadata; see CALLBACKS sections below.
ar: Python Code Body لمعالجة الملفات والبيانات الوصفية ؛ انظر أقسام عمليات الاسترجاع أدناه.
fa: بدنه کد پایتون برای پردازش پرونده و ابرداده ؛ بخش های تماس تلفنی را در زیر مشاهده کنید.
ru: Корпус кода Python для обработки файла и метаданных; См. Разделы обратных вызовов ниже.
tr: Dosya ve meta verileri işleme için Python kod gövdesi; Aşağıdaki geri arama bölümlerine bakın.

source: Python code body for processing messages (both commit messages and tag messages); see CALLBACKS section below.
ar: Bython Code Body لمعالجة الرسائل (تلتزم الرسائل ورسائل العلامات) ؛ انظر قسم عمليات الاسترجاع أدناه.
fa: بدنه کد پایتون برای پردازش پیام (هم پیام های متعهد و هم پیام های برچسب) ؛ به بخش تماسهای برگشتی در زیر مراجعه کنید.
ru: Корпус кода Python для обработки сообщений (как сообщений, так и сообщений тегов); См. Раздел обратных вызовов ниже.
tr: Mesajları işlemek için Python kod gövdesi (hem işleme mesajları hem de etiket mesajları); Aşağıdaki geri arama bölümüne bakın.

source: Python code body for processing names of people; see CALLBACKS section below.
ar: بيثون كود هيئة لمعالجة أسماء الناس ؛ انظر قسم عمليات الاسترجاع أدناه.
fa: بدن کد پایتون برای پردازش نام افراد ؛ به بخش تماسهای برگشتی در زیر مراجعه کنید.
ru: Код Python для обработки имен людей; См. Раздел обратных вызовов ниже.
tr: İnsanların adlarını işlemek için Python kod gövdesi; Aşağıdaki geri arama bölümüne bakın.

source: Python code body for processing emails addresses; see CALLBACKS section below.
ar: هيئة رمز Python لمعالجة عناوين رسائل البريد الإلكتروني ؛ انظر قسم عمليات الاسترجاع أدناه.
fa: بدنه کد پایتون برای پردازش آدرس های ایمیل ؛ به بخش تماسهای برگشتی در زیر مراجعه کنید.
ru: Bython Code Body для обработки адресов электронных писем; См. Раздел обратных вызовов ниже.
tr: E -postaların adreslerini işlemek için Python kod gövdesi; Aşağıdaki geri arama bölümüne bakın.

source: Python code body for processing refnames; see CALLBACKS section below.
ar: بيثون كود هيئة لمعالجة الأسماء ؛ انظر قسم عمليات الاسترجاع أدناه.
fa: بدنه کد پایتون برای پردازش بازپرداختها ؛ به بخش تماسهای برگشتی در زیر مراجعه کنید.
ru: Корпус кода Python для обработки RefNames; См. Раздел обратных вызовов ниже.
tr: Refnames'i işlemek için Python kod gövdesi; Aşağıdaki geri arama bölümüne bakın.

source: Python code body for processing blob objects; see CALLBACKS section below.
ar: بيثون رمز الجسم لمعالجة كائنات النقطة ؛ انظر قسم عمليات الاسترجاع أدناه.
fa: بدن کد پایتون برای پردازش اشیاء حباب ؛ به بخش تماسهای برگشتی در زیر مراجعه کنید.
ru: Корпус кода Python для обработки объектов Blob; См. Раздел обратных вызовов ниже.
tr: Blob nesnelerini işlemek için Python kod gövdesi; Aşağıdaki geri arama bölümüne bakın.

source: Python code body for processing commit objects; see CALLBACKS section below.
ar: بيثون كود هيئة لمعالجة كائنات الالتزام ؛ انظر قسم عمليات الاسترجاع أدناه.
fa: بدن کد پایتون برای پردازش اشیاء متعهد ؛ به بخش تماسهای برگشتی در زیر مراجعه کنید.
ru: Корпус кода Python для обработки объектов совершения; См. Раздел обратных вызовов ниже.
tr: Taahhüt nesnelerini işlemek için Python kod gövdesi; Aşağıdaki geri arama bölümüne bakın.

source: Python code body for processing tag objects. Note that lightweight tags have no tag object and are thus not handled by this callback. See CALLBACKS section below.
ar: بيثون رمز الجسم لمعالجة كائنات علامة. لاحظ أن العلامات الخفيفة لا تحتوي على كائن علامة وبالتالي لا يتم التعامل معها بواسطة رد الاتصال هذا. انظر قسم عمليات الاسترجاع أدناه.
fa: بدنه کد پایتون برای پردازش اشیاء برچسب. توجه داشته باشید که برچسب های سبک وزن شیء برچسب ندارند و از این رو با این پاسخ به تماس نیستند. به بخش تماسهای برگشتی در زیر مراجعه کنید.
ru: Корпус кода Python для обработки объектов тега. Обратите внимание, что легкие теги не имеют объекта тегов и, таким образом, не обрабатываются этим обратным вызовом. См. Раздел обратных вызовов ниже.
tr: Etiket nesnelerini işlemek için Python kod gövdesi. Hafif etiketlerin etiket nesnesi olmadığını ve bu nedenle bu geri arama ile ele alınmadığını unutmayın. Aşağıdaki geri arama bölümüne bakın.

source: Python code body for processing reset objects; see CALLBACKS section below.
ar: بيثون كود هيئة معالجة الكائنات إعادة تعيين الكائنات ؛ انظر قسم عمليات الاسترجاع أدناه.
fa: بدنه کد پایتون برای پردازش تنظیم مجدد اشیاء ؛ به بخش تماسهای برگشتی در زیر مراجعه کنید.
ru: Корпус кода Python для обработки объектов сброса; См. Раздел обратных вызовов ниже.
tr: Sıfırlama nesnelerini işlemek için Python kod gövdesi; Aşağıdaki geri arama bölümüne bakın.

source: Sensitive Data Removal Handling
ar: معالجة إزالة البيانات الحساسة
fa: دست زدن به حذف داده های حساس
ru: Обработка конфиденциальной обработки данных
tr: Hassas Veri Kaldırma İşleme

source: This rewrite is intended to remove sensitive data from a repository. Gather extra information from the rewrite needed to provide additional instructions on how to clean up other copies.
ar: تهدف إعادة الكتابة هذه إلى إزالة البيانات الحساسة من مستودع. جمع معلومات إضافية من إعادة الكتابة اللازمة لتوفير تعليمات إضافية حول كيفية تنظيف نسخ أخرى.
fa: این بازنویسی برای حذف داده های حساس از یک مخزن در نظر گرفته شده است. جمع آوری اطلاعات اضافی از بازنویسی مورد نیاز برای ارائه دستورالعمل های اضافی در مورد نحوه تمیز کردن نسخه های دیگر.
ru: Это переписывание предназначено для удаления конфиденциальных данных из репозитория. Соберите дополнительную информацию из переписывания, необходимой для предоставления дополнительных инструкций о том, как очистить другие копии.
tr: Bu yeniden yazma, hassas verileri bir depodan kaldırmayı amaçlamaktadır. Diğer kopyaların nasıl temizleneceği konusunda ek talimatlar sağlamak için gereken yeniden yazma işleminden ekstra bilgi toplayın.

source: By default, --sensitive-data-removal will trigger a mirror-like fetch of all refs from origin, discarding local changes, but ensuring that _all_ fetchable refs that hold on to the sensitve data are rewritten. This flag removes that fetch, risking that other refs continue holding on to the sensitive data. This option is implied by --partial or any flag that implies --partial.
ar: بشكل افتراضي ،-سيؤدي إزالة الإزالة الحساسة للإصابة بإحضار جلب يشبه المرآة لجميع الحكام من الأصل ، مع التخلص من التغييرات المحلية ، ولكن التأكد من إعادة كتابة _all_ refs القابلة للتمسك بالبيانات الحسية. يزيل هذا العلم هذا الجلب ، ويخاطر بمواصلة الحكام الأخرى على التمسك بالبيانات الحساسة. هذا الخيار ضمني بواسطة -Partial أو أي علامة ينطوي عليها -Partial.
fa: به طور پیش فرض ،-تنظیم مجدد داده های حساس ، باعث ایجاد یک آینه مانند همه Refs از مبدأ می شود و تغییرات محلی را دور می کند ، اما اطمینان از اینکه _all_ واکشی قابل استفاده در داده های حساس بازنویسی می شود. این پرچم این واکشی را حذف می کند ، و این خطر را دارد که سایر موارد دیگر به داده های حساس ادامه دهند. این گزینه توسط هر پرچم یا هر پرچمی که دلالت بر این دارد -به معنای خاص است.
ru: По умолчанию-чувствительный дефект-дата-удаление запускает зеркальное магистраль всех ссылок из происхождения, отбрасывая локальные изменения, но гарантируя, что _all_ Fetchable Refs, которые держатся на данные Sensitve, переписаны. Этот флаг удаляет это, рискуя тем, что другие ссылки продолжают удерживать конфиденциальные данные. Этот вариант подразумевается -частный или любой флаг, который подразумевает -частный.
tr: Varsayılan olarak,-duyarlı veri kaldırma, tüm referansların ayna benzeri bir getirisini, yerel değişiklikleri atarak, ancak duyusal verilere dayanan _all_ getirilebilir referansların yeniden yazılmasını sağlayacaktır. Bu bayrak, diğer referansların hassas verilere sahip olmaya devam etmesi riskini alarak getirir. Bu seçenek --partial veya --partial ima eden herhangi bir bayrak tarafından ima edilir.

source: Specifying alternate source or target locations implies --partial, except that the normal default for --replace-refs is used. However, unlike normal uses of --partial, this doesn't risk mixing old and new history since the old and new histories are in different repositories.
ar: توضيح تحديد المواقع البديلة أو المواقع المستهدفة -Partial ، باستثناء أنه يتم استخدام الافتراضي العادي--REPLACE-REFs. لكن، على عكس الاستخدامات العادية -Partial ، فإن هذا لا يخاطر بخلط قديم وجديد التاريخ منذ التواريخ القديمة والجديدة في مستودعات مختلفة.
fa: مشخص کردن مکانهای منبع جایگزین یا هدف به معنای -حزبی ، به جز اینکه پیش فرض معمولی برای-Ref-Refs استفاده می شود. با این حال ، بر خلاف استفاده های عادی از -حزبی ، این خطر مخلوط قدیمی و جدید را ندارد تاریخ از تاریخ های قدیمی و جدید در مخازن مختلف قرار دارد.
ru: Указание альтернативных местоположений источника или целевых За исключением того, что используется обычное дефолт для-Replace-Refs. Однако, В отличие от обычного использования -частично, это не рискует смешивать старые и новые История, так как старая и новая история находится в разных репозиториях.
tr: Alternatif kaynak veya hedef konumları belirlemek -bölümsel, hariç-replace-refs için normal varsayılan kullanılır. Fakat, -Parteriyel normal kullanımlarından farklı olarak, bu eski ve yeni karıştırmak riskiyle karşı karşıya kalmaz. Tarih Eski ve yeni tarihler farklı depolardadır.

source: Location to filter from/to
ar: موقع للتصفية من/إلى
fa: مکان برای فیلتر کردن از/به
ru: Место для фильтрации от/до
tr: /To filtre için konum

source: Git repository to read from
ar: مستودع GIT للقراءة من
fa: مخزن git برای خواندن
ru: Git репозиторий для чтения из
tr: Git deposundan okunacak

source: Git repository to overwrite with filtered history
ar: مستودع GIT للكتابة مع التاريخ المصفى
fa: مخزن git برای بازنویسی با تاریخچه فیلتر شده
ru: Git Repository, чтобы перезаписать фильтрованной историей
tr: Git deposu filtrelenmiş geçmişle üzerine yazacak

source: Ordering of commits
ar: ترتيب الالتزامات
fa: سفارش تعهدات
ru: Заказа коммитов
tr: Taahhütlerin Siparişi

source: Processes commits in commit timestamp order.
ar: العمليات ترتكب في ارتكاب طابع زمني.
fa: تعهدات فرآیند به ترتیب Timestamp.
ru: Процессы совершают в заказе временной метки.
tr: Süreçler zaman damgası düzeninde taahhüt eder.

source: Miscellaneous options
ar: خيارات متنوعة
fa: گزینه های متفرقه
ru: Разные варианты
tr: Çeşitli Seçenekler

source: Show this help message and exit.
ar: أظهر رسالة المساعدة والخروج.
fa: این پیام راهنما را نشان دهید و خروج کنید.
ru: Покажите это сообщение справки и выход.
tr: Bu yardım mesajını ve çıkışını gösterin.

source: Display filter-repo's version and exit.
ar: عرض مرشح REPO والخروج.
fa: نسخه Filter-Repo را نمایش داده و خروج کنید.
ru: Отобразить версию фильтра-репо и выход.
tr: Filtre-Repo'nun sürümünü ve çıkışını görüntüleyin.

source: Avoid triggering the no-arguments-specified check.
ar: تجنب تشغيل الشيك المحدد.
fa: از ایجاد چک مشخص شده بدون آرگومان خودداری کنید.
ru: Избегайте запуска проверки без аргументов.
tr: Argümanların belirtilmemiş kontrolünü tetiklemekten kaçının.

source: Rewrite repository history even if the current repo does not look like a fresh clone. History rewriting is irreversible (and includes immediate pruning of reflogs and old objects), so be cautious about using this flag.
ar: أعد كتابة تاريخ المستودع حتى لو لم يكن الريبو الحالي وكأنه استنساخ جديد. إعادة كتابة التاريخ لا رجعة فيها (وتتضمن تقليمًا فوريًا للأشياء القديمة والأشياء القديمة) ، لذا كن حذرًا في استخدام هذا العلم.
fa: تاریخچه مخزن را بازنویسی کنید حتی اگر repo فعلی مانند یک کلون تازه به نظر نرسد. بازنویسی تاریخ برگشت ناپذیر است (و شامل هرس فوری بازتاب ها و اشیاء قدیمی) ، بنابراین در مورد استفاده از این پرچم محتاط باشید.
ru: Перепишите историю хранилища, даже если текущее репо не похоже на свежий клон. Переписывание истории необратимо (и включает в себя немедленную обрезку рефрог и старых объектов), поэтому будьте осторожны с использованием этого флага.
tr: Mevcut repo yeni bir klon gibi görünmese bile depo geçmişini yeniden yazın. Tarihin yeniden yazılması geri döndürülemezdir (ve yerinden ve eski nesnelerin derhal budamasını içerir), bu yüzden bu bayrağı kullanma konusunda dikkatli olun.

source: Do a partial history rewrite, resulting in the mixture of old and new history. This disables rewriting refs/remotes/origin/* to refs/heads/*, disables removing of the 'origin' remote, disables removing unexported refs, disables expiring the reflog, and disables the automatic post-filter gc. Also, this modifies --tag-rename and --refname-callback options such that instead of replacing old refs with new refnames, it will instead create new refs and keep the old ones around. Use with caution.
ar: قم بإعادة كتابة التاريخ الجزئي ، مما أدى إلى مزيج من التاريخ القديم والجديد. تعطيل هذا يعطل إعادة كتابة REFS/REMOTES/Origin/* إلى REFS/Heads/* ، يعطل إزالة "الأصل" عن بُعد ، ويعطل إزالة REFS غير المبرر ، واضطراب الصلاحية ، واضطراب GC بعد المرشح التلقائي. وأيضًا ، يعدل هذا-خيارات Tag-Triname و-REFNAME-Callback بحيث بدلاً من استبدال الحكام القديمة بأسماء جديدة ، فإنها ستنشئ بدلاً من ذلك مرجعًا جديدًا والحفاظ على تلك القديمة. استخدم بحذر.
fa: یک تاریخچه جزئی را بازنویسی کنید و در نتیجه ترکیبی از تاریخ قدیمی و جدید باشد. این امر بازنویسی Rewrating Refs/Remotes/Origin/* به refs/heads/* ، از بین بردن از راه دور "مبدا" غیرفعال می شود ، از بین بردن Refs های نامشخص ، غیرفعال می شود ، بازتاب را غیرفعال می کند و از GC اتوماتیک پس از فیلتر غیرفعال می کند. همچنین ، این گزینه ها را تغییر می دهد-نامگذاری و-نامگذاری گزینه های-تماس با نام به گونه ای که به جای جایگزینی Refs قدیمی با نام های جدید ، در عوض باعث ایجاد مجدد جدید می شود و موارد قدیمی را در اطراف خود نگه می دارد. با احتیاط استفاده کنید.
ru: Перепишите частичную историю, что приводит к смесью старой и новой истории. Это отключает переписывание Refs/Remotes/Origin/* до ссылки/головы/*, отключает удаление удаленного «происхождения», отключает удаление неожиданных ссылок, отключает срок действия регулировки и отключает автоматический GC после фильтра. Кроме того, это изменяет варианты-Tag-rename и-refname-callback, так что вместо замены старых ссылок новыми рефонарами вместо этого создают новые ссылки и сохранили старые. Использовать с осторожностью.
tr: Kısmi bir tarih yapın, eski ve yeni tarihin karışımı ile sonuçlanır. Bu, Refs/Remotes/** 'a Refs/Heads/*' a yeniden yazma devre dışı bırakır, 'orijin' uzaktan kaldırılmasını devre dışı bırakır, istikrarsız referansları kaldırmayı devre dışı bırakır, reflogu süresi doldurmakta ve otomatik filtre sonrası GC'yi devre dışı bırakır. Ayrıca,--tag-rename ve --refname-callback seçeneklerini, eski referansları yeni refnames ile değiştirmek yerine yeni referanslar oluşturacak ve eskilerini tutacak şekilde değiştirir. Dikkatle kullanın.

source: Do not run 'git gc' after filtering.
ar: لا تقم بتشغيل "Git GC" بعد التصفية.
fa: بعد از فیلتر "Git GC" را اجرا نکنید.
ru: Не запускайте «git gc» после фильтрации.
tr: Filtrelemeden sonra 'GIT GC' çalıştırmayın.

source: Limit history rewriting to the specified refs. Implies --partial. In addition to the normal caveats of --partial (mixing old and new history, no automatic remapping of refs/remotes/origin/* to refs/heads/*, etc.), this also may cause problems for pruning of degenerate empty merge commits when negative revisions are specified.
ar: الحد من إعادة كتابة التاريخ إلى الحكام المحددة. يعني -Partial. بالإضافة إلى التحذيرات العادية لـ -Partial (مزج التاريخ القديم والجديد ، لا يوجد أي إعادة تلقائي للرقص/عن بعد/الأصل/* إلى المراجع/الرؤوس/* ، إلخ) ، قد يتسبب هذا أيضًا في تشذيب الاندماج الفارغ المتدهور عند تحديد المراجعات السلبية.
fa: بازنویسی تاریخ را به Refs مشخص شده محدود کنید. دلالت دارد -حزبی. علاوه بر احتیاط های طبیعی -حزبی (مخلوط کردن تاریخ قدیمی و جدید ، بدون بازسازی خودکار از Refs/Remotes/Origin/* به Refs/Heads/* و غیره) ، این همچنین ممکن است در هنگام مشخص شدن اصلاحات منفی ، برای هلال تعهدات ادغام خالی ایجاد شود.
ru: Ограничение истории переписывания в указанных ссылках. Подразумевает -частный. В дополнение к нормальным предостережениям -частично (смешивание старой и новой истории, отсутствие автоматического перенастроения ссылок/пульт/происхождение/* до ссылки/головы/* и т. Д.), Это также может вызвать проблемы для обрезки дегенерации пустых слияний при указании отрицательных изменений.
tr: Geçmişin yeniden yazılmasını belirtilen referanslarla sınırlandırın. -bölümsel. --Parteryal (eski ve yeni geçmişi karıştıran, refs/uzaktan/orijin/** refs/heads/* vb.

source: Do not change the repository. Run `git fast-export` and filter its output, and save both the original and the filtered version for comparison. This also disables rewriting commit messages due to not knowing new commit IDs and disables filtering of some empty commits due to inability to query the fast-import backend.
ar: لا تغير المستودع. قم بتشغيل `Git Fast-Export" وقم بتصفية إخراجها ، وحفظ الإصدار الأصلي والمرشح للمقارنة. يؤدي هذا أيضًا إلى تعطيل إعادة كتابة الرسائل بسبب عدم معرفة معرفات الالتزام الجديدة وتعطيل تصفية بعض الالتزامات الفارغة بسبب عدم القدرة على الاستعلام عن الخلفية السريعة.
fa: مخزن را تغییر ندهید. "Git Fast-Export" را اجرا کنید و خروجی آن را فیلتر کنید و نسخه اصلی و فیلتر شده را برای مقایسه ذخیره کنید. این امر همچنین به دلیل عدم دانستن شناسه های جدید متعهد ، بازنویسی پیام های متعهد را غیرفعال می کند و فیلتر برخی از تعهدات خالی را به دلیل عدم توانایی در پرس و جو از پس زمینه سریع وارد می کند.
ru: Не меняйте хранилище. Запустите `Git Fast-Export` и отфильтровайте его вывод, и сохраните как оригинальную, так и отфильтрованную версию для сравнения. Это также отключает переписывание сообщений о коммите из-за того, что не знает новых идентификаторов коммита и отключает фильтрацию некоторых пустых коммитов из-за неспособности запросить бэкэнд с быстрым импортом.
tr: Depoyu değiştirmeyin. `Git hızlı ihraç 'çalıştırın ve çıkışını filtreleyin ve karşılaştırma için hem orijinal hem de filtrelenmiş versiyonu kaydedin. Bu aynı zamanda yeni taahhüt kimliklerini bilmemesi nedeniyle yeniden yazmayı devre dışı bırakır ve hızlı ithal arka uçını sorgulayamama nedeniyle bazı boş taahhütlerin filtrelemesini devre dışı bırakır.

source: Print additional information about operations being performed and commands being run. When used together with --dry-run, also show extra information about what would be run.
ar: طباعة معلومات إضافية حول العمليات التي يتم تنفيذها وتشغيل الأوامر. عند استخدامها مع-الجفاف ، قم أيضًا بإظهار معلومات إضافية حول ما سيتم تشغيله.
fa: اطلاعات اضافی را در مورد عملیات انجام شده و دستورات اجرا کنید. هنگامی که در کنار هم استفاده می شود-خشک ، همچنین اطلاعات اضافی در مورد آنچه اجرا می شود نشان می دهد.
ru: Распечатайте дополнительную информацию об выполнении операций и выполняемых командах. При использовании вместе с-Dry-Run также покажите дополнительную информацию о том, что будет запускать.
tr: Gerçekleştirilen işlemler ve çalıştırılan komutlar hakkında ek bilgiler yazdırın. --Dry-Run ile birlikte kullanıldığında, neyin çalıştırılacağı hakkında ekstra bilgi de gösterin.
