Repository: zahraadelbani/club-management-backup
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar, fa, ru, tr

source: Error: unexpected `git cat-file` output: "%s"
ru: Ошибка: неожиданный `git cat-file` wonut: "%s"
tr: Hata: Beklenmedik `` git kedi-file 'çıktı: "%s"

source: Error: --path-rename expects one colon in its argument: <old_name:new_name>.
ar: خطأ:--مسار RENAME يتوقع قولون واحد في وسيطته: <old_name: new_name>.
fa: خطا:--پی-رن نام از یک روده بزرگ در استدلال خود انتظار دارد: <old_name: new_name>.
ru: Ошибка:-Path-rename ожидает одну толстую кишку в своем аргументе: <Old_name: new_name>.
tr: Hata: ---path-Rename, argümanında bir kolon bekliyor: <Old_name: new_name>.

source: Error: With --path-rename, if OLD_NAME and NEW_NAME are both non-empty and either ends with a slash then both must.
ar: خطأ: مع-المسار القوي ، إذا كان Old_Name و New_Name غير فارغين وينتهي إما بقطع مائل ، فيجب على كلاهما.
fa: خطا: با--path-rename ، اگر old_name و new_name هم غیر خالی باشند و یا با یک برش به پایان می رسند ، هر دو باید.
ru: Ошибка: с--path-rename, если Old_name и New_name оба не являются пустыми, и любой заканчивается с помощью чернила, то оба должны.
tr: Hata: ---path-rename ile, Old_Name ve New_Name hem boş değilse hem de bir eğik çizgi ile bitiyorsa, her ikisi de gerekir.

source: Error: Pathnames cannot begin with a '/'
ar: خطأ: لا يمكن أن تبدأ أسماء المسارات بـ '/'
fa: خطا: Pathnames نمی تواند با '/' شروع شود
ru: Ошибка: PathNames не может начаться с '/'
tr: Hata: Yol adları '/' ile başlayamaz

source: Error: Invalid path component '%s' found in '%s'
ru: Ошибка: неверный компонент пути '%s' найдено в '%s'
tr: Hata: '%s'de bulunan geçersiz yol bileşeni'%s '

source: Error: HelperFilter given invalid option_string: %s
ru: Ошибка: helperfilter, данный недопустимый Option_String: %s
tr: Hata: HelperFilter Gesi Geçersiz Option_String: %s

source: Rewrite (or analyze) repository history git-filter-repo destructively rewrites history (unless --analyze or --dry-run are given) according to specified rules. It refuses to do any rewriting unless either run from a clean fresh clone, or --force was given. Basic Usage: git-filter-repo --analyze git-filter-repo [FILTER/RENAME/CONTROL OPTIONS] See EXAMPLES section for details.
ar: إعادة كتابة (أو تحليل) تاريخ المستودع يعيد ترشيح Git-Filter-Repo إعادة كتابة التاريخ (ما لم يكن-تحليل أو -يتم إعطاء الجفاف) وفقًا للقواعد المحددة. يرفض القيام بأي شيء إعادة الكتابة ما لم يكن إما الركض من استنساخ طازج نظيف ، أو -القوة كان منح. الاستخدام الأساسي: Git-Filter-Repo-تحليل Git-Filter-Repo [خيارات التصفية/إعادة تسمية/التحكم] انظر قسم الأمثلة للحصول على التفاصيل.
fa: تاریخچه مخزن را بازنویسی کنید (یا تجزیه و تحلیل کنید) Git-Filter-Repo به طور مخرب تاریخ را بازنویسی می کند (مگر -خشک اجرا شده) طبق قوانین مشخص شده. از انجام هر کاری امتناع می ورزد بازنویسی مگر اینکه از یک کلون تازه تمیز فرار کنید ، یا - داده شده استفاده اساسی: Git-Filter-Repo-آنالیز Git-Filter-Repo [گزینه های فیلتر/تغییر نام/کنترل] برای جزئیات بیشتر به بخش مثالها مراجعه کنید.
ru: Переписать (или анализировать) историю репозитория git-filter-repo destructuvity переписывает историю (если-аналич -Dry-Run даны) в соответствии с указанными правилами. Он отказывается делать что -либо переписывание, если ни вы не берут от чистого свежего клона, ни - данный. Основное использование: git-filter-repo-анализ git-filter-repo [Filter/rename/параметры управления] Смотрите раздел примеров для деталей.
tr: Depo geçmişini yeniden yazın (veya analiz edin) Git-Filter-Repo, tarihi yıkıcı bir şekilde yeniden yazar (- -Dry-run verilir) belirtilen kurallara göre. Herhangi birini yapmayı reddediyor Temiz bir taze klondan kaçmadıkça yeniden yazma veya - verilen. Temel Kullanım: Git-Filter-Repo-Analyze Git-Filter-Repo [filtre/yeniden adlandır/kontrol seçenekleri] Ayrıntılar için Örnekler bölümüne bakın.

source: CALLBACKS Most callback functions are of the same general format. For a command line argument like --foo-callback 'BODY' the following code will be compiled and called: def foo_callback(foo): BODY The exception on callbacks is the --file-info-callback, which will be discussed further below. Given the callback style, we can thus make a simple callback to replace 'Jon' with 'John' in author/committer/tagger names: git filter-repo --name-callback 'return name.replace(b"Jon", b"John")' To remove all 'Tested-by' tags in commit (or tag) messages: git filter-repo --message-callback 'return re.sub(br"\nTested-by:.*", "", message)' To remove all .DS_Store files: git filter-repo --filename-callback 'return None if os.path.basename(filename) == b".DS_Store" else filename' Note that if BODY resolves to a filename, then the contents of that file will be used as the BODY in the callback function. The --file-info-callback has a more involved function callback; for it the following code will be compiled and called: def file_info_callback(filename, mode, blob_id, value): BODY It is designed to be used in cases where filtering depends on both filename and contents (and maybe mode). It is called for file changes other than deletions (since deletions have no file contents to operate on). This callback is expected to return a tuple of (filename, mode, blob_id). It can make use of the following functions from the value instance: value.get_contents_by_identifier(blob_id) -> contents (bytestring) value.get_size_by_identifier(blob_id) -> size_of_blob (int) value.insert_file_with_contents(contents) -> blob_id value.is_binary(contents) -> bool value.apply_replace_text(contents) -> new_contents (bytestring) and can read/write the following data member from the value instance: value.data (dict) The filename can be used for renaming the file similar to --filename-callback (or None to drop the change), and mode is one of b'100644', b'100755', b'120000', or b'160000'. For more detailed examples and explanations AND caveats, see https://htmlpreview.github.io/?https://github.com/newren/git-filter-repo/blob/docs/html/git-filter-repo.html#CALLBACKS EXAMPLES To get a bunch of reports mentioning renames that have occurred in your repo and listing sizes of objects aggregated by any of path, directory, extension, or blob-id: git filter-repo --analyze (These reports can help you choose how to filter your repo; it can be useful to re-run this command after filtering to regenerate the report and verify the changes look correct.) To extract the history that touched just 'guides' and 'tools/releases': git filter-repo --path guides/ --path tools/releases To remove foo.zip and bar/baz/zips from every revision in history: git filter-repo --path foo.zip --path bar/baz/zips/ --invert-paths To replace the text 'password' with 'p455w0rd': git filter-repo --replace-text <(echo "password==>p455w0rd") To use the current version of the .mailmap file to update authors, committers, and taggers throughout history and make it permanent: git filter-repo --use-mailmap To extract the history of 'src/', rename all files to have a new leading directory 'my-module' (e.g. src/foo.java -> my-module/src/foo.java), and add a 'my-module-' prefix to all tags: git filter-repo --path src/ --to-subdirectory-filter my-module --tag-rename '':'my-module-' For more detailed examples and explanations, see https://htmlpreview.github.io/?https://github.com/newren/git-filter-repo/blob/docs/html/git-filter-repo.html#EXAMPLES
ar: عمليات الاسترجاعات معظم وظائف رد الاتصال من نفس التنسيق العام. لخط الأوامر حجة مثل -جسم "جسم" سيتم تجميع الرمز التالي ودعا: def foo_callback (FOO): جسم الاستثناء من عروض الاسترجاعات هو--File-Info-Callback ، والذي سيكون ناقش المزيد أدناه. بالنظر إلى نمط رد الاتصال ، يمكننا بالتالي إجراء رد اتصال بسيط لاستبداله "جون" مع "جون" في أسماء المؤلف/الالتزام/التاجير: git filter-repo-name-callback 'return name.replace (B "Jon" ، B "John") " لإزالة جميع علامات "اختبارها" في رسائل الالتزام (أو العلامة): git filter-repo-message-callback 'return re.sub (br "\ ntested-by:.*" ، "" ، message) " لإزالة جميع ملفات .DS_STORE: GIT Filter-Repo-Filename-Callback 'Return none if OS.Path.basename (filename) == B ".DS_STORE" لاحظ أنه إذا حل الجسم إلى اسم ملف ، فإن محتويات هذا الملف سيتم استخدامها كجسم في وظيفة رد الاتصال. يحتوي -File-Info-Callback على رد اتصال أكثر تشاركًا ؛ لأنها سيتم تجميع الكود التالي ودعا: def file_info_callback (اسم الملف ، الوضع ، blob_id ، القيمة): جسم تم تصميمه ليتم استخدامه في الحالات التي يعتمد فيها التصفية على كليهما اسم الملف والمحتويات (وربما الوضع). يطلق عليه تغيير الملفات بخلاف الحذف (نظرًا لأن عمليات الحذف لا تحتوي على محتويات ملفات للعمل على). من المتوقع أن يعيد رد الاتصال هذا توب (اسم الملف ، الوضع ، blob_id). يمكن أن يستفيد من الوظائف التالية من القيمة مثال: value.get_contents_by_identifier (blob_id) -> محتويات (بايت) value.get_size_by_identifier (blob_id) -> size_of_blob (int) value.insert_file_with_contents (محتويات) -> blob_id value.is_binary (محتويات) -> Bool value.apply_replace_text (محتويات) -> new_contents (bytestring) ويمكنه قراءة/كتابة عضو البيانات التالي من مثيل القيمة: value.data (DICT) يمكن استخدام اسم الملف لإعادة تسمية الملف مماثل -Filename-Callback (أو لا شيء لإسقاط التغيير) ، والوضع واحد of B'100644 '، B'100755' ، B'120000 '، أو B'160000'. للحصول على المزيد من الأمثلة والتفسيرات والتحذيرات ، انظر https://htmlpreview.github.io/؟https://github.com/newren/git-filter-repo/blob/docs/html/git-filter-repo.html#callbacks أمثلة للحصول على مجموعة من التقارير التي تشير إلى إعادة تسمية التي حدثت في أحجام إعادة الريبو وإدراج الكائنات التي تم تجميعها من قبل أي مسار ، الدليل أو التمديد أو معرف النقطة: GIT Filter-Repo-تحليل (يمكن أن تساعدك هذه التقارير في اختيار كيفية تصفية الريبو الخاص بك ؛ يمكن أن كن مفيدًا لإعادة تشغيل هذا الأمر بعد التصفية لتجديد تقرير والتحقق من أن التغييرات تبدو صحيحة.) لاستخراج التاريخ الذي لمست فقط "أدلة" و "أدوات/إصدارات": Git Filter-Repo-أدوات/ أدوات المسار/ الإصدارات لإزالة foo.zip و bar/baz/zips من كل مراجعة في التاريخ: git filter-repo-path foo.zip-bar-path/baz/Zips/- لاستبدال النص "كلمة المرور" بـ "P455W0RD": git filter-repo-replace-text <(echo "password ==> p455w0rd") لاستخدام الإصدار الحالي من ملف .mailmap لتحديث المؤلفين ، الالتزامات ، والعلاج على مر التاريخ وجعلها دائمة: Git Filter-Repo-Use-Mailmap لاستخراج تاريخ "SRC/" ، أعد تسمية جميع الملفات للحصول على رائدة جديدة دليل "my-module" (على سبيل المثال src/foo.java-> my-module/src/foo.java) ، و أضف بادئة "my-module-" إلى جميع العلامات: git filter-repo-path src/--to-subdirectory-filter my my-module-tag-tename '': 'my-mode-' للحصول على المزيد من الأمثلة والتفسيرات التفصيلية ، انظر https://htmlpreview.github.io/؟https://github.com/newren/git-filter-repo/blob/docs/html/git-filter-repo.html#examples
fa: تماس تلفنی بیشتر توابع پاسخ به تماس با همان قالب کلی هستند. برای یک خط فرمان بحث مانند -بدن-بدنه " کد زیر گردآوری شده و خوانده می شود: def foo_callback (foo): بدنه استثناء در تماسهای برگشتی ،-فایل-ایفید-تماس است که خواهد بود بیشتر در زیر بحث شده است. با توجه به سبک پاسخ به تماس ، ما می توانیم یک تماس ساده برای جایگزینی ایجاد کنیم "جان" با "جان" در نویسنده/committer/tagger: Git Filter-Repo--Name-Callback 'Return Name.Replace (B "Jon" ، B "John") برای حذف همه برچسب های "آزمایش شده" در پیام های تعهد (یا برچسب): Git Filter-Repo-Message-Callback 'Return re.sub (br "\ ntested-by :.*" ، "" ، پیام) " برای حذف همه پرونده های .ds_store: Git Filter-Repo--Filename-Callback "اگر OS.Path.Basename (نام پرونده) == B" .ds_store "نام دیگر نام پرونده" را برگرداند. توجه داشته باشید که اگر بدنه به نام پرونده برطرف شود ، محتوای آن پرونده به عنوان بدنه در عملکرد پاسخ به تماس استفاده می شود. -فایل-ایفیل-تماس-تماس با عملکرد برگشت عملکرد بیشتری دارد. برای آن کد زیر گردآوری شده و خوانده می شود: def file_info_callback (نام پرونده ، حالت ، blob_id ، مقدار): بدنه این طراحی شده است تا در مواردی که فیلتر به هر دو بستگی دارد استفاده شود نام پرونده و مطالب (و شاید حالت). برای تغییرات پرونده فراخوانده می شود به غیر از حذف (از آنجا که حذف ها هیچ محتوای پرونده ای برای کار ندارند روشن) پیش بینی می شود این پاسخ به یک برگه از (نام پرونده ، حالت ، بازگردد. blob_id). این می تواند از توابع زیر از مقدار استفاده کند مثال: value.get_contents_by_identifier (blob_id) -> مطالب (bytestring) Value.get_size_by_identifier (blob_id) -> size_of_blob (int) Value.insert_file_with_contents (محتویات) -> blob_id Value.is_binary (محتویات) -> BOOL Value.apply_replace_text (محتویات) -> new_contents (bytestring) و می تواند عضو داده زیر را از نمونه ارزش بخواند و بنویسد: Value.data (DICT) از نام پرونده می توان برای تغییر نام پرونده مشابه استفاده کرد -نام خانوادگی (یا هیچ کدام برای رها کردن تغییر) ، و حالت یکی است از B'100644 '، B'100755' ، B'120000 'یا B'160000'. برای مثال های دقیق تر و توضیحات و احتیاط ها ، ببینید https://htmlpreview.github.io/؟https://github.com/newren/git-filter-repo/blob/docs/html/git-filter-repo.html#callbacks نمونه برای به دست آوردن یک دسته از گزارش ها که از تغییر نام هایی که در آن رخ داده اند اندازه اشیاء repo و لیست شما که توسط هر یک از مسیری جمع شده اند ، دایرکتوری ، پسوند یا Blob-ID: Git Filter-Repo-Analyze (این گزارش ها می توانند به شما در انتخاب چگونگی فیلتر کردن repo خود کمک کنند ؛ می تواند برای اجرای مجدد این دستور پس از فیلتر برای بازسازی مفید باشید گزارش ها را گزارش و تأیید کنید.) برای استخراج تاریخی که فقط "راهنماها" و "ابزارها/انتشار" را لمس می کند: GIT Filter-Repo-راهنما/-ابزار/ نسخه ها برای حذف foo.zip و نوار/baz/Zips از هر تجدید نظر در تاریخ: GIT Filter-Repo--Path Foo.zip-نوار/BAZ/Zips/--invert برای جایگزینی متن "رمز عبور" با "p455w0rd": Git Filter-Repo-Replace-Text <(echo "رمز عبور ==> P455W0RD") برای استفاده از نسخه فعلی پرونده .mailmap برای به روزرسانی نویسندگان ، متعهد ، و برچسب ها در طول تاریخ و آن را دائمی می کنند: GIT Filter-Repo-استفاده از طریق mailmap برای استخراج تاریخ "SRC/" ، همه پرونده ها را تغییر نام دهید تا یک پیشرو جدید داشته باشد دایرکتوری "My-Module" (به عنوان مثال Src/foo.java-> My-Module/Src/foo.java) ، و پیشوند "ماژول من" را به همه برچسب ها اضافه کنید: Git Filter-Repo--Path Src/--to-Subdirectory-Filter My-Module--Tag-Rename "": "My-Module-" برای مثال های دقیق تر و توضیحات ، ببینید https://htmlpreview.github.io/؟https://github.com/newren/git-filter-repo/blob/docs/html/git-filter-repo.html#examples
ru: Обратные вызовы Большинство функций обратного вызова имеют тот же общий формат. Для командной строки аргумент вроде -Фоо-обратный кузов ' Следующий код будет составлен и вызван: def foo_callback (foo): ТЕЛО Исключением на обратных вызовах является-file-info-sallback, который будет обсуждается далее ниже. Учитывая стиль обратного вызова, мы можем сделать простой обратный вызов, чтобы заменить «Джон» с «Джоном» в авторе/комитете/именах теггеров: GIT Filter-Repo-name-callback 'return name.replace (b "Jon", b "John")' Чтобы удалить все теги «тестируемых» в сообщении Commit (или Tag): Git Filter-Repo-Message-callback 'return re.sub (br "\ ntested-by :.*", ",", message)' Чтобы удалить все файлы .ds_store: Git Filter-Repo-filename-callback 'return none, если os.path.basename (имя файла) == b ".ds_store" else filename' Обратите внимание, что если тело разрешается именем файла, то содержимое этого файла будет использоваться в качестве тела в функции обратного вызова. У-Файл-Инфу-Сэмпбера имеет более сложный обратный вызов функции; для этого Следующий код будет составлен и вызван: def file_info_callback (имя файла, режим, blob_id, value): ТЕЛО Он предназначен для использования в тех случаях, когда фильтрация зависит от обоих Имя файла и содержимое (и, возможно, режим). Это требуется для изменения файла Кроме удалений (поскольку удаления не имеют содержимого файла для работы на). Ожидается, что этот обратный вызов вернет кортеж (имя файла, режим, blob_id). Он может использовать следующие функции из значения пример: value.get_contents_by_identifier (blob_id) -> contents (bytestring) value.get_size_by_identifier (blob_id) -> size_of_blob (int) value.insert_file_with_contents (contents) -> blob_id value.is_binary (contents) -> bool value.apply_replace_text (contents) -> new_contents (bytestring) и может прочитать/написать следующий член данных из экземпляра значения: value.data (dict) Имя файла может использоваться для переименования файла, аналогичного -Filename-Callback (или нет, чтобы отбросить изменение), а режим-один B'100644 ', B'100755', B'120000 ', или B'160000'. Более подробные примеры, объяснения и предостережения, см. https://htmlpreview.github.io/?https://github.com/newren/git-filter-repo/blob/docs/html/git-filter-repo.html#callbacks Примеры Чтобы получить кучу сообщений, упомянутых переименования, которые произошли в Ваша репо и листинговые размеры объектов, агрегированных любым путем, каталог, расширение или Blob-ID: GIT Filter-Repo-анализ (Эти отчеты могут помочь вам выбрать, как фильтровать ваше репо; он может Будьте полезны для повторного управления этой командой после фильтрации для восстановления Сообщите и проверить изменения выглядят правильно.) Чтобы извлечь историю, которая коснулась только «направляющих» и «инструментов/выпусков»: GIT Filter-REPO-PATH GUIDE Чтобы удалить foo.zip и bar/baz/Zips из каждого пересмотра в истории: GIT Filter-Repo-Path foo.zip-Парте-бар/Baz/Zips/-invert-paths Чтобы заменить текст «пароль» на «P455W0RD»: Git Filter-Repo-Replace-Text <(echo "password ==> p455w0rd") Чтобы использовать текущую версию файла .mailmap для обновления авторов, Коммиссии и теггеры на протяжении всей истории и делают его постоянным: GIT Filter-Repo-USE-MAILMAP Чтобы извлечь историю «src/», переименовать все файлы, чтобы иметь новое руководство каталог 'my-module' (например, src/foo.java-> my-module/src/foo.java) и Добавьте префикс «мой модуль» ко всем тегам: GIT Filter-REPO-PATH SRC/--TO-SUBDIRECTORY FILTER MY-MODULE-TAG-RENAME '': 'My-Module-' Более подробные примеры и объяснения, см. https://htmlpreview.github.io/?https://github.com/newren/git-filter-repo/blob/docs/html/git-filter-repo.html#examples
tr: Geri arama Çoğu geri arama işlevi aynı genel formattır. Bir komut satırı için argüman ---fo-callback 'gövde' Aşağıdaki kod derlenecek ve çağrılacaktır: def foo_callback (foo): VÜCUT Geri arama istisnası-filile-info-callback, aşağıda daha fazla tartışıldı. Geri arama stili göz önüne alındığında, değiştirmek için basit bir geri arama yapabiliriz Yazar/Ticaret/Tagger adlarında 'John' ile 'Jon': git filtre-repo-name-callback 'dönüş adı. Taahhüt (veya etiket) mesajlarındaki tüm 'test edilen' etiketleri kaldırmak için: git filtre-repo-message-callback 'dönüş re.sub (br "\ ntested-by :.*", "", mesaj)' Tüm .ds_store dosyalarını kaldırmak için: git filtre-repo ---filename callback 'os.path.basename (dosya adı) == b ".ds_store" else dosya adı " Vücut bir dosya adına çözülürse, o dosyanın içeriği geri arama işlevinde gövde olarak kullanılacaktır. --File-info-callback, daha fazla ilgili bir işlev geri çağrısı vardır; Bunun için Aşağıdaki kod derlenecek ve çağrılacaktır: def file_info_callback (dosya adı, mod, blob_id, değer): VÜCUT Filtrelemenin her ikisine de bağlı olduğu durumlarda kullanılmak üzere tasarlanmıştır. dosya adı ve içeriği (ve belki mod). Dosya değişiklikleri için çağrılır silme dışında (silme işlemlerinin çalışması için dosya içeriği olmadığından Açık). Bu geri çağrının bir tuple (dosya adı, mod, blob_id). Değerden aşağıdaki işlevlerden yararlanabilir misal: value.get_contents_by_identifier (BLOB_ID) -> İçindekiler (ByTestring) value.get_size_by_identifier (blob_id) -> size_of_blob (int) value.insert_file_with_contents (içerik) -> blob_id value.is_binary (içerik) -> bool value.apply_replace_text (içerik) -> new_contents (byTestring) ve değer örneğinden aşağıdaki veri üyesini okuyabilir/yazabilir: Value.Data (Dict) Dosya adı, dosyayı yeniden adlandırmak için kullanılabilir. --filename-callback (veya değişikliği bırakacak hiçbiri) ve mod bir B'100644 ', B'100755', B'120000 'veya B'160000'. Daha ayrıntılı örnekler ve açıklamalar ve uyarılar için bkz. https://htmlpreview.github.io/?https://github.com/newren/git-filter-repo/blob/docs/html/git-filter-repo.html#callbacks Örnekler Bir sürü raporu almak için Repo'nuz ve herhangi bir yolla toplanan nesnelerin listeleme boyutları, Dizin, Uzantı veya Blob-ID: Git Filtre-Repo-Analyze (Bu raporlar, repo'nuzu nasıl filtreleyeceğinizi seçmenize yardımcı olabilir; Filtreledikten sonra bu komutu yeniden çalıştırmak için yararlı olun. değişikliklerin doğru göründüğünü bildirin ve doğrulayın.) Sadece 'kılavuzlara' ve 'araçlara/sürümlere' dokunan geçmişi çıkarmak için: Git Filtre-Repo-Path Kılavuzları/-Path Araçları/ Sürümler Tarihteki her revizyondan foo.zip ve bar/baz/zipleri kaldırmak için: git filtre-repo ---path foo.zip-yol çubuğu/baz/fermuar/-içt-yollar 'Parola' metnini 'p455w0rd' ile değiştirmek için: git filtre-repo-replace-text <(echo "şifre ==> p455w0rd") Yazarları güncellemek için .mailmap dosyasının geçerli sürümünü kullanmak için, tarih boyunca taahhütler ve taggers ve kalıcı hale getirir: Git Filtre-Repo-Kullanım maaşı 'SRC/' geçmişini çıkarmak için, tüm dosyaları yeni bir lider olmak için yeniden adlandırın 'MOMULE' (örn. src/foo.java-> benim-modül/src/foo.java) dizini ve Tüm etiketlere bir 'benim modül-' öneki ekleyin: git filtre-repo ---path src/ ---to-subdirectory filtr my-module--tag-rename '': 'module-' Daha ayrıntılı örnekler ve açıklamalar için bkz. https://htmlpreview.github.io/?https://github.com/newren/git-filter-repo/blob/docs/html/git-filter-repo.html#examplesples

source: Analysis
ar: تحليل
fa: تجزیه
ru: Анализ
tr: Analiz

source: Analyze repository history and create a report that may be useful in determining what to filter in a subsequent run. Will not modify your repo.
ar: تحليل تاريخ المستودع وإنشاء تقرير قد يكون مفيدًا في تحديد ما يجب تصفية في التشغيل اللاحق. لن يعدل repo الخاص بك.
fa: تاریخچه مخزن را تجزیه و تحلیل کرده و گزارشی ایجاد کنید که ممکن است در تعیین چه فیلتر در یک اجرای بعدی مفید باشد. repo شما را اصلاح نمی کند.
ru: Проанализируйте историю репозитория и создайте отчет, который может быть полезен при определении того, что фильтровать в последующем заезде. Не будет изменять ваш репо.
tr: Depo geçmişini analiz edin ve sonraki bir çalışmada ne filtreleyeceğinizi belirlemede yararlı olabilecek bir rapor oluşturun. Repo'nuzu değiştirmeyecek.

source: Directory to write report, defaults to GIT_DIR/filter_repo/analysis,refuses to run if exists, --force delete existing dir first.
ar: الدليل لكتابة تقرير ، والافتراضات إلى git_dir/filter_repo/تحليل ، يرفض التشغيل إذا كان موجودًا ، -حذف dir الموجود أولاً.
fa: دایرکتوری برای نوشتن گزارش ، پیش فرض به git_dir/filter_repo/تجزیه و تحلیل ، در صورت وجود از اجرای آن امتناع می ورزد ، -اولین بار DIR موجود را حذف می کند.
ru: Справочник для записи отчета, по умолчанию GIT_DIR/FILTER_REPO/АНАЛИЗ, отказывается работать, если существует, -Сначала удалить существующий директор.
tr: Dizin Rapor Yazmak için, varsayılan olarak GIT_DIR/FILTRE_REPO/Analizi, varsa çalışmayı reddeder, -önce mevcut direkleri silin.

source: Filtering based on paths (see also --filename-callback)
ar: تصفية بناءً على المسارات (انظر أيضًا-Filename-Callback)
fa: فیلتر بر اساس مسیرها (همچنین به-فیلم-تماس-تماس را رجوع کنید)
ru: Фильтрация на основе пути (см. Также-Filename-Callback)
tr: Yollara dayalı filtreleme (ayrıca bkz.--FileName-Callback)
