Repository: zahraadelbani/club-management-backup
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar, fa, ru, tr

source: Start Date
ar: تاريخ البدء
fa: تاریخ شروع
ru: Дата начала
tr: Başlangıç ​​Tarihi

source: End Date
ar: تاريخ الانتهاء
fa: تاریخ پایان
ru: Дата окончания
tr: Bitiş tarihi

source: Is Active
ar: نشط
fa: فعال است
ru: Активен
tr: Aktif

source: Review Club Activities
ar: مراجعة أنشطة النادي
fa: فعالیت های باشگاه را مرور کنید
ru: Обзор клубных мероприятий
tr: Kulüp etkinliklerini inceleyin

source: Club Activities
ar: أنشطة النادي
fa: فعالیت های باشگاه
ru: Клубные мероприятия
tr: Kulüp faaliyetleri

source: Dashboard
ar: لوحة القيادة
fa: داشبورد
ru: Приборная панель
tr: Gösterge paneli

source: Club
ar: النادي
fa: کلوپ
ru: Клуб
tr: Kulüp

source: Status
ar: حالة
fa: وضعیت
ru: Статус
tr: Durum

source: Approved
ar: موافقة
fa: تصویب شده
ru: Одобренный
tr: Onaylı

source: Rejected
ar: مرفوض
fa: رد شده
ru: Отклоненный
tr: Reddedilmiş

source: Pending
ar: قيد الانتظار
fa: درنده
ru: В ожидании
tr: Askıda olması

source: Edit
ar: يحرر
fa: ویرایش کردن
ru: Редактировать
tr: Düzenlemek

source: Approve
ar: يعتمد
fa: تصویب کردن
ru: Утвердить
tr: Onaylamak

source: Reject
ar: يرفض
fa: رد کردن
ru: Отклонять
tr: Reddetmek

source: Schedule Meeting
ar: اجتماع الجدول
fa: جلسه برنامه ریزی
ru: Расписание собрания
tr: Çizelge Toplantısı

source: No activities available.
ar: لا توجد أنشطة متاحة.
fa: هیچ فعالیتی در دسترس نیست.
ru: Нет доступных действий.
tr: Aktivite yok.

source: Back to Dashboard
ar: العودة إلى لوحة القيادة
fa: بازگشت به داشبورد
ru: Вернемся к приборной панели
tr: Gösterge Tablasına Dön

source: Visible
ar: مرئي
fa: قابل مشاهده
ru: Видимый
tr: Görünür

source: No announcements available.
ar: لا إعلانات متاحة.
fa: هیچ اطلاعیه ای در دسترس نیست.
ru: Нет объявлений.
tr: Duyuru yok.

source: Delete Club
ar: حذف النادي
fa: کلوپ را حذف کنید
ru: Удалить клуб
tr: Sil Kulübü

source: Confirm Delete
ar: تأكيد الحذف
fa: حذف را تأیید کنید
ru: Подтвердить удалить
tr: Silini onaylayın

source: Cancel
ar: يلغي
fa: لغو کردن
ru: Отмена
tr: İptal etmek

source: Update Club
ar: تحديث نادي
fa: باشگاه بروزرسانی
ru: Обновить клуб
tr: Güncelleme Kulübü

source: Create Club
ar: إنشاء النادي
fa: ایجاد باشگاه
ru: Создать клуб
tr: Kulüp Oluştur

source: Submit
ar: يُقدِّم
fa: ارسال کردن
ru: Представлять на рассмотрение
tr: Göndermek

source: All Clubs
ar: جميع الأندية
fa: همه باشگاه ها
ru: Все клубы
tr: Tüm Kulüpler

source: Add New Club
ar: أضف نادي جديد
fa: باشگاه جدید اضافه کنید
ru: Добавить новый клуб
tr: Yeni Kulüp Ekle

source: Quota
ar: حصة
fa: سهمیه
ru: Квота
tr: Kota

source: Leader
ar: قائد
fa: رهبر
ru: Лидер
tr: Lider

source: Not confirmed
ar: لم يؤكد
fa: تأیید نشده است
ru: Не подтверждено
tr: Onaylanmadı

source: Members
ar: أعضاء
fa: اعلان
ru: Члены
tr: Üye

source: Events
ar: الأحداث
fa: وقایع
ru: События
tr: Olaylar

source: Delete
ar: يمسح
fa: حذف کردن
ru: Удалить
tr: Silmek

source: No clubs available
ar: لا أندية متاحة
fa: هیچ باشگاهی در دسترس نیست
ru: Нет клубов
tr: Kulüp yok

source: Save
ar: يحفظ
fa: پس انداز کردن
ru: Сохранять
tr: Kaydetmek

source: Activity Center Admin Dashboard
ar: لوحة معلومات المشرف مركز النشاط
fa: داشبورد مدیر مرکز فعالیت
ru: Центр активности администратор администратора
tr: Etkinlik Merkezi Yönetici Gösterge Tablosu

source: Manage Clubs
ar: إدارة الأندية
fa: مدیریت باشگاه ها
ru: Управлять клубами
tr: Kulüpleri Yönetin

source: Manage Events
ar: إدارة الأحداث
fa: مدیریت رویدادها
ru: Управлять событиями
tr: Etkinlikleri Yönetin

source: Review Announcements
ar: مراجعة إعلانات
fa: اطلاعیه ها را مرور کنید
ru: Обзор объявления
tr: Duyuruları inceleyin

source: Pending Items
ar: العناصر المعلقة
fa: در انتظار موارد
ru: Ожидающие предметы
tr: Bekleyen ürünler

source: Pending Club Activities
ar: أنشطة النادي المعلقة
fa: فعالیت های باشگاه در انتظار
ru: Ожидающие клубные мероприятия
tr: Bekleyen kulüp etkinlikleri

source: Pending Announcements
ar: إعلانات معلقة
fa: در انتظار اعلامیه ها
ru: Ожидающие объявления
tr: Bekleyen duyurular

source: Your Organization Name
ar: اسم مؤسستك
fa: نام سازمان شما
ru: Название вашей организации
tr: Kuruluş Adınız

source: Update
ar: تحديث
fa: بروزرسانی
ru: Обновлять
tr: Güncelleme

source: Delete Event
ar: حذف الحدث
fa: رویداد را حذف کنید
ru: Удалить событие
tr: Etkinliği Sil

source: Update Event
ar: تحديث الحدث
fa: رویداد به روزرسانی
ru: Обновление события
tr: Güncelleme Etkinliği

source: Create Event
ar: إنشاء حدث
fa: ایجاد رویداد
ru: Создать событие
tr: Etkinlik Oluştur

source: Add New Event
ar: أضف حدثًا جديدًا
fa: رویداد جدید اضافه کنید
ru: Добавить новое событие
tr: Yeni Etkinlik Ekle

source: Date
ar: تاريخ
fa: تاریخ
ru: Дата
tr: Tarih

source: No events available.
ar: لا توجد أحداث متاحة.
fa: هیچ رویدادی در دسترس نیست.
ru: Нет событий.
tr: Etkinlik yok.

source: Active
ar: نشيط
fa: فعال
ru: Активный
tr: Aktif

source: Inactive
ar: غير نشط
fa: غیر فعال
ru: Неактивный
tr: Aktif olmayan

source: Candidate
ar: مُرَشَّح
fa: نامزد
ru: Кандидат
tr: Aday

source: Position
ar: موضع
fa: موقعیت
ru: Позиция
tr: Konum

source: Actions
ar: الإجراءات
fa: اقدامات
ru: Действия
tr: Eylem

source: Event Title
ar: عنوان الحدث
fa: عنوان رویداد
ru: Название мероприятия
tr: Etkinlik Başlığı

source: Participants
ar: مشاركون
fa: شرکت کننده
ru: Участники
tr: Katılımcılar

source: Needs
ar: الاحتياجات
fa: نیازهای
ru: Потребности
tr: İhtiyaç

source: None
ar: لا أحد
fa: هیچ کدام
ru: Никто
tr: Hiçbiri

source: Total Cost
ar: التكلفة الإجمالية
fa: کل هزینه
ru: Общая стоимость
tr: Toplam maliyet

source: Documents
ar: وثائق
fa: اسناد
ru: Документы
tr: Belgeler

source: Meeting Date & Time
ar: تاريخ الاجتماع والوقت
fa: تاریخ و زمان جلسه
ru: Дата и время встречи
tr: Toplantı Tarihi ve Saati

source: Total Members
ar: إجمالي الأعضاء
fa: کل اعضای
ru: Всего участников
tr: Toplam Üyeler

source: Total Events
ar: الأحداث الكلية
fa: کل حوادث
ru: Общее количество событий
tr: Toplam Etkinlikler

source: Total Polls
ar: إجمالي استطلاعات الرأي
fa: کل نظرسنجی ها
ru: Общие опросы
tr: Toplam Anketler

source: Date & Time
ar: التاريخ والوقت
fa: تاریخ و زمان
ru: Дата и время
tr: Tarih ve Saat

source: Upload Image
ar: تحميل الصورة
fa: بارگذاری تصویر
ru: Загрузить изображение
tr: Resmi Yükle

source: Transportation Request
ar: طلب النقل
fa: درخواست حمل و نقل
ru: Транспортный запрос
tr: Taşıma Talebi

source: Supporting Documents
ar: الدعم المستندات
fa: اسناد پشتیبان
ru: Вспомогательные документы
tr: Destekleyici Belgeler

source: Document Title
ar: عنوان الوثيقة
fa: عنوان مستند
ru: Название документа
tr: Belge başlığı

source: Upload File
ar: ملف تحميل
fa: پرونده بارگذاری
ru: Загрузить файл
tr: Dosyayı Yükle

source: Announcement Title
ar: عنوان الإعلان
fa: عنوان اعلامیه
ru: Название объявления
tr: Duyuru başlığı

source: Content
ar: محتوى
fa: محتوا
ru: Содержание
tr: İçerik

source: Visible to Members
ar: مرئي للأعضاء
fa: برای اعضا قابل مشاهده است
ru: Видимо для членов
tr: Üyeler tarafından görülebilir

source: Club Analytics
ar: تحليلات النادي
fa: تحلیلی
ru: Клубная аналитика
tr: Kulüp analizi

source: Add Event
ar: إضافة الحدث
fa: رویداد را اضافه کنید
ru: Добавить событие
tr: Etkinlik Ekle

source: Upcoming Events
ar: الأحداث القادمة
fa: رویدادهای آینده
ru: Предстоящие события
tr: Yaklaşan etkinlikler

source: Agenda
ar: جدول أعمال
fa: دستور کار
ru: Повестка дня
tr: Gündem

source: Create Announcement
ar: إنشاء إعلان
fa: اعلامیه ایجاد کنید
ru: Создать объявление
tr: Duyuru Oluştur

source: Post Announcement
ar: إعلان ما بعد
fa: اعلامیه پست
ru: Почтовое объявление
tr: Post Duyuru

source: Last 24 Hours
ar: آخر 24 ساعة
fa: 24 ساعت گذشته
ru: Последние 24 часа
tr: Son 24 Saat

source: Pending Events
ar: الأحداث المعلقة
fa: در انتظار وقایع
ru: Ожидающие события
tr: Bekleyen etkinlikler

source: Termination Requests
ar: طلبات الإنهاء
fa: درخواست های خاتمه
ru: Запросы на прекращение
tr: Fesih Talepleri

source: Pending Complaints
ar: شكاوى معلقة
fa: در انتظار شکایات
ru: В ожидании жалоб
tr: Bekleyen şikayetler

source: Suggestions
ar: اقتراحات
fa: پیشنهادات
ru: Предложения
tr: Öneriler

source: Event Image
ar: صورة الحدث
fa: تصویر
ru: Событие изображение
tr: Etkinlik Görüntüsü

source: View Details
ar: عرض التفاصيل
fa: مشاهده جزئیات
ru: Просмотреть детали
tr: Ayrıntıları Görüntüle

source: No pending event requests.
ar: لا طلبات الحدث المعلقة.
fa: بدون درخواست رویداد در انتظار.
ru: Нет ожидающих запросов на события.
tr: Bekleyen olay isteği yok.

source: Member
ar: عضو
fa: عضو
ru: Член
tr: Üye

source: Requested At
ar: طلب في
fa: درخواست شده
ru: Запрошен на
tr: İstenen

source: No termination requests pending.
ar: لا طلبات إنهاء معلقة.
fa: بدون درخواست خاتمه در انتظار.
ru: Никаких запросов на прекращение не ожидает.
tr: Bekleyen fesih isteği yok.

source: Search for documents...
ar: ابحث عن المستندات ...
fa: جستجوی اسناد ...
ru: Поиск документов ...
tr: Belgeleri arayın ...

source: Search
ar: يبحث
fa: جستجو
ru: Поиск
tr: Aramak

source: Title
ar: عنوان
fa: عنوان
ru: Заголовок
tr: Başlık

source: No announcements pending.
ar: لا إعلانات معلقة.
fa: هیچ اطلاعیه ای در انتظار نیست.
ru: Никаких объявлений не ожидается.
tr: Bekleyen duyuru yok.

source: Submitted On
ar: قدمت على
fa: ارسال شده
ru: Представлено на
tr: Gönderildi

source: Action
ar: فعل
fa: عمل
ru: Действие
tr: Aksiyon

source: Mark as Reviewed
ar: علامة كما تمت مراجعتها
fa: علامت گذاری شده
ru: Марк, как рассмотрено
tr: İncelendiği gibi işaretleyin

source: No pending complaints.
ar: لا شكاوى معلقة.
fa: بدون شکایت در انتظار.
ru: Нет ожидающих жалоб.
tr: Bekleyen şikayet yok.

source: Submitted By
ar: المقدمة من قبل
fa: ارسال شده توسط
ru: Отправлено
tr: Tarafından gönderildi

source: No pending suggestions.
ar: لا توجد اقتراحات معلقة.
fa: بدون پیشنهاد در انتظار
ru: Нет ожидающих предложений.
tr: Bekleyen öneri yok.

source: Recent Updates
ar: التحديثات الأخيرة
fa: به روزرسانی های اخیر
ru: Последние обновления
tr: Son Güncellemeler

source: 2 hours ago
ar: قبل 2 ساعة
fa: 2 ساعت پیش
ru: 2 часа назад
tr: 2 saat önce

source: found the perfect lip liner
ar: وجدت بطانة الشفاه المثالية
fa: آستر لب مناسب پیدا کرد
ru: Нашел идеальный лайнер для губ
tr: Mükemmel dudak astarını buldum

source: created a cooking event
ar: إنشاء حدث طبخ
fa: یک رویداد آشپزی ایجاد کرد
ru: Создал кулинарное мероприятие
tr: bir yemek pişirme etkinliği yarattı

source: Previous
ar: سابق
fa: قبلی
ru: Предыдущий
tr: Öncesi

source: Page
ar: صفحة
fa: صفحه
ru: Страница
tr: Sayfa

source: of
ar: ل
fa: از
ru: из
tr: ile ilgili

source: Next
ar: التالي
fa: طرف دیگر
ru: Следующий
tr: Sonraki

source: Edit Announcement
ar: تعديل الإعلان
fa: اعلامیه ویرایش
ru: Редактировать объявление
tr: Düzenleme Duyurusu

source: Save Changes
ar: حفظ التغييرات
fa: تغییرات را ذخیره کنید
ru: Сохранить изменения
tr: Değişiklikleri Kaydet

source: No image uploaded
ar: لم يتم تحميل صورة
fa: هیچ تصویری بارگذاری نشده است
ru: Не загружено изображение
tr: Resim Yüklenmedi

source: Edit Event
ar: تحرير الحدث
fa: ویرایش رویداد
ru: Редактировать событие
tr: Düzenleme Etkinliği

source: After editing, the event status will be reset to
ar: بعد التحرير ، سيتم إعادة تعيين حالة الحدث
fa: پس از ویرایش ، وضعیت رویداد دوباره تنظیم می شود
ru: После редактирования статус события будет сброшен на
tr: Düzenleme işleminden sonra, olay durumu sıfırlanacaktır.

source: pending
ar: قيد الانتظار
fa: درنده
ru: в ожидании
tr: askıda olması

source: for re-approval.
ar: لإعادة الموافقة.
fa: برای تأیید مجدد
ru: для повторного одобрения.
tr: yeniden onay için.

source: Back to Calendar
ar: العودة إلى التقويم
fa: بازگشت به تقویم
ru: Вернуться в календарь
tr: Takvime geri dön

source: Announcements
ar: الإعلانات
fa: اعلامیه ها
ru: Объявления
tr: Duyurular

source: Posted on
ar: نشر على
fa: ارسال شده
ru: Опубликовано на
tr: Yayınlanan

source: Visibility
ar: الرؤية
fa: دید
ru: Видимость
tr: Görünürlük

source: Hidden
ar: مختفي
fa: پنهان
ru: Скрытый
tr: Gizlenmiş

source: Are you sure you want to delete this announcement?
ar: هل أنت متأكد من أنك تريد حذف هذا الإعلان؟
fa: آیا مطمئن هستید که می خواهید این اعلامیه را حذف کنید؟
ru: Вы уверены, что хотите удалить это объявление?
tr: Bu duyuruyu silmek istediğinizden emin misiniz?

source: No announcements yet.
ar: لا إعلانات حتى الآن.
fa: هنوز هیچ اطلاعیه ای وجود ندارد.
ru: Еще нет объявлений.
tr: Henüz duyuru yok.

source: First
ar: أولاً
fa: اولی
ru: Первый
tr: Birinci

source: Last
ar: آخر
fa: آخرین
ru: Последний
tr: Son

source: Club Resources
ar: موارد النادي
fa: منابع باشگاه
ru: Клубные ресурсы
tr: Kulüp kaynakları

source: Upload New Document
ar: تحميل وثيقة جديدة
fa: سند جدید را بارگذاری کنید
ru: Загрузите новый документ
tr: Yeni Belge Yükle

source: Date Uploaded
ar: تم تحميل التاريخ
fa: تاریخ بارگذاری شده
ru: Дата загружена
tr: Tarih Yüklendi

source: Download
ar: تحميل
fa: بارگیری کردن
ru: Скачать
tr: İndirmek

source: Are you sure you want to delete this document?
ar: هل أنت متأكد أنك تريد حذف هذا المستند؟
fa: آیا مطمئن هستید که می خواهید این سند را حذف کنید؟
ru: Вы уверены, что хотите удалить этот документ?
tr: Bu belgeyi silmek istediğinizden emin misiniz?

source: No documents available.
ar: لا توجد مستندات متاحة.
fa: هیچ اسناد موجود نیست.
ru: Нет документов.
tr: Belge mevcut değildir.

source: Sort by Approval
ar: فرز بالموافقة
fa: مرتب سازی بر اساس تأیید
ru: Сортировать по утверждению
tr: Onayla sıralayın

source: Sort by Date
ar: فرز حسب التاريخ
fa: مرتب سازی بر اساس تاریخ
ru: Сортировать по дате
tr: Tarihe göre sıralayın

source: Event Name
ar: اسم الحدث
fa: نام رویداد
ru: Название события
tr: Etkinlik Adı

source: Search by name or email...
ar: ابحث بالاسم أو البريد الإلكتروني ...
fa: با نام یا ایمیل جستجو کنید ...
ru: Поиск по имени или по электронной почте ...
tr: İsim veya e -postaya göre arama ...

source: Member Name
ar: اسم العضو
fa: نام عضو
ru: Имя члена
tr: Üye adı

source: Email
ar: بريد إلكتروني
fa: ایمیل
ru: Электронная почта
tr: E -posta

source: Joined Date
ar: انضم إلى التاريخ
fa: تاریخ پیوست
ru: Присоединилась к дате
tr: Katılan tarih

source: Are you sure you want to remove this member?
ar: هل أنت متأكد من أنك تريد إزالة هذا العضو؟
fa: آیا مطمئن هستید که می خواهید این عضو را حذف کنید؟
ru: Вы уверены, что хотите удалить этого участника?
tr: Bu üyesi kaldırmak istediğinden emin misiniz?

source: Remove
ar: يزيل
fa: برداشتن
ru: Удалять
tr: Kaldırmak

source: No members found.
ar: لم يتم العثور على أعضاء.
fa: هیچ عضو پیدا نکرد
ru: Участников не найдено.
tr: Üye bulunamadı.

source: Membership Termination Requests
ar: طلبات إنهاء العضوية
fa: درخواست های خاتمه عضویت
ru: Запросы на прекращение членства
tr: Üyelik fesih talepleri

source: No pending requests.
ar: لا توجد طلبات معلقة.
fa: بدون درخواست در انتظار
ru: Нет ожидающих запросов.
tr: Bekleyen istek yok.

source: Pending Membership Requests
ar: طلبات العضوية المعلقة
fa: در انتظار درخواست های عضویت
ru: В ожидании запросов на членство
tr: Bekleyen üyelik istekleri

source: User
ar: مستخدم
fa: کاربر
ru: Пользователь
tr: Kullanıcı

source: No membership requests at the moment.
ar: لا طلبات العضوية في الوقت الحالي.
fa: در حال حاضر هیچ درخواست عضویت ندارد.
ru: В настоящее время нет запросов на членство.
tr: Şu anda üyelik isteği yok.

source: Screen & Browser Dimensions
ar: أبعاد الشاشة والمتصفح
fa: ابعاد صفحه نمایش و مرورگر
ru: Размеры экрана и браузера
tr: Ekran ve Tarayıcı Boyutları

source: Browser (Viewport) Dimensions
ar: أبعاد المتصفح (Viewport)
fa: ابعاد مرورگر (نمای)
ru: Бруузер (Viewport) Размеры
tr: Tarayıcı (ViewPort) Boyutlar

source: Screen Dimensions
ar: أبعاد الشاشة
fa: ابعاد صفحه نمایش
ru: Размеры экрана
tr: Ekran Boyutları

source: Submit Activity Request
ar: إرسال طلب النشاط
fa: درخواست فعالیت را ارسال کنید
ru: Отправить запрос на действие
tr: Etkinlik İsteği Gönderin

source: Submit Request
ar: إرسال الطلب
fa: درخواست ارسال
ru: Отправить запрос
tr: İsteği gönder

source: Upload Club Document
ar: تحميل وثيقة نادي
fa: اسناد باشگاه بارگذاری
ru: Загрузите клубный документ
tr: Kulüp belgesini yükle

source: Upload Document
ar: وثيقة تحميل
fa: سند بارگذاری
ru: Загрузить документ
tr: Belgeyi Yükle

source: You're not authorized to access this dashboard.
ar: أنت غير مخول للوصول إلى لوحة القيادة هذه.
fa: شما مجاز به دسترسی به این داشبورد نیستید.
ru: Вы не уполномочены получить доступ к этой панели панели.
tr: Bu gösterge tablosuna erişme yetkisine sahip değilsiniz.

source: Feedback marked as reviewed.
ar: ردود الفعل التي تحمل علامة كما تمت مراجعتها.
fa: بازخورد مشخص شده به عنوان بررسی شده.
ru: Отзывы отмечены как рассмотренные.
tr: Geri bildirim incelendiği gibi işaretlenmiştir.

source: You're not authorized.
ar: أنت غير معتمد.
fa: شما مجاز نیستید
ru: Вы не уполномочены.
tr: Yetkili değilsin.

source: Member successfully removed from the club.
ar: تم إزالته بنجاح من النادي.
fa: عضو با موفقیت از باشگاه خارج شد.
ru: Участник успешно удален из клуба.
tr: Üye kulüpten başarıyla kaldırıldı.

source: Membership termination request approved. The member has been removed from the club.
ar: طلب إنهاء العضوية المعتمد. تمت إزالة العضو من النادي.
fa: درخواست خاتمه عضویت تصویب شد. این عضو از این باشگاه خارج شده است.
ru: Запрос о прекращении членства утвержден. Участник был удален из клуба.
tr: Üyelik fesih talebi onaylandı. Üye kulüpten çıkarıldı.

source: Membership termination request rejected.
ar: طلب إنهاء العضوية رفض.
fa: درخواست خاتمه عضویت رد شد.
ru: Запрос на прекращение членства отклонился.
tr: Üyelik fesih talebi reddedildi.

source: Document uploaded successfully!
ar: وثيقة تم تحميلها بنجاح!
fa: سند با موفقیت بارگذاری شد!
ru: Документ загружен успешно!
tr: Belge başarılı bir şekilde yüklendi!

source: Document deleted successfully!
ar: تم حذف المستند بنجاح!
fa: سند با موفقیت حذف شد!
ru: Документ удален успешно!
tr: Belge başarıyla silindi!

source: Announcement created successfully!
ar: تم إنشاؤه بنجاح!
fa: اعلامیه با موفقیت ایجاد شد!
ru: Объявление создано успешно!
tr: Duyuru başarıyla yaratıldı!

source: Announcement deleted successfully!
ar: تم حذف الإعلان بنجاح!
fa: اعلامیه با موفقیت حذف شد!
ru: Объявление удалено успешно!
tr: Duyuru başarıyla silindi!

source: Announcement updated successfully!
ar: تم تحديث الإعلان بنجاح!
fa: اعلامیه با موفقیت به روز شد!
ru: Объявление обновляется успешно!
tr: Duyuru başarıyla güncellendi!

source: You're not authorized to edit this event.
ar: أنت غير مخول بتحرير هذا الحدث.
fa: شما مجاز به ویرایش این رویداد نیستید.
ru: Вы не уполномочены редактировать это событие.
tr: Bu etkinliği düzenleme yetkisine sahip değilsiniz.

source: Event updated successfully! Approval required.
ar: تم تحديث الحدث بنجاح! الموافقة المطلوبة.
fa: رویداد با موفقیت به روز شد! تصویب مورد نیاز است.
ru: Событие успешно обновлено! Требуется одобрение.
tr: Etkinlik başarıyla güncellendi! Onay gerekli.

source: Membership
ar: عضوية
fa: عضویت
ru: Членство
tr: Üyelik

source: Created At
ar: تم إنشاؤها في
fa: در
ru: Создан в
tr: Yaratılmış

source: Reviewed At
ar: استعرض في
fa: بررسی شده در
ru: Рецензируется в
tr: İnceledi

source: Club Calendar
ar: تقويم النادي
fa: تقویم باشگاه
ru: Календарь клуба
tr: Kulüp takvimi

source: MY CLUB CALENDAR
ar: تقويم النادي الخاص بي
fa: تقویم باشگاه من
ru: Мой клубный календарь
tr: Kulüp takvimim

source: No club assigned
ar: لم يتم تعيين نادي
fa: هیچ باشگاهی اختصاص داده نشده است
ru: Клуб не назначен
tr: Atanan kulüp yok

source: Reminder Set
ar: مجموعة تذكير
fa: مجموعه یادآوری
ru: Напоминание
tr: Hatırlatma kümesi

source: Remind Me
ar: ذكرني
fa: به من یادآوری کن
ru: Напомни мне
tr: Bana hatırlat

source: Club Member Dashboard
ar: لوحة القيادة عضو النادي
fa: داشبورد عضو باشگاه
ru: Участник клуба Dashboard
tr: Kulüp üyesi kontrol paneli

source: Your Clubs
ar: الأندية الخاصة بك
fa: باشگاه های شما
ru: Ваши клубы
tr: Kulüpleriniz

source: Request to Leave
ar: طلب المغادرة
fa: درخواست مرخصی
ru: Просьба уйти
tr: Ayrılma İsteği

source: You have not joined any clubs yet.
ar: لم تنضم إلى أي نوادي حتى الآن.
fa: شما هنوز به هیچ باشگاهی پیوسته اید.
ru: Вы еще не вступили в клубы.
tr: Henüz kulübe katılmadınız.

source: Join a Club
ar: انضم إلى النادي
fa: به یک باشگاه بپیوندید
ru: Присоединяйтесь к клубу
tr: Bir kulübe katılın

source: members
ar: أعضاء
fa: اعلان
ru: члены
tr: üye

source: Join Club
ar: انضم إلى النادي
fa: عضویت در باشگاه
ru: Присоединяйтесь к клубу
tr: Kulübe Katılın

source: All clubs are full or you are already in 3 clubs.
ar: جميع الأندية ممتلئة أو أنت بالفعل في 3 أندية.
fa: همه باشگاه ها پر هستند یا شما در حال حاضر در 3 باشگاه هستید.
ru: Все клубы полны или вы уже в 3 клубах.
tr: Tüm kulüpler dolu ya da zaten 3 kulüptesiniz.

source: Rescheduled
ar: إعادة جدولة
fa: مجدداً
ru: Перенесено
tr: Yeniden planlanmış

source: Pending Membership Termination Requests
ar: طلبات إنهاء العضوية المعلقة
fa: درخواست های خاتمه عضویت در انتظار
ru: Запросы на прекращение членства в ожидании
tr: Bekleyen Üyelik Fesih Talepleri

source: Cancel Request
ar: إلغاء الطلب
fa: درخواست لغو
ru: Отменить запрос
tr: İsteği İptal Et

source: No pending termination requests.
ar: لا طلبات إنهاء معلقة.
fa: بدون درخواست خاتمه در انتظار.
ru: Нет ожидающих запросов о прекращении.
tr: Bekleyen fesih talebi yok.

source: Organized by:
ar: نظمتها:
fa: سازماندهی شده توسط:
ru: Организовано:
tr: Tarafından düzenlenen:

source: Attend
ar: يحضر
fa: حضور
ru: Посещать
tr: Katılmak

source: Submit Feedback
ar: إرسال الملاحظات
fa: ارسال بازخورد
ru: Отправить отзыв
tr: Geri bildirim gönder

source: Select Club:
ar: حدد النادي:
ru: Выберите клуб:
tr: Seç kulübü:

source: Enter your feedback...
ar: أدخل ملاحظاتك ...
fa: بازخورد خود را وارد کنید ...
ru: Введите свой отзыв ...
tr: Geri bildiriminizi girin ...

source: Select a Club:
ar: حدد ناديًا:
fa: یک باشگاه را انتخاب کنید:
ru: Выберите клуб:
tr: Bir kulüp seçin:

source: Quota:
ar: الحصة:
fa: سهمیه:
ru: Квота:
tr: Kota:

source: Leave a Club
ar: اترك نادٍ
fa: ترک یک باشگاه
ru: Оставить клуб
tr: Bir kulüpten ayrılmak

source: Club Announcements
ar: إعلانات النادي
fa: اعلامیه های باشگاه
ru: Клубные объявления
tr: Kulüp duyuruları

source: Filter by Club:
ar: تصفية النادي:
fa: فیلتر توسط باشگاه:
ru: Фильтр от клуба:
tr: Kulüple Filtre:

source: Club:
ar: النادي:
fa: باشگاه:
ru: Клуб:
tr: Kulüp:

source: Your Messages
ar: رسائلك
fa: پیام های شما
ru: Ваши сообщения
tr: Mesajlarınız

source: Received Messages
ar: وردت الرسائل
fa: پیام های دریافت شده
ru: Полученные сообщения
tr: Alınan Mesajlar

source: From:
ar: من:
fa: از:
ru: От:
tr: İtibaren:

source: Message:
ar: رسالة:
fa: پیام:
ru: Сообщение:
tr: Mesaj:

source: No received messages.
ar: لا توجد رسائل مستلمة.
fa: بدون پیام دریافت شده
ru: Нет полученных сообщений.
tr: Alınan mesaj yok.

source: Sent Messages
ar: رسائل أرسلت
fa: پیام های ارسال شده
ru: Отправлены сообщения
tr: Gönderilen Mesaj

source: To:
ar: ل:
fa: به:
ru: К:
tr: İle:

source: No sent messages.
ar: لا توجد رسائل مرسلة.
fa: بدون پیام ارسال شده
ru: Нет отправленных сообщений.
tr: Gönderilen mesaj yok.

source: Club Leader Voting
ar: قائد النادي التصويت
fa: رأی دادن به رهبر باشگاه
ru: Голосование лидера клуба
tr: Kulüp Lideri Oylama

source: Choose a Candidate:
ar: اختر مرشحًا:
fa: نامزد را انتخاب کنید:
ru: Выберите кандидата:
tr: Bir aday seçin:

source: Submit Vote
ar: تقديم التصويت
fa: رأی دادن
ru: Отправить голос
tr: Oy vermek

source: Name
ar: اسم
fa: نام
ru: Имя
tr: İsim

source: Description
ar: وصف
fa: شرح
ru: Описание
tr: Tanım

source: Event Date
ar: تاريخ الحدث
fa: تاریخ رویداد
ru: Дата события
tr: Olay tarihi

source: Image
ar: صورة
fa: تصویر
ru: Изображение
tr: İmaj

source: Created By
ar: تم إنشاؤها بواسطة
fa: ایجاد شده توسط
ru: Создан
tr: Tarafından yaratılan

source: Approval Status
ar: حالة الموافقة
fa: وضعیت تصویب
ru: Статус утверждения
tr: Onay durumu

source: Event
ar: حدث
fa: واقعه
ru: Событие
tr: Etkinlik

source: Club Leader
ar: قائد النادي
fa: رهبر باشگاه
ru: Лидер клуба
tr: Kulüp lideri

source: Reschedule Request for {self.event.title}
ar: طلب إعادة جدولة {self.event.title}
fa: درخواست تنظیم مجدد برای {self.event.title}
ru: Отправить запрос на {self.event.title}
